{"2026-01-01": {"prayer": "God of salvation and love, we are grateful for the gift of your dear son, Jesus Christ. Because of you and your sacrifice, we know true unconditional love. Let us live our lives in ways that share your love with others. Amen.", "doctrinal": "God’s love was revealed among us in this way: God sent his only Son into the world so that we might live through him. 1 John 4:9", "daily_watchword": "He will remove his people’s disgrace from all the earth. Isaiah 25:8 NIV", "verses": ["Psalm 1", "Genesis 1:1–2:3", "Matthew 1:1–17"]}, "2026-01-02": {"prayer": "God of mercy and compassion, in troubling times, help us remember to be a blessing to others, even though it is all too easy to return hate with hate. Let our actions be a reflection of you and your love. Amen.", "doctrinal": "Do not repay evil for evil or abuse for abuse, but, on the contrary, repay with a blessing. 1 Peter 3:9", "daily_watchword": "He will bless those who fear the LORD, both small and great. Psalm 115:13", "verses": ["Psalm 2", "Genesis 2:4–25", "Matthew 1:18–25"]}, "2026-01-03": {"prayer": "Holy One, help us be faithful brothers and sisters to the stranger in our midst. Where there is a need, may we feed the hungry, quench their thirst, and show them your love, peace, and comfort. Amen.", "doctrinal": "Beloved, you do faithfully whatever you do for the brothers and sisters, even though they are strangers to you. 3 John 5", "daily_watchword": "O LORD, do your eyes not look for truth? Jeremiah 5:3", "verses": ["Psalm 3", "Genesis 3,4", "Matthew 2:1–12"]}, "2026-01-04": {"prayer": "Creator of all, on this first Sunday of a new year, may we remember that no human has the power to save us or those we love. Only you and your mercy endure, and salvation comes only through you. We pray for love to conquer injustice. In your peace that surpasses all understanding, we pray. Amen.", "doctrinal": "The sick man answered [Jesus], “Sir, I have no man to put me into the pool when the water is stirred up; but while I am coming, another steps down before me.” Jesus said to him, “Rise, take up your bed and walk.” John 5:7-8 NKJV", "daily_watchword": "I waited patiently for the LORD; he inclined to me and heard my cry. Psalm 40:1", "verses": ["Jeremiah 31:7-14", "Psalm 147:12-20", "Ephesians 1:3-14", "John 1:(1-9),10-18"], "weekly_watchword": "Watchword for the week — Praise the name of the LORD, for his name alone is exalted; his glory is above earth and heaven. Psalm 148:13", "special_remarks": ["Second Sunday after Christmas"]}, "2026-01-05": {"prayer": "God of all creation, you made us in your image and gifted us your unqualified love. May we love all your children in the same way, no matter their color, creed, or where they live. They are yours just as we are yours…one earthly family in gratitude. Amen.", "doctrinal": "Now may our Lord Jesus Christ himself and God our Father, who loved us and through grace gave us eternal comfort and good hope, comfort your hearts and strengthen them in every good work and word. 2 Thessalonians 2:16-17", "daily_watchword": "The LORD is the strength of his people. Psalm 28:8", "verses": ["Psalm 4", "Genesis 5", "Matthew 2:13–23"]}, "2026-01-06": {"prayer": "Masterful Creator, you made all that is and gave humans free will, knowing that we would be imperfect and selfish beings. When we try to justify bad behaviors, touch our hearts with Jesus’ words, reminding us that peace comes from forgiveness, not blame. In trust, we pray. Amen.", "doctrinal": "And [Jesus] said to them, “Why are you afraid, you of little faith?” Then he got up and rebuked the winds and the sea, and there was a dead calm. Matthew 8:26", "daily_watchword": "You rule the raging of the sea; when its waves rise, you still them. Psalm 89:9", "verses": ["Psalm 5", "Genesis 6:1–7:10", "Matthew 3"], "special_remarks": ["Epiphany of the Lord", "Epiphany of the Lord — Isaiah 60:1-6; Psalm 72:1-7,10-14", "Ephesians 3:1-12; Matthew 2:1-12", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the LORD has risen upon you. Isaiah 60:1"]}, "2026-01-07": {"prayer": "Gracious God, you have assured us that no matter what we have done, we can turn from our past and move in a new direction. Help us, Lord, to boldly shine your light for others to see that what we do, we do for you. In Jesus’ name, we pray. Amen.", "doctrinal": "But those who do what is true come to the light, so that it may be clearly seen that their deeds have been done in God. John 3:21", "daily_watchword": "Turn back, turn back from your evil ways, for why will you die, O house of Israel? Ezekiel 33:11", "verses": ["Psalm 6", "Genesis 7:11–8:22", "Matthew 4:1–11"]}, "2026-01-08": {"prayer": "Mighty Savior, we rely upon your greatness in our lives. We appreciate your desire to be in relationship with us. May all we do shine forth your greatness and your love. We humbly pray, in Jesus’ name. Amen.", "doctrinal": "Father, I desire that those also, whom you have given me, may be with me where I am, to see my glory, which you have given me. John 17:24", "daily_watchword": "O Lord G!D, you have only begun to show your servant your greatness and your might. Deuteronomy 3:24", "verses": ["Psalm 7:1–9", "Genesis 9", "Matthew 4:12–25"]}, "2026-01-09": {"prayer": "Compassionate God, we thank you for turning our sorrow and our mourning into joy. We thank you for walking with us in our sufferings and for helping us to see beyond our sufferings toward the life ahead of us. We pray all of this, in Jesus’ name. Amen.", "doctrinal": "Our hope for you is unshaken, for we know that as you share in our sufferings, so also you share in our consolation. 2 Corinthians 1:7", "daily_watchword": "I will turn their mourning into joy. Jeremiah 31:13", "verses": ["Psalm 7:10–17", "Genesis 10:1–11:9", "Matthew 5:1–16"]}, "2026-01-10": {"prayer": "Our ultimate Teacher, we thank you for giving us the words to speak when we struggle to express ourselves. Thank you for walking with us when we are tempted to walk away. Thank you for always being near us. We pray, in Jesus’ name. Amen.", "doctrinal": "Pay close attention to yourself and to your teaching; continue in these things, for in doing this you will save both yourself and your hearers. 1 Timothy 4:16", "daily_watchword": "Far be it from us that we should rebel against the LORD and turn away this day. Joshua 22:29", "verses": ["Psalm 8", "Genesis 11:10–12:9", "Matthew 5:17–26"]}, "2026-01-11": {"prayer": "Gracious God, you sent your son to teach us the ways of justice and mercy. We pray for your forgiveness when we have failed to see the face of Christ reflected in our human siblings. Help us to act out your good news every day, in deed as well as word. This, we humbly pray. Amen.", "doctrinal": "Go into all the world and proclaim the good news to the whole creation. Mark 16:15", "daily_watchword": "The mighty one, God the LORD, speaks and summons the earth from the rising of the sun to its setting. Psalm 50:1", "verses": ["Isaiah 42:1-9", "Psalm 29", "Acts 10:34-43", "Matthew 3:13-17"], "weekly_watchword": "Watchword for the week — A bruised reed he will not break, and a dimly burning wick he will not quench; he will faithfully bring forth justice. Isaiah 42:3", "special_remarks": ["First Sunday after Epiphany"]}, "2026-01-12": {"prayer": "Almighty Physician, we pray for healing in our lives and in the lives of others. Our bodies and minds are frail, yet your gentle touch lifts us up. We pray that you grant courage and strength to all those who do the work of healing in our communities every day. Grant unto them your peace. Amen.", "doctrinal": "But Jesus rebuked the unclean spirit, healed the boy, and gave him back to his father. Luke 9:42", "daily_watchword": "O LORD, there is no difference for you between helping the mighty and the weak. 2 Chronicles 14:11", "verses": ["Psalm 9:1–10", "Genesis 12:10–13:18", "Matthew 5:27–42"]}, "2026-01-13": {"prayer": "God of all, when we despise our neighbor, we despise you. When we scorn our neighbor, we scorn you. Our anger and greed tear down the house you have built for us with your mighty hands. Deliver us from the poison of selfishness. Help us give thanks for your free gift of love by extending that love to others. Amen.", "doctrinal": "Jesus answered him, “Those who love me will keep my word, and my Father will love them, and we will come to them and make our home with them.” John 14:23", "daily_watchword": "The LORD declares: far be it from me, for those who honor me I will honor, and those who despise me shall be treated with contempt. 1 Samuel 2:30", "verses": ["Psalm 9:11–20", "Genesis 14,15", "Matthew 5:43–6:4"]}, "2026-01-14": {"prayer": "Omnipresent God, who follows us into all corners of life, grant us the courage to live in faithful response to your sacred whispers on behalf of those who live in fear, yet seeking mercy amidst unanswered prayers. Grant us the words and actions to “tell the people the whole message about this life.” Amen.", "doctrinal": "But during the night an angel of the Lord opened the prison doors, brought them out, and said, “Go, stand in the temple and tell the people the whole message about this life.” Acts 5:19-20", "daily_watchword": "The angel of the LORD encamps around those who fear him and delivers them. Psalm 34:7", "verses": ["Psalm 10:1–11", "Genesis 16,17", "Matthew 6:5–18"]}, "2026-01-15": {"prayer": "At the dawn of each new day, gracious Savior, may we rise with praise on our lips and gladness in our hearts. May such praise become hope for those who hear it, and may our gladness bring courage to those who walk silently and with heavy hearts. Amen.", "doctrinal": "All nations will come and worship before you, for your judgments have been revealed. Revelation 15:4", "daily_watchword": "O come, let us sing to the LORD; let us make a joyful noise to the rock of our salvation! Psalm 95:1", "verses": ["Psalm 10:12–18", "Genesis 18", "Matthew 6:19–34"]}, "2026-01-16": {"prayer": "Creator of all that is, ever has been, and all that is yet to come—unite us in our best efforts to be your Gospel in this day. Thus, may our best selves be inspired by your Spirit to embrace the wonderful tapestry of your creation, not only our siblings in faith, but also those feeling marginalized, homeless in body and faith, or cast out from the care of community. Amen.", "doctrinal": "For in the one Spirit we were all baptized into one body—Jews or Greeks, slaves or free— and we were all made to drink of one Spirit. 1 Corinthians 12:13", "daily_watchword": "Let us go with you, for we have heard that God is with you. Zechariah 8:23", "verses": ["Psalm 11", "Genesis 19:1–29", "Matthew 7:1–12"]}, "2026-01-17": {"prayer": "Comforting Lord, we come to you today with thanksgiving as we reflect on the safety of your arms. You are a place of refuge when we feel weary; a place of wholeness when we feel broken; a place of love when we feel forgotten. Be with us, Lord, as we go through this day and may we remember to turn to you always. In the name of Jesus, we pray. Amen.", "doctrinal": "When [Blind Bartimaeus] heard that it was Jesus of Nazareth, he began to shout out and say, “Jesus, Son of David, have mercy on me!” Mark 10:47", "daily_watchword": "The LORD is my refuge. Psalm 91:9 NIV", "verses": ["Psalm 12", "Genesis 19:30–20:18", "Matthew 7:13–23"]}, "2026-01-18": {"prayer": "Gracious God, we are thankful for your presence in our lives. Your peace brings us comfort and your grace brings us hope. May we always remember to lift our burdens to you and leave them in your merciful arms. We pray this in your loving name. Amen.", "doctrinal": "Grace, mercy, and peace will be with us from God the Father and from Jesus Christ, the Father’s Son, in truth and love. 2 John 3", "daily_watchword": "I will make peace your governor and well-being your ruler. Isaiah 60:17 NIV", "verses": ["Isaiah 49:1-7", "Psalm 40:1-11", "1 Corinthians 1:1-9", "John 1:29-42"], "weekly_watchword": "Watchword for the week — God is faithful; by him you were called into the fellowship of his Son, Jesus Christ our Lord. 1 Corinthians 1:9", "special_remarks": ["Second Sunday after Epiphany"]}, "2026-01-19": {"prayer": "Lord, we turn to you to seek your guidance. May we trust your words as we listen to the still small voice inside. You are an amazing God who will never let us go, and for this we are thankful. Amen.", "doctrinal": "Jesus said, “The words that I have spoken to you are spirit and life.” John 6:63", "daily_watchword": "First seek the counsel of the LORD. 2 Chronicles 18:4 NIV", "verses": ["Psalm 13", "Genesis 21", "Matthew 7:24–8:4"]}, "2026-01-20": {"prayer": "Protecting God, when the whole world feels out of control, your power never waivers. You are the source of our strength and our divine leader. Help us to place our trust in you and only you. Amen.", "doctrinal": "For we did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we had been eyewitnesses of his majesty. 2 Peter 1:16", "daily_watchword": "With many dreams come vanities and a multitude of words, but fear God. Ecclesiastes 5:7", "verses": ["Psalm 14", "Genesis 22", "Matthew 8:5–22"]}, "2026-01-21": {"prayer": "As a deer longs for flowing streams, so my soul longs for you, O God. We thirst, and you provide a spring of water gushing with eternal life. Quench our spiritual yearnings with the Savior’s presence and peace. Amen.", "doctrinal": "So we are always confident, even though we know that while we are at home in the body we are away from the Lord—for we walk by faith, not by sight. 2 Corinthians 5:6-7", "daily_watchword": "My soul thirsts for God, for the living God. When shall I come and behold the face of God? Psalm 42:2", "verses": ["Psalm 15", "Genesis 23:1–24:25", "Matthew 8:23–34"]}, "2026-01-22": {"prayer": "Gracious God, we were pilgrims without a guide, ambassadors without a mission, sheep without a shepherd, disciples without a master, sinners without a savior. We thank you for answering our deepest spiritual needs in the person of Jesus Christ. Amen.", "doctrinal": "Remember that you were at that time without Christ, having no hope and without God in the world. But now in Christ Jesus you who once were far off have been brought near by the blood of Christ. Ephesians 2:12-13", "daily_watchword": "Those he gathered from the lands, from east and west, from north and south: Let them give thanks to the LORD for his unfailing love and his wonderful deeds for mankind. Psalm 107:3,8 NIV", "verses": ["Psalm 16:1–6", "Genesis 24:26–67", "Matthew 9:1–13"]}, "2026-01-23": {"prayer": "Lord Jesus, you have brought God’s glorious kingdom into greater focus. When you healed the sick, we began to see a day of healing and wholeness for all creation. When you fed the multitudes, we saw a day when there would be hunger no more. When you forgave sinners, we saw a day when all people would be reconciled. Draw us deeper into your kingdom to live on earth as in heaven. Amen.", "doctrinal": "He will reign over the house of Jacob forever, and of his kingdom there will be no end. Luke 1:33", "daily_watchword": "The LORD will reign forever and ever. Exodus 15:18", "verses": ["Psalm 16:7–11", "Genesis 25", "Matthew 9:14–26"]}, "2026-01-24": {"prayer": "God of generations, thank you for the women and men who have gone before us, faithfully working for the coming of your kingdom. Help us to join them in making Christ, who teaches us to care for the weak and forgotten, the cornerstone whom we ourselves love and serve. Amen.", "doctrinal": "You are built upon the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone. Ephesians 2:20", "daily_watchword": "Their congregation shall be established before me. Jeremiah 30:20", "verses": ["Psalm 17:1–7", "Genesis 26", "Matthew 9:27–38"]}, "2026-01-25": {"prayer": "Creator of galaxies, maker of atoms, you give breath to everything we know and much we do not know. Give us the wisdom and determination to preserve your earth with all its peoples, creatures, and intricate ecosystems. Accept our care of creation as our way to love, worship, and serve you. Amen.", "doctrinal": "Ever since the creation of the world God’s eternal power and divine nature, invisible though they are, have been seen and understood through the things God has made. Romans 1:20", "daily_watchword": "It is I who by my great power and my outstretched arm have made the earth, with the people and animals that are on the earth, and I give it to whomever I please. Jeremiah 27:5", "verses": ["Isaiah 9:1-4", "Psalm 27:1,4-9", "1 Corinthians 1:10-18", "Matthew 4:12-23"], "weekly_watchword": "Watchword for the week — The LORD is my light and my salvation; whom shall I fear? The LORD is the stronghold of my life; of whom shall I be afraid? Psalm 27:1", "special_remarks": ["Third Sunday after Epiphany"]}, "2026-01-26": {"prayer": "You do not use your power, God, to press us down. Instead, you lift us up, giving us hopeful thoughts to think and loving words to speak. Be with us and the leaders we empower. Help us and our leaders to grow in love for you and our neighbors. Amen.", "doctrinal": "First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for everyone, for kings and all who are in high positions. 1 Timothy 2:1-2", "daily_watchword": "He changes times and seasons, deposes kings and sets up kings. Daniel 2:21", "verses": ["Psalm 17:8–15", "Genesis 27:1–29", "Matthew 10:1–16"]}, "2026-01-27": {"prayer": "Lord of all, forgive us when we doubt your word and fail to trust in your power to deliver us in times of danger and distress. Forgive us when we feel alone in a world where cruelty seems to prevail and our faith is tested—even by those closest to us. Thank you for the blessed assurance of your word, which reminds us that we can rest in your unfailing protection. Amen.", "doctrinal": "Come now, you who say, “Today or tomorrow we will go to such and such a town and spend a year there, doing business and making money.” Instead you ought to say, “If the Lord wishes, we will live and do this or that.” James 4:13,15", "daily_watchword": "For my thoughts are not your thoughts, nor are your ways my ways, says the LORD. Isaiah 55:8", "verses": ["Psalm 18:1–6", "Genesis 27:30–28:9", "Matthew 10:17–25"]}, "2026-01-28": {"prayer": "Compassionate God, you have called us to be bold in our faith, to fear no one, but trust in your divine care. Strengthen our hearts when we face opposition, reminding us that you see and value every sparrow—yet how much more you care for us! Help us to stand firm, to confess you before others, and to take up our cross daily, knowing that true life is found in you. May we love you above all else and walk in obedience, knowing that in losing our lives for your sake, we find the greatest reward. Amen.", "doctrinal": "[Jairus] pleaded earnestly with [Jesus], “My little daughter is dying. Please come and put your hands on her so that she will be healed and live.” Mark 5:23 NIV", "daily_watchword": "Do not forsake me, O LORD; O my God, do not be far from me. Psalm 38:21", "verses": ["Psalm 18:7–15", "Genesis 28:10–29:14", "Matthew 10:26–42"]}, "2026-01-29": {"prayer": "Loving Savior, when doubts arise, remind us of your mighty works and unfailing promises. Like John the Baptist, we seek assurance in times of uncertainty— help us to trust that you are the one who brings healing, restoration, and salvation. Open our hearts to recognize your presence and follow your ways. May we live as messengers of your truth, preparing the way for others to know you. Amen.", "doctrinal": "And he stood up and immediately took the mat and went out before all of them, so that they were all amazed and glorified God, saying, “We have never seen anything like this!” Mark 2:12", "daily_watchword": "You have multiplied, O LORD my God, your wondrous deeds and your thoughts toward us; none can compare with you. Psalm 40:5", "verses": ["Psalm 18:16–24", "Genesis 29:15–30:24", "Matthew 11:1–10"]}, "2026-01-30": {"prayer": "Provider, just like the loaves and the fish, you know our needs, and we lift those needs to you each day. Your care for us is tender and beautiful and we are filled with gratitude for your love. Amen.", "doctrinal": "Taking the five loaves and the two fish, he looked up to heaven and blessed and broke the loaves and gave them to his disciples to set before the people, and he divided the two fish among them all. And all ate and were filled. Mark 6:41-42", "daily_watchword": "In response to his people the LORD said, “I am sending you grain, wine, and oil, and you will be satisfied.” Joel 2:19", "verses": ["Psalm 18:25–29", "Genesis 30:25–31:21", "Matthew 11:11–24"]}, "2026-01-31": {"prayer": "Holy Redeemer, we want to shout on the mountain tops our praise for you. Even on the darkest days of winter, your love and redemption see us through. You are always worthy of all our praise. Amen.", "doctrinal": "Jumping up, he stood and began to walk, and he entered the temple with them, walking and leaping and praising God. Acts 3:8", "daily_watchword": "For you, O LORD, have made me glad by your work; at the works of your hands I sing for joy. Psalm 92:4", "verses": ["Psalm 18:30–36", "Genesis 31:22–55", "Matthew 11:25–12:8"]}, "2026-02-01": {"prayer": "Morning Star, as the morning dew fades and your loving spirit rises, abide with us today. With each passing encounter, as children of the King of grace, may we give our best efforts to those in need of comfort, insight, and love. Amen.", "doctrinal": "Jesus said, “Abide in my love.” John 15:9", "daily_watchword": "Your love is like the dew that goes away early. Hosea 6:4", "verses": ["Micah 6:1-8", "Psalm 15", "1 Corinthians 1:18-31", "Matthew 5:1-12"], "weekly_watchword": "Watchword for the week — For the message about the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God. 1 Corinthians 1:18", "special_remarks": ["Fourth Sunday after Epiphany"]}, "2026-02-02": {"prayer": "Morning Star, on this day of new opportunities, may we rise up with boldness and meet each challenge with resolve and integrity. Let us embrace the protectiveness of Joseph, the tenderness of Mary, and the resilience of the kings. Amen.", "doctrinal": "Do not, therefore, abandon that boldness of yours; it brings a great reward. Hebrews 10:35", "daily_watchword": "But when they cried out to the LORD, he raised up for them a deliverer, who saved them. Judges 3:9 NIV", "verses": ["Psalm 18:37–45", "Genesis 32:1–21", "Matthew 12:9–21"]}, "2026-02-03": {"prayer": "Morning Star, travel with us this today. Inspire us to help those in need of aid. Let us give them a helping hand, a tender ear or do a simple task, and be the wiser and better for our efforts to show your grace. Amen.", "doctrinal": "Has not God chosen the poor in the world to be rich in faith and to be heirs of the kingdom that he has promised to those who love him? James 2:5", "daily_watchword": "Those who mock the poor insult their Maker; those who are glad at calamity will not go unpunished. Proverbs 17:5", "verses": ["Psalm 18:46–50", "Genesis 32:22–33:20", "Matthew 12:22–32"]}, "2026-02-04": {"prayer": "Divine God, come and guide us this day. Help us see the needs of others and give us the willingness to meet those needs with an unjudging spirit of love. Amen.", "doctrinal": "I am the vine; you are the branches. Those who abide in me and I in them bear much fruit. John 15:5", "daily_watchword": "Blessed are those who trust in the LORD, like a tree planted by water, sending out its roots by the stream. In the year of drought it is not anxious, and it does not cease to bear fruit. Jeremiah 17:7,8", "verses": ["Psalm 19:1–6", "Genesis 34", "Matthew 12:33–45"]}, "2026-02-05": {"prayer": "Divine God, let your light beacon our steps of hope to the weak and forgotten friend-travelers. Let us deliver a balm of optimism and help restore hope by walking beside others, moving forward, out of weariness and despair, into full renewal. Amen.", "doctrinal": "But the Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3", "daily_watchword": "Protect me, O God, for in you I take refuge. Psalm 16:1", "verses": ["Psalm 19:7–14", "Genesis 35:1–36:8", "Matthew 12:46–13:9"]}, "2026-02-06": {"prayer": "Divine God, wash the biased dirt out of our eyes. Delete our sins. Forgive our wayward ramblings. Restore your clearer sight in us, so we may better serve those entrusted to our care. Amen.", "doctrinal": "Jesus said, “Then he will answer them, ‘Truly I tell you, just as you did not do it to one of the least of these, you did not do it to me.’” Matthew 25:45", "daily_watchword": "Lord, you are righteous, but this day we are covered with shame. Daniel 9:7 NIV", "verses": ["Psalm 20", "Genesis 36:9–43", "Matthew 13:10–23"]}, "2026-02-07": {"prayer": "Comforting Jesus, we think we are in charge of our own lives. Holy Spirit, we control far less than we imagine. Let our wills bow before your authority and experience your truth and peace. Amen.", "doctrinal": "For he is our peace. Ephesians 2:14", "daily_watchword": "Great will be his authority, and there shall be endless peace. Isaiah 9:7", "verses": ["Psalm 21", "Genesis 37", "Matthew 13:24–35"]}, "2026-02-08": {"prayer": "Comforting Jesus, as your star guided the wisemen to the toddler king, may we, too, pass our gifts of time, talent, and treasure to the church we serve locally, and then rejoice with thanksgiving. Amen.", "doctrinal": "They broke bread at home and ate their food with glad and generous hearts, praising God and having the goodwill of all the people. Acts 2:46-47", "daily_watchword": "The Lord has done great things for us, and we rejoiced. Psalm 126:3", "verses": ["Isaiah 58:1-9a,(9b-12)", "Psalm 112:1-9,(10)", "1 Corinthians 2:1-12,(13-16)", "Matthew 5:13-20"], "weekly_watchword": "Watchword for the week — For I decided to know nothing among you except Jesus Christ, and him crucified. 1 Corinthians 2:2", "special_remarks": ["Fifth Sunday after Epiphany"]}, "2026-02-09": {"prayer": "Comforting Jesus, inspire us to listen to the “other voices” of the immigrants among us. Help us to not look over them but instead look into their eyes and hear their stories. May what we hear remind us of our own immigrant roots and may we see them as friend-travelers, not enemies. Amen.", "doctrinal": "Jesus said, “You are my friends if you do what I command you.” John 15:14", "daily_watchword": "When a foreigner resides among you in your land, do not mistreat them. Leviticus 19:33 NIV", "verses": ["Psalm 22:1–8", "Genesis 38", "Matthew 13:36–46"]}, "2026-02-10": {"prayer": "Kindly Light, brighten our path and guide our feet along the trail, sharing your compassionate acts of light with every friend-traveler we meet on this magnificent day. Amen.", "doctrinal": "But for that very reason I received mercy, so that in me, as the foremost, Jesus Christ might display the utmost patience as an example to those who would come to believe in him for eternal life. 1 Timothy 1:16", "daily_watchword": "Jacob said, “I am not worthy of the least of all the steadfast love and all the faithfulness that you have shown to your servant.” Genesis 32:10", "verses": ["Psalm 22:9–21", "Genesis 39", "Matthew 13:47–58"]}, "2026-02-11": {"prayer": "Kindly Light, shine on us this day with beauty abundant. Help us to better grasp our charge to lead and serve others with vigor, frankness, and mercy. May we lavish others with kindnesses to warm their souls. Amen.", "doctrinal": "God has not rejected his people whom he foreknew. Romans 11:2", "daily_watchword": "Is Ephraim my dear son? Is he the child in whom I delight? As often as I speak against him, I still remember him. Therefore I am deeply moved for him; I will surely have mercy on him, says the LORD. Jeremiah 31:20", "verses": ["Psalm 22:22–28", "Genesis 40:1–41:16", "Matthew 14:1–14"]}, "2026-02-12": {"prayer": "Kindly Light, your mercy untangles our many personal sins. Your witness, through Jesus, holds us accountable for our actions and inactions. Forgive us. Redeem us. Return us to the lighted path of purpose. Amen.", "doctrinal": "You know that he was revealed to take away sins, and in him there is no sin. 1 John 3:5", "daily_watchword": "I have swept away your transgressions like a cloud and your sins like mist; return to me, for I have redeemed you. Isaiah 44:22", "verses": ["Psalm 22:29–31", "Genesis 41:17–57", "Matthew 14:15–24"]}, "2026-02-13": {"prayer": "Radiant Master, your spirit of love and purpose pours through us this day to make a difference in our neighborhoods. May we gleam with humility. Grace our sweaty brows with mercy. Amen.", "doctrinal": "As you therefore have received Christ Jesus the Lord, continue to walk in him, rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving. Colossians 2:6-7", "daily_watchword": "But if you do not obey the LORD, and if you rebel against his commands, his hand will be against you, as it was against your ancestors. 1 Samuel 12:15 NIV", "verses": ["Psalm 23", "Genesis 42", "Matthew 14:25–15:9"]}, "2026-02-14": {"prayer": "Radiant Master, lead us this full day showing others creative engagement and abundant compassion. May we show tender mercies to our neighbors near and far. Amen.", "doctrinal": "Meanwhile the church throughout Judea, Galilee, and Samaria had peace and was built up. Living in the fear of the Lord and in the comfort of the Holy Spirit, it increased in numbers. Acts 9:31", "daily_watchword": "He guards the lives of his faithful; he rescues them from the hand of the wicked. Psalm 97:10", "verses": ["Psalm 24", "Genesis 43", "Matthew 15:10–20"]}, "2026-02-15": {"prayer": "Radiant Master, as Joseph forgave his brothers for their jealous actions, may we do the same in our own families. May our acts of personal clemency help heal the divisions within our homes and influence our neighbors toward forgiveness. Amen.", "doctrinal": "Be kind to one another, tenderhearted, forgiving one another, as God in Christ has forgiven you. Ephesians 4:32", "daily_watchword": "Joseph’s brothers said, “Now therefore please forgive the crime of the servants of the God of your father.” Genesis 50:17", "verses": ["Exodus 24:12-18", "Psalm 2", "2 Peter 1:16-21", "Matthew 17:1-9"], "weekly_watchword": "Watchword for the week — God said, “This is my Son, the Beloved; with him I am well pleased; listen to him!” Matthew 17:5", "special_remarks": ["Last Sunday after Epiphany", "Transfiguration of our Lord"]}, "2026-02-16": {"prayer": "Risen Redeemer, we rise this day to be influencers of goodness and change in your world through Christian morals and actions. Let us be like the angels among us, bringing joy to God’s children. Amen.", "doctrinal": "Jesus said, “Then he will send out the angels and gather the elect from the four winds, from the ends of the earth to the ends of heaven.” Mark 13:27", "daily_watchword": "See, I am sending my messenger to prepare the way before me. Malachi 3:1", "verses": ["Psalm 25:1–7", "Genesis 44", "Matthew 15:21–28"]}, "2026-02-17": {"prayer": "Risen Redeemer, we await the beginning of another renewing Lenten journey. May we not binge too loosely this “Fat Tuesday”, for we are still called to “teach the splendor of your ways,” every day. Amen.", "doctrinal": "They shall have the knowledge of God’s mystery, that is, Christ, in whom are hidden all the treasures of wisdom and knowledge. Colossians 2:2-3", "daily_watchword": "The secret things belong to the LORD our God, but the revealed things belong to us and to our children forever. Deuteronomy 29:29", "verses": ["Psalm 25:8–22", "Genesis 45", "Matthew 15:29–16:4"]}, "2026-02-18": {"prayer": "Risen Redeemer, we enter our 40 days of spiritual journey looking inward to fortify and bolster our faithfulness. Guard our hearts, empower our understanding, strengthen our souls, and heal our shortcomings during this time of reflection. Amen.", "doctrinal": "They were all astounded and kept saying to one another, “What kind of word is this, that with authority and power he commands the unclean spirits and they come out?” Luke 4:36", "daily_watchword": "Let your steadfast love come to me, O LORD, your salvation according to your promise. Psalm 119:41", "verses": ["Psalm 26", "Genesis 46:1–27", "Matthew 16:5–20"], "special_remarks": ["Ash Wednesday", "Ash Wednesday — Joel 2:1-2,12-17; Psalm 51:1-17", "2 Corinthians 5:20b-6:10; Matthew 6:1-6,16-21"]}, "2026-02-19": {"prayer": "Risen Redeemer, when the morning rays reach our countenances, our souls warm and you comfort us to motivate, delegate, and instigate goodness and grace in a cold and sometimes bitter world. Amen.", "doctrinal": "May the God of steadfastness and encouragement grant you to live in harmony with one another, in accordance with Christ Jesus, so that together you may with one voice glorify the God and Father of our Lord Jesus Christ. Romans 15:5-6", "daily_watchword": "Bless our God, O peoples; let the sound of his praise be heard, who has kept us among the living and has not let our feet slip. Psalm 66:8-9", "verses": ["Psalm 27:1–6", "Genesis 46:28–47:31", "Matthew 16:21–28"]}, "2026-02-20": {"prayer": "Risen Redeemer, deepen our Lenten disciplines. As we look spiritually inward, bolster our confidence to reach out and bring others to you. May we grow morally and spiritually. Amen.", "doctrinal": "May mercy, peace, and love be yours in abundance. Jude 2", "daily_watchword": "Do not, O LORD, withhold your mercy from me; let your steadfast love and your faithfulness keep me safe forever. Psalm 40:11", "verses": ["Psalm 27:7–14", "Genesis 48", "Matthew 17:1–13"]}, "2026-02-21": {"prayer": "Renewing Savior, lead us forward, guide us onward, and rekindle our purpose as we serve, live, and worship together. As we renew our walk, may we revitalize our personal service with our local church. Amen.", "doctrinal": "So if anyone is in Christ, there is a new creation: everything old has passed away; look, new things have come into being! 2 Corinthians 5:17", "daily_watchword": "Do not remember the former things or consider the things of old. I am about to do a new thing; now it springs forth; do you not perceive it? Isaiah 43:18-19", "verses": ["Psalm 28", "Genesis 49", "Matthew 17:14–27"]}, "2026-02-22": {"prayer": "Renewing Savior, let us not look away from the poor and the needy in our neighborhoods, but instead, let us find positive, practical ways to engage with those in need. May our service to them help restore their bodies, hearts, minds, and souls through lovingkindness. Amen.", "doctrinal": "For you know the generous act of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, so that by his poverty you might become rich. 2 Corinthians 8:9", "daily_watchword": "The meek shall obtain fresh joy in the LORD, and the neediest people shall exult in the Holy One of Israel. Isaiah 29:19", "verses": ["Genesis 2:15-17,3:1-7", "Psalm 32", "Romans 5:12-19", "Matthew 4:1-11"], "weekly_watchword": "Watchword for the week — Be glad in the LORD and rejoice, O righteous, and shout for joy, all you upright in heart. Psalm 32:11", "special_remarks": ["First Sunday in Lent"]}, "2026-02-23": {"prayer": "Renewing Savior, during this Lenten quest for a confident walk with Jesus, restore our desire and duty to serve and share mercy with others. Bless our souls with action. Let your love shine through us today. Amen.", "doctrinal": "Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them. Luke 1:68", "daily_watchword": "Shout, make your praises heard, and say, “LORD, save your people.” Jeremiah 31:7 NIV", "verses": ["Psalm 29", "Genesis 50", "Matthew 18:1–14"]}, "2026-02-24": {"prayer": "Renewing Savior, may we be committed today to provide food for the body, knowledge for the mind, comfort for the spirit, and purpose for the soul. We await this day as an opportunity for discipleship. Amen.", "doctrinal": "If a brother or sister is naked and lacks daily food and one of you says to them, “Go in peace; keep warm and eat your fill,” and yet you do not supply their bodily needs, what is the good of that? James 2:15-16", "daily_watchword": "I know that the LORD maintains the cause of the needy and executes justice for the poor. Psalm 140:12", "verses": ["Psalm 30:1–5", "Exodus 1:1–2:10", "Matthew 18:15–35"]}, "2026-02-25": {"prayer": "Leading Shepherd, let us hear your clear voice, calling us out of our occasional spiritual complacency and into a more active love, which tears down walls and transforms them into bridges for our neighbors to cross. Amen.", "doctrinal": "A voice from the cloud said, “This is my Son, the Beloved; with him I am well pleased; listen to him!” Matthew 17:5", "daily_watchword": "I am the LORD; I have called you in righteousness; I have taken you by the hand. Isaiah 42:6", "verses": ["Psalm 30:6–12", "Exodus 2:11–3:22", "Matthew 19:1–12"]}, "2026-02-26": {"prayer": "Loving Father, as this month draws to a close, your love for us draws nearer to our heart. From that loving care, help us as we trek outward to rectify, rejuvenate, and revive the people of your church. Amen.", "doctrinal": "But even if you do suffer for doing what is right, you are blessed. 1 Peter 3:14", "daily_watchword": "But the path of the righteous is like the light of dawn, which shines brighter and brighter until full day. Proverbs 4:18", "verses": ["Psalm 31:1–5", "Exodus 4:1–5:9", "Matthew 19:13–22"]}, "2026-02-27": {"prayer": "Loving Son, continue to show and teach us better ways to handle strife, grief, bitterness, anger, and self-righteousness among our neighbors. Motivate us to reach out in love and truth, bringing reconciliation that yields healing and forgiveness. Amen.", "doctrinal": "And will not God grant justice to his chosen ones who cry to him day and night? Will he delay long in helping them? I tell you, he will quickly grant justice to them. Luke 18:7-8", "daily_watchword": "Let your ear be attentive and your eyes open to hear the prayer of your servant that I now pray before you day and night for your servants. Nehemiah 1:6", "verses": ["Psalm 31:6–9", "Exodus 5:10–6:12", "Matthew 19:23–30"]}, "2026-02-28": {"prayer": "Loving Holy Spirit, like a mother tending to the various needs of her spiritual family, restore and heal us, so that we may lead others with courage and fortitude to move and change the landscape of our neighborhoods. Amen.", "doctrinal": "For we are what he has made us, created in Christ Jesus for good works, which God prepared beforehand so that we may walk in them. Ephesians 2:10", "daily_watchword": "You turn things upside down! Shall the potter be regarded as the clay? Shall the thing made say of its maker, “He did not make me,” or the thing formed say of the one who formed it, “He has no understanding?” Isaiah 29:16", "verses": ["Psalm 31:10–20", "Exodus 6:13–7:24", "Matthew 20:1–16"]}, "2026-03-01": {"prayer": "Loving God, you ask us to turn our hearts to you. Why is it so difficult to follow your statutes? Accept us in our strengths and weakness as we seek to fulfill your call: love God, love neighbor, love self. In your name, we pray. Amen.", "doctrinal": "For the love of God is this, that we obey his commandments. And his commandments are not burdensome. 1 John 5:3", "daily_watchword": "Be very careful, therefore, to love the LORD your God. Joshua 23:11", "verses": ["Genesis 12:1-4a", "Psalm 121", "Romans 4:1-5,13-17", "John 3:1-17"], "weekly_watchword": "Watchword for the week — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16", "special_remarks": ["Second Sunday in Lent March 1, 1457:", "Beginning of the Unity of the Brethren in Bohemia"]}, "2026-03-02": {"prayer": "God of community, you gather your creation in your arms and hold it gently in your care. Help us to treat one another as siblings in your love and remind us that we have more that connects us than divides us. Amen.", "doctrinal": "Many will come from east and west and will take their places at the banquet with Abraham and Isaac and Jacob in the kingdom of heaven. Matthew 8:11", "daily_watchword": "All the ends of the earth shall remember and turn to the LORD. Psalm 22:27", "verses": ["Psalm 31:21–24", "Exodus 8", "Matthew 20:17–28"]}, "2026-03-03": {"prayer": "Forgive us, Lord, we pray. Remove our sins and help us to walk in your path of righteousness. We turn our lives back to you, merciful God, as we strive to live in the fullness of your love. Amen.", "doctrinal": "John the Baptist said, “Repent, for the kingdom of heaven has come near.” Matthew 3:2", "daily_watchword": "So the Israelites cried to the LORD, saying, “We have sinned against you, because we have abandoned our God.” Judges 10:10", "verses": ["Psalm 32", "Exodus 9", "Matthew 20:29–21:11"]}, "2026-03-04": {"prayer": "You tell us to ask for what we need, Lord, but what if we don’t know what we need? We come and sit in your presence, our hearts and minds open to your leading. Our spirits cry for your guidance. Lord, help us. Amen.", "doctrinal": "If you, then, who are evil, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask him! Matthew 7:11", "daily_watchword": "Take delight in the LORD, and he will give you the desires of your heart. Psalm 37:4", "verses": ["Psalm 33:1–5", "Exodus 10", "Matthew 21:12–22"]}, "2026-03-05": {"prayer": "Obedience is hard for your children, mothering God. Even when we disobey, you guide us back to the paths which will bring us life. Bless us as we try to follow your ways and lead us gently back to life. Amen.", "doctrinal": "You are worthy, our Lord and God, to receive glory and honor and power, for you created all things, and by your will they existed and were created. Revelation 4:11", "daily_watchword": "My hand laid the foundation of the earth, and my right hand spread out the heavens; when I summon them, they stand at attention. Isaiah 48:13", "verses": ["Psalm 33:6–11", "Exodus 11:1–12:20", "Matthew 21:23–32"]}, "2026-03-06": {"prayer": "God of abundance, all we have is yours. Help us to rid ourselves of the excesses that lead us away from you and from your call to serve. Help us relinquish that which separates us from seeing others’ needs and rejoice in all you have given us. Amen.", "doctrinal": "When Jesus heard this, he said to him, “There is still one thing lacking. Sell all that you own and distribute the money to the poor, and you will have treasure in heaven; then come, follow me.” Luke 18:22", "daily_watchword": "The righteous know the rights of the poor. Proverbs 29:7", "verses": ["Psalm 33:12–22", "Exodus 12:21–51", "Matthew 21:33–46"]}, "2026-03-07": {"prayer": "God, we see you in the faces of all we encounter in your beloved creation. We see you in joy and in sorrow, in the persecuted and in the free. We see you walking among us, working alongside us, struggling and rejoicing with us. We see you, God! Amen.", "doctrinal": "Jesus said to him, “Whoever has seen me has seen the Father.” John 14:9", "daily_watchword": "Why should the nations say, “Where is their God?” Our God is in the heavens; he does whatever he pleases. Psalm 115:2-3", "verses": ["Psalm 34:1–7", "Exodus 13:1–14:18", "Matthew 22:1–14"]}, "2026-03-08": {"prayer": "We kneel and pray to you, ever-present Savior, so we may hear your call. We are thankful you call us by name and into your service. Give us strength of heart, mind, body, and spirit to follow you. Amen.", "doctrinal": "When Jesus came to the place, he looked up and said to him, “Zacchaeus, hurry and come down, for I must stay at your house today.” Luke 19:5", "daily_watchword": "My lord, if I find favor with you, do not pass by your servant. Genesis 18:3", "verses": ["Exodus 17:1-7", "Psalm 95", "Romans 5:1-11", "John 4:5-42"], "weekly_watchword": "Watchword for the week — O come, let us worship and bow down, let us kneel before the LORD, our Maker! Psalm 95:6", "special_remarks": ["Third Sunday in Lent"]}, "2026-03-09": {"prayer": "It feels chaotic around us, God! We know you brought order out of chaos at the beginning of the world; show us how to bring your peace and healing to all that you created. May we be instruments of your peace to help clear the chaos and restore your shalom. Amen.", "doctrinal": "From one ancestor he made all peoples to inhabit the whole earth. Acts 17:26", "daily_watchword": "The heavens are yours; the earth also is yours; the world and all that is in it—you founded them. The north and the south—you created them. Psalm 89:11-12", "verses": ["Psalm 34:8–18", "Exodus 14:19–15:21", "Matthew 22:15–22"]}, "2026-03-10": {"prayer": "What does boldness look like to you, loving God? Is it standing in a lion’s den or stepping out of a boat or defying tyrants? To that you say, “yes,” and promise to stand with us. Teach us to be bold in our words, thoughts, and actions. Amen.", "doctrinal": "Grant to your servants to speak your word with all boldness. Acts 4:29", "daily_watchword": "Do not fear, for I am with you; do not be afraid, for I am your God. Isaiah 41:10", "verses": ["Psalm 34:19–22", "Exodus 15:22–16:36", "Matthew 22:23–40"]}, "2026-03-11": {"prayer": "Ever hope-giving God, we lay down our stress, fear, and anxiety to live in the promise that you restore. As you gave new life to others, we ask for the same blessing for ourselves. Restore us mind, body, and spirit, Lord. Amen.", "doctrinal": "That evening they brought to him many who were possessed by demons, and he cast out the spirits with a word and cured all who were sick. Matthew 8:16", "daily_watchword": "My soul languishes for your salvation; I hope in your word. Psalm 119:81", "verses": ["Psalm 35:1–10", "Exodus 17:1–18:6", "Matthew 22:41–23:12"]}, "2026-03-12": {"prayer": "In this Lenten season, we acknowledge the suffering you faced, Lord. Though you did not deserve your sacrifice, we express our gratitude. May the promise of your salvation fill us with awe and wonder. Let us contemplate what that means in our lives and in our relationship with you. Amen.", "doctrinal": "He was delivered over to death for our sins and was raised to life for our justification. Romans 4:25 NIV", "daily_watchword": "By his bruises we are healed. Isaiah 53:5", "verses": ["Psalm 35:11–18", "Exodus 18:7–19:9", "Matthew 23:13–22"]}, "2026-03-13": {"prayer": "We try, patient Savior, to do as you ask and require of us. Forgive us when we falter and stray. Please do not take your steadying hand from us, so we may continue to keep trying. Amen.", "doctrinal": "[Peter] cried out, “Lord, save me!” Jesus immediately reached out his hand and caught him, saying to him, “You of little faith, why did you doubt?” Matthew 14:30-31", "daily_watchword": "Our steps are made firm by the LORD when he delights in our way; though we stumble, we shall not fall headlong, for the LORD holds us by the hand. Psalm 37:23-24", "verses": ["Psalm 35:19–28", "Exodus 19:10–20:21", "Matthew 23:23–32"]}, "2026-03-14": {"prayer": "You freed us from oppressive sin ruling us so that we can live fully in you, God. Remind us that we were freed through love so that others may also be freed. Let us rejoice in this grace and mercy and not hoard it for ourselves. In your holy name, we pray. Amen.", "doctrinal": "For you were called to freedom, brothers and sisters, only do not use your freedom as an opportunity for self-indulgence, but through love become enslaved to one another. Galatians 5:13", "daily_watchword": "I am the LORD your God, who brought you out of the land of Egypt, out of the house of slavery. Exodus 20:2", "verses": ["Psalm 36", "Exodus 20:22–21:27", "Matthew 23:33–39"]}, "2026-03-15": {"prayer": "No matter where we go, near or far, you promise to be with us, Lord. You watch over our lives, providing comfort and challenge. Thank you for always being with us and considering us to be valuable. May we always remember your love is never-ending. Amen.", "doctrinal": "Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from your Father. So do not be afraid; you are of more value than many sparrows. Matthew 10:29,31", "daily_watchword": "For God has power to help or to overthrow. 2 Chronicles 25:8", "verses": ["1 Samuel 16:1-13", "Psalm 23", "Ephesians 5:8-14", "John 9:1-41"], "weekly_watchword": "Watchword for the week — Surely goodness and mercy shall follow me all the days of my life, and I shall dwell in the house of the LORD my whole life long. Psalm 23:6", "special_remarks": ["Fourth Sunday in Lent"]}, "2026-03-16": {"prayer": "Lord, may we never stop being curious about your love and goodness, no matter our age. May we never become so rigid in our thinking that you cannot break through with new revelations. Keep us open and malleable to your guidance and words. Amen.", "doctrinal": "How from childhood you have known sacred writings that are able to instruct you for salvation through faith in Christ Jesus. 2 Timothy 3:15", "daily_watchword": "O God, from my youth you have taught me, and I still proclaim your wondrous deeds. Psalm 71:17", "verses": ["Psalm 37:1–6", "Exodus 21:28–22:24", "Matthew 24:1–25"]}, "2026-03-17": {"prayer": "We rely on you, delivering Father, to protect, correct, and guide all of creation with justice and righteousness. May we remember how blessed we are to be counted among your beloveds who call you Abba! In that, we rejoice! Amen.", "doctrinal": "After Jesus had spoken these words, he looked up to heaven and said, “Father, glorify your son so that the son may glorify you, since you have given him authority over all people, to give eternal life to all whom you have given him.” John 17:1,2", "daily_watchword": "See now that I, even I, am he; there is no god besides me. I kill, and I make alive; I wound, and I heal; and no one can deliver from my hand. Deuteronomy 32:39", "verses": ["Psalm 37:7–15", "Exodus 22:25–23:26", "Matthew 24:26–35"]}, "2026-03-18": {"prayer": "Your promises, loving God, are never-ending. You give us strength, wisdom, and courage. You are as compassionate as a loving parent when we fail. You are above all, gracious and merciful as we seek to do your will. Thank you. Amen.", "doctrinal": "Very truly, I tell you, if you ask anything of the Father in my name, he will give it to you. John 16:23", "daily_watchword": "Turn to me and be gracious to me; give your strength to your servant. Psalm 86:16", "verses": ["Psalm 37:16–22", "Exodus 23:27–25:9", "Matthew 24:36–44"]}, "2026-03-19": {"prayer": "God of the beginning and of the end, you hold every part of our lives in your hands. Wherever we are on our walk of life, we dedicate it to your service. We place our trust in you and you alone. Amen.", "doctrinal": "I came that they may have life and have it abundantly. John 10:10", "daily_watchword": "Then I myself will gather the remnant of my flock out of all the lands where I have driven them, and I will bring them back to their fold, and they shall be fruitful and multiply. Jeremiah 23:3", "verses": ["Psalm 37:23–26", "Exodus 25:10–40", "Matthew 24:45–51"]}, "2026-03-20": {"prayer": "Even in our weakness, omniscient God, you see us as your wonderfully created people. We give thanks that you can take our flawed and sinful lives and turn them towards you. What did we do to deserve this love, O God? We give you thanks. Amen.", "doctrinal": "Wretched person that I am! Who will rescue me from this body of death? Thanks be to God through Jesus Christ our Lord! Romans 7:24-25", "daily_watchword": "Consider my affliction and my trouble, and forgive all my sins. Psalm 25:18", "verses": ["Psalm 37:27–33", "Exodus 26", "Matthew 25:1–13"]}, "2026-03-21": {"prayer": "In Lent, we reflect on your love for us, eternal Caregiver. You have given so much to our lives and continue to provide daily for our existence. Do we recognize this? We pause now and say, “Thank you.” Amen.", "doctrinal": "Thanks be to God for his indescribable gift! 2 Corinthians 9:15", "daily_watchword": "When you have eaten and are satisfied, praise the LORD your God. Deuteronomy 8:10 NIV", "verses": ["Psalm 37:34–40", "Exodus 27:1–28:14", "Matthew 25:14–30"]}, "2026-03-22": {"prayer": "God, may the words that our mouths speak be true. May the thoughts and prayers within our hearts uplift. May any good that we do for neighbors and enemies, near and far, be done expressing your unending love for all. We base our lives on you, our rock and redeemer. Amen.", "doctrinal": "You know that no lie comes from the truth. 1 John 2:21", "daily_watchword": "You shall not bear false witness against your neighbor. Exodus 20:16", "verses": ["Ezekiel 37:1-14", "Psalm 130", "Romans 8:6-11", "John 11:1-45"], "weekly_watchword": "Watchword for the week — I wait for the LORD, my soul waits, and in his word I hope. Psalm 130:5", "special_remarks": ["Fifth Sunday in Lent"]}, "2026-03-23": {"prayer": "The comfort we feel, Lord God, knowing that you and our loving Savior are one is inexpressible! We realize there are mysteries in this world we will never fully comprehend. Let us reside peacefully together knowing your great love for us instead of being divided, debating this great mystery. Amen.", "doctrinal": "Jesus said, “The Father and I are one.” John 10:30", "daily_watchword": "I, I am the LORD, and besides me there is no savior. Isaiah 43:11", "verses": ["Psalm 38:1–8", "Exodus 28:15–43", "Matthew 25:31–46"]}, "2026-03-24": {"prayer": "If even your son, Jesus Christ, asked for assistance and for difficulties to pass him by, Lord, why do we feel we can handle life on our own? Your angels attended your son, and they lead and guide us as well. Remind us that asking for help is not weakness. In your holy name, we pray. Amen.", "doctrinal": "Jesus said, “Father, if you are willing, remove this cup from me, yet not my will but yours be done.” Then an angel from heaven appeared to him and gave him strength. Luke 22:42-43", "daily_watchword": "He will send his angel before you. Genesis 24:7", "verses": ["Psalm 38:9–16", "Exodus 29:1–30", "Matthew 26:1–13"]}, "2026-03-25": {"prayer": "Death and sin did not contain you, miraculous Savior, and neither will they contain us. We thank you for your sacrifice and ask that you teach us to respond to this gift in faith, love, and hope. Amen.", "doctrinal": "For he was teaching his disciples, saying to them, “The Son of Man is to be betrayed into human hands, and they will kill him, and three days after being killed, he will rise again.” Mark 9:31", "daily_watchword": "Rise up, O LORD! Do not let mortals prevail. Psalm 9:19", "verses": ["Psalm 38:17–22", "Exodus 29:31–30:16", "Matthew 26:14–30"]}, "2026-03-26": {"prayer": "You made everything, creating God, and thought enough of humankind to call us very good. We praise you that we are good in your sight. May we continually live into our goodness and treat those around us as your beloved. Amen.", "doctrinal": "He destined us for adoption as his children through Jesus Christ, according to the good pleasure of his will, to the praise of his glorious grace. Ephesians 1:5-6", "daily_watchword": "I will bless the LORD at all times; his praise shall continually be in my mouth. Psalm 34:1", "verses": ["Psalm 39:1–6", "Exodus 30:17–31:11", "Matthew 26:31–35"]}, "2026-03-27": {"prayer": "Make us, O God, a people who live into the promises you fulfill—the promises of your love and abundant life. This has already been established in your heavenly kingdom. Help us to grow that same peace and love on earth. Amen.", "doctrinal": "If you sow to your own flesh, you will reap corruption from the flesh, but if you sow to the Spirit, you will reap eternal life from the Spirit. Galatians 6:8", "daily_watchword": "Truly the righteous attain life, but whoever pursues evil finds death. Proverbs 11:19 NIV", "verses": ["Psalm 39:7–13", "Exodus 31:12–32:29", "Matthew 26:36–46"]}, "2026-03-28": {"prayer": "Rejoice, church! For our God loves us! Rejoice creation! For our God redeems us! Rejoice beloveds! For our God blesses us! Rejoice all that surrounds us, and let our praises extend throughout all the world! Amen!", "doctrinal": "Then one of them, when he saw that he was healed, turned back, praising God with a loud voice. Luke 17:15", "daily_watchword": "Give us life, and we will call on your name. Psalm 80:18", "verses": ["Psalm 40:1–8", "Exodus 32:30–33:23", "Matthew 26:47–58"]}, "2026-03-29": {"prayer": "Blessed are you, Jesus Christ! We cry to you to save us, deliver us, and be with us. Bless us with your presence and help us to see clearly the road we walk with you. Hosanna in the highest heaven! Amen.", "doctrinal": "So they took branches of palm trees and went out to meet him, shouting, “Hosanna! Blessed is the one who comes in the name of the Lord—the King of Israel!” John 12:13", "daily_watchword": "And he said to him, “If your presence will not go, do not bring us up from here.” Exodus 33:15", "verses": ["Isaiah 50:4-9a", "Psalm 31:9-16", "Philippians 2:5-11", "Matthew 21:1-11"], "weekly_watchword": "Watchword for the week — And being found in human form, Jesus humbled himself and became obedient to the point of death—even death on a cross. Philippians 2:7,8", "special_remarks": ["Palm Sunday"]}, "2026-03-30": {"prayer": "Christ simplified the laws for us: love God, love our neighbor, love ourselves. It shouldn’t be hard; let us not make it more difficult to show people your everlasting, unconditional love. Gracious Lord, let your words guide our actions. Amen.", "doctrinal": "For I will not be so bold as to speak of anything except what Christ has accomplished through me to win obedience from the gentiles, by word and deed. Romans 15:18", "daily_watchword": "You must neither add anything to what I command you nor take away anything from it, but keep the commandments of the LORD your God with which I am charging you. Deuteronomy 4:2", "verses": ["Psalm 40:9–17", "Exodus 34", "Matthew 26:59–75"]}, "2026-03-31": {"prayer": "You suffered for us on the cross, loving Christ. Your love for us is incomprehensible. How do we say thank you for this? We live a life worthy of being called children and heirs of God. We live a life of love. We offer our heart-felt thanks. Amen.", "doctrinal": "Was it not necessary that the Messiah should suffer these things and then enter into his glory? Luke 24:26", "daily_watchword": "Indeed, the LORD our God is right in all that he has done. Daniel 9:14", "verses": ["Psalm 41", "Exodus 35", "Matthew 27:1–10"]}, "2026-04-01": {"prayer": "We praise you, dear Savior, for all that you do and all that you are. Thank you for blessing us. May our appreciation never stop pouring from our hearts and our voices. Amen.", "doctrinal": "Every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Philippians 2:11", "daily_watchword": "Then I will thank you in the great congregation; in the mighty throng I will praise you. Psalm 35:18", "verses": ["Psalm 42", "Exodus 36", "Matthew 27:11–31"]}, "2026-04-02": {"prayer": "Source of life, today especially, we remember you. We remember you as you sat with your disciples one final time. We remember you as you sit with us today. Give unto us your peace. Amen.", "doctrinal": "Then he took a cup, and after giving thanks he gave it to them, saying, “Drink from it, all of you, for this is my blood of the covenant, which is poured out for many for the forgiveness of sins.” Matthew 26:27-28", "daily_watchword": "Happy are those whose help is the God of Jacob, whose hope is in the LORD their God. Psalm 146:5", "verses": ["Psalm 43", "Exodus 37", "Matthew 27:32–44"], "special_remarks": ["Maundy Thursday", "Watchword for Maundy Thursday — He has gained renown by his wonderful deeds; the LORD is gracious and merciful. Psalm 111:4"]}, "2026-04-03": {"prayer": "Suffering Savior, the words…the words simply won’t come to express our wonder at the depth of your love that we recall today. Yet you call us to embody this same love, though we can scarcely grasp it. Thousand, thousand thanks to thee, dearest Lord, forever be. Amen.", "doctrinal": "In a loud voice they were saying: “Worthy is the Lamb, who was slain, to receive power and wealth and wisdom and strength and honor and glory and praise!” Revelation 5:12 NIV", "daily_watchword": "Praise the LORD, all you nations! Extol him, all you peoples! Psalm 117:1", "verses": ["Psalm 44:1–8", "Exodus 38", "Matthew 27:45–56"], "special_remarks": ["Good Friday", "Watchword for Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"]}, "2026-04-04": {"prayer": "Resting Savior, we mourn your death. In spirit— we visit your resting place and remember your suffering. We thank you that our grief is not like the disciples’ grief, for we know what comes tomorrow. Amen.", "doctrinal": "In my Father’s house there are many dwelling places. If it were not so, would I have told you that I go to prepare a place for you? John 14:2", "daily_watchword": "How lovely is your dwelling place, O LORD of hosts! Psalm 84:1", "verses": ["Psalm 44:9–16", "Exodus 39:1–31", "Matthew 27:57–66"], "special_remarks": ["Great Sabbath"]}, "2026-04-05": {"prayer": "Finally, God of life, after long, dark days, you make the sun rise once more, for the son has risen. Our lives are changed. Our hope is reborn. Now thank we all our God! Amen.", "doctrinal": "The last enemy to be destroyed is death. 1 Corinthians 15:26", "daily_watchword": "You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup overflows. Psalm 23:5", "verses": ["Acts 10:34-43", "Psalm 118:1-2,14-24", "Colossians 3:1-4", "John 20:1-18"], "weekly_watchword": "Watchword for the week — So if you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Colossians 3:1", "special_remarks": ["Easter Sunday"]}, "2026-04-06": {"prayer": "O caring Savior, we are in awe of your word that is shared with us today. How can we grasp such love or fathom such caring? May we simply trust your hands as you hold us. Amen.", "doctrinal": "For I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38-39", "daily_watchword": "He guarded him as the apple of his eye. Deuteronomy 32:10", "verses": ["Psalm 44:17–26", "Exodus 39:32–40:23", "Matthew 28"]}, "2026-04-07": {"prayer": "God of liberty and compassion, forgive us when we hoard the comforts of liberty and justice. Deliver us from such temptations. We often close our eyes in indifference to the anguish of others, which is plainly visible if only we would look. Forgive us, O Lord. Amen.", "doctrinal": "Jesus said, “Then the king will say to those at his right hand, ‘Come, you who are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world, I was naked and you gave me clothing.’” Matthew 25:34,36", "daily_watchword": "The LORD executes justice for the orphan and the widow, and loves the strangers, providing them food and clothing. You shall also love the stranger. Deuteronomy 10:18-19", "verses": ["Psalm 45:1–9", "Exodus 40:24–Leviticus 1:17", "Mark 1:1–8"]}, "2026-04-08": {"prayer": "God of the vulnerable, we praise you, for you give special attention to those most at risk of faltering in life. We hear your call to give the same attention to those most in need of support and care. Give us strength to serve others in your name. Amen.", "doctrinal": "Jesus said, “Then the king will say to those at his right hand, ‘Come, you who are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world, I was a stranger and you welcomed me.’” Matthew 25:34,35", "daily_watchword": "Do not oppress the widow or the fatherless, the foreigner or the poor. Zechariah 7:10 NIV", "verses": ["Psalm 45:10–17", "Leviticus 2,3", "Mark 1:9–20"]}, "2026-04-09": {"prayer": "God of quiet times, we learn the value of stillness and listening from you and those who lead us. But it’s hard to be quiet when our lives are filled with noise. Draw us to the quiet place where you are. Amen.", "doctrinal": "Jesus said, “Your Father knows what you need before you ask him.” Matthew 6:8", "daily_watchword": "Never be rash with your mouth nor let your heart be quick to utter a word before God, for God is in heaven and you upon earth; therefore let your words be few. Ecclesiastes 5:2", "verses": ["Psalm 46", "Leviticus 4", "Mark 1:21–34"]}, "2026-04-10": {"prayer": "God, you love us all the time: when we are traveling and when we are home. The trials of the road tend to sweep from our minds your gift of peace. Forgive our forgetfulness. Restore your joy to us. Amen.", "doctrinal": "He said to them, “When I sent you out without a purse, bag, or sandals, did you lack anything?” They said, “No, not a thing.” Luke 22:35", "daily_watchword": "And the LORD stood beside Jacob and said, “Know that I am with you and will keep you wherever you go and will bring you back to this land.” Genesis 28:13,15", "verses": ["Psalm 47", "Leviticus 5:1–6:13", "Mark 1:35–45"]}, "2026-04-11": {"prayer": "God, we cry out to you; we tremble because of the threats in this world. How can we know peace and security when there are so many dangers? “Hold us!” we implore you; lift us out of our darkness. Amen.", "doctrinal": "Then he said, “Jesus, remember me when you come in your kingdom.” He replied, “Truly I tell you, today you will be with me in paradise.” Luke 23:42-43", "daily_watchword": "For my iniquities have gone over my head; they weigh like a burden too heavy for me. Psalm 38:4", "verses": ["Psalm 48", "Leviticus 6:14–7:21", "Mark 2:1–12"]}, "2026-04-12": {"prayer": "Risen Christ, at times we feel like Thomas—wrong place at the wrong time. We miss your blessings, as he did for a while, and our doubts drown out our belief. Reach out your nail-scarred hands to us, we pray. Help us to claim your sacrificial love as real. Amen.", "doctrinal": "Although the doors were shut, Jesus came and stood among them and said, “Peace be with you.” John 20:26", "daily_watchword": "Return to your rest, my soul, for the LORD has been good to you. Psalm 116:7 NIV", "verses": ["Acts 2:14a,22-32", "Psalm 16", "1 Peter 1:3-9", "John 20:19-31"], "weekly_watchword": "Watchword for the week — Blessed be the God and Father of our Lord Jesus Christ! By his great mercy he has given us a new birth into a living hope through the resurrection of Jesus Christ from the dead. 1 Peter 1:3", "special_remarks": ["Second Sunday of Easter"]}, "2026-04-13": {"prayer": "Good Shepherd, you have called us to follow you, and that is our desire. Send your guiding spirit to keep us on the path where you lead. Speak to us when we stray. Strengthen us for the uphill climbs. Thank you for all your blessings. Amen.", "doctrinal": "Be careful, then, how you live, not as unwise people but as wise. Ephesians 5:15", "daily_watchword": "My times are in your hand. Psalm 31:15", "verses": ["Psalm 49:1–12", "Leviticus 7:22–8:17", "Mark 2:13–28"]}, "2026-04-14": {"prayer": "Merciful Savior, sometimes we see nothing but spiritual failure when we look in a mirror, while you see in us a humble, open heart. At other times, we see righteousness in our souls while you find nothing but self-delusion. Patiently guide us into humble repentance. Amen.", "doctrinal": "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9", "daily_watchword": "David said to the Lord, “I have sinned greatly in what I have done. But now, O Lord, I pray you, take away the guilt of your servant.” 2 Samuel 24:10", "verses": ["Psalm 49:13–20", "Leviticus 8:18–9:11", "Mark 3:1–12"]}, "2026-04-15": {"prayer": "Your Majesty, how vast it is, and how immense the glory, which you, O Jesus, do possess; the heavens proclaim your story, the legions of angels exalt your great name, your glory and might are transcendent; and thousands of thousands your praises proclaim, upon you gladly dependent*. In your name, we pray. Amen.", "doctrinal": "No one has ever seen God. It is the only Son, himself God, who is close to the Father’s heart, who has made him known. John 1:18", "daily_watchword": "Now there was a great wind, so strong that it was splitting mountains and breaking rocks in pieces before the LORD, but the LORD was not in the wind, and after the wind an earthquake, but the LORD was not in the earthquake, and after the earthquake a fire, but the LORD was not in the fire, and after the fire a sound of sheer silence. 1 Kings 19:11-12", "verses": ["Psalm 50:1–6", "Leviticus 9:12–10:20", "Mark 3:13–19"]}, "2026-04-16": {"prayer": "Lord, we confess that we often believe we are right and others are wrong. Have mercy on us as you do our foes, for we often need it more than they. We pray this in the name of our forgiver. Amen.", "doctrinal": "Be merciful, just as your Father is merciful. Luke 6:36", "daily_watchword": "And the LORD said, “Is it right for you to be angry?” Jonah 4:4", "verses": ["Psalm 50:7–15", "Leviticus 11:1–28", "Mark 3:20–35"]}, "2026-04-17": {"prayer": "Risen Savior, we tremble when we ponder life’s end. Did you tremble in Gethsemane? Did you feel turmoil when you dreaded the cross? Enable us to grasp the promise of life everlasting when we feel the nearness of death. In Jesus’ name, we pray. Amen.", "doctrinal": "And [Jesus] said, “Young man, I say to you, rise!” The dead man sat up and began to speak, and Jesus gave him to his mother. Luke 7:14-15", "daily_watchword": "God, from the depths of the earth you will bring me up again. You will increase my honor and comfort me once again. Psalm 71:20-21", "verses": ["Psalm 50:16–23", "Leviticus 11:29–13:8", "Mark 4:1–20"]}, "2026-04-18": {"prayer": "Holy God, we do not fear the heat of your fire, for it is the source of your life in us. It is the power that makes us holy. Instead of fearing you, we thank you for your purifying presence. Abide with us always. Amen.", "doctrinal": "Therefore, since we are receiving a kingdom that cannot be shaken, let us show gratitude, by which we may offer to God an acceptable worship with reverence and awe. Hebrews 12:28", "daily_watchword": "For the LORD your God is a devouring fire, a jealous God. Deuteronomy 4:24", "verses": ["Psalm 51:1–6", "Leviticus 13:9–46", "Mark 4:21–29"]}, "2026-04-19": {"prayer": "O caring Shepherd, you swing wide the gates of your pasture and welcome us into your fold. Your desire for us—each of us—never grows stale. We are amazed that you delight in us so much. May we always be thankful for your gracious love. Amen.", "doctrinal": "For you were going astray like sheep, but now you have returned to the shepherd and guardian of your souls. 1 Peter 2:25", "daily_watchword": "I will seek the lost, and I will bring back the strays, and I will bind up the injured, and I will strengthen the weak. Ezekiel 34:16", "verses": ["Acts 2:14a,36-41", "Psalm 116:1-4,12-19", "1 Peter 1:17-23", "Luke 24:13-35"], "weekly_watchword": "Watchword for the week — You have been born anew, not of perishable but of imperishable seed, through the living and enduring word of God. 1 Peter 1:23", "special_remarks": ["Third Sunday of Easter"]}, "2026-04-20": {"prayer": "Holy Spirit, we barely understand your presence in our lives; so much about you is a mystery. But Jesus promised that your presence would be even better than his own. We open our hearts to you, with thanksgiving. Amen.", "doctrinal": "Jesus said, “Nevertheless, I tell you the truth: it is to your advantage that I go away, for if I do not go away, the Advocate will not come to you, but if I go, I will send him to you.” John 16:7", "daily_watchword": "Do not delay me, since the Lord has made my journey successful. Genesis 24:56", "verses": ["Psalm 51:7–12", "Leviticus 13:47–14:18", "Mark 4:30–41"]}, "2026-04-21": {"prayer": "Eternal God, sometimes the scriptures become our prayers. “You are the same, and your years have no end.” The same is true of your love, your promises, and your presence. When life’s uncertainties frighten us, we are thankful that you are our unmoving foundation. Amen.", "doctrinal": "To the only God our Savior, through Jesus Christ our Lord, be glory, majesty, power, and authority, before all time and now and forever. Amen. Jude 25", "daily_watchword": "But you are the same, and your years have no end. Psalm 102:27", "verses": ["Psalm 51:13–19", "Leviticus 14:19–57", "Mark 5:1–20"]}, "2026-04-22": {"prayer": "Jesus, we believe that you are the way, the truth, and the life. We are determined to walk in your way and hold to your truth. How else can we have your life within us? Draw us close to you. Amen.", "doctrinal": "All scripture is inspired by God and is useful for teaching, for reproof, for correction, and for training in righteousness. 2 Timothy 3:16", "daily_watchword": "Know, then, in your heart that, as a parent disciplines a child, so the LORD your God disciplines you. Deuteronomy 8:5", "verses": ["Psalm 52", "Leviticus 15:1–24", "Mark 5:21–43"]}, "2026-04-23": {"prayer": "Creating God, thank you for opening our eyes to the wonders of all that you have made. Teach us how to live in our world in a way that preserves and sustains what you have entrusted to us. Amen.", "doctrinal": "For this reason I bow my knees before the Father, from whom every family in heaven and on earth takes its name. Ephesians 3:14-15", "daily_watchword": "The heavens are the LORD’s heavens, but the earth he has given to human beings. Psalm 115:16", "verses": ["Psalm 53", "Leviticus 15:25–16:25", "Mark 6:1–6"]}, "2026-04-24": {"prayer": "You are the God who calls us to witness. Lord, thank you for those you have called to lead our churches’ ministries. Thank you that you have given all of us gifts of witness. May our response to your call be a fervent ‘Yes.’ Amen.", "doctrinal": "And Jesus said to him, “No one who puts a hand to the plow and looks back is fit for the kingdom of God.” Luke 9:62", "daily_watchword": "Break up your fallow ground, and do not sow among thorns. Jeremiah 4:3", "verses": ["Psalm 54", "Leviticus 16:26–18:5", "Mark 6:7–13"]}, "2026-04-25": {"prayer": "God of compassion, you love the oppressed of the world, who cry out for justice. How do we work to make your compassion for the downtrodden a reality in our world? Teach us to do your will on earth, as it is in heaven. Amen.", "doctrinal": "And the good news must first be proclaimed to all nations. Mark 13:10", "daily_watchword": "The earth feared and was still when God rose up to establish judgment, to save all the oppressed of the earth. Psalm 76:8-9", "verses": ["Psalm 55:1–8", "Leviticus 18:6–19:11", "Mark 6:14–29"]}, "2026-04-26": {"prayer": "Holy God, you teach us the blessings of a pure heart that shun deception, but temptations to distort the truth are strong. Make us pure in heart, no matter what we must endure. We desire hearts where you can dwell. Amen.", "doctrinal": "For the grace of God has appeared, bringing salvation to all, training us to renounce impiety and worldly passions and in the present age to live lives that are self-controlled, upright, and godly. Titus 2:11-12", "daily_watchword": "God made human beings straightforward, but they have devised many schemes. Ecclesiastes 7:29", "verses": ["Acts 2:42-47", "Psalm 23", "1 Peter 2:19-25", "John 10:1-10"], "weekly_watchword": "Watchword for the week — Jesus said, “I am the gate. Whoever enters by me will be saved, and will come in and go out and find pasture.” John 10:9", "special_remarks": ["Fourth Sunday of Easter"]}, "2026-04-27": {"prayer": "We praise you, God of creation. Wrap yourself in the worship of all you have made. Amplify the bird’s song and the waterfall’s roar as they declare your power. Give us words of praise to tell of your work in our lives. Amen.", "doctrinal": "Consider the lilies, how they grow: they neither toil nor spin, yet I tell you, even Solomon in all his glory was not clothed like one of these. Luke 12:27", "daily_watchword": "Let your work be manifest to your servants and your glorious power to their children. Psalm 90:16", "verses": ["Psalm 55:9–15", "Leviticus 19:12–20:8", "Mark 6:30–44"]}, "2026-04-28": {"prayer": "Merciful God, sometimes it seems that we can never stop sinning. But we hear the joyful news that you never stop forgiving—and healing. We are a gathering of redeemed sinners. May we always remember to sing songs of thanksgiving for your mercy. Amen.", "doctrinal": "Jesus said, “Anyone who comes to me I will never drive away.” John 6:37", "daily_watchword": "Ah, Lord, great and awesome God, keeping covenant and steadfast love with those who love you and keep your commandments, we have sinned and done wrong. Daniel 9:4-5", "verses": ["Psalm 55:16–19", "Leviticus 20:9–21:12", "Mark 6:45–56"]}, "2026-04-29": {"prayer": "God of miracles, the friends of the paralytic taught us that sometimes we imitate your compassion only through extreme action, and not just by everyday acts of kindness. Guide us through those times when normal methods don’t succeed in effecting your will. Amen.", "doctrinal": "And when they could not bring him to Jesus because of the crowd, they removed the roof above him, and after having dug through it, they let down the mat on which the paralytic lay. Mark 2:4", "daily_watchword": "Speak out for those who cannot speak, for the rights of all the destitute. Proverbs 31:8", "verses": ["Psalm 55:20–23", "Leviticus 21:13–22:16", "Mark 7:1–8"]}, "2026-04-30": {"prayer": "When our heads rise from our pillows in the morning, and when we lay them down at night, dawn to dusk, you are there, God. You are watching with care; never resting, always blessing. Thank you for your blessing of peace. Amen.", "doctrinal": "The Lord is not slow about his promise, as some think of slowness, but is patient with you, not wanting any to perish but all to come to repentance. 2 Peter 3:9", "daily_watchword": "For a thousand years in your sight are like yesterday when it is past or like a watch in the night. Psalm 90:4", "verses": ["Psalm 56:1–8", "Leviticus 22:17–23:22", "Mark 7:9–23"]}, "2026-05-01": {"prayer": "Loving God, you are always with us, showing us the way with kindness and grace. Help us follow you, not because we are afraid, but because we love you. Let our lives shine with your goodness; fill us with the peace of knowing we belong to you. Amen.", "doctrinal": "Lord, who will not fear and glorify your name? For you alone are holy. Revelation 15:4", "daily_watchword": "Surely the city will fear me; it will accept correction. Zephaniah 3:7", "verses": ["Psalm 56:9–13", "Leviticus 23:23–24:9", "Mark 7:24–37"]}, "2026-05-02": {"prayer": "Gracious God, steady our steps as we seek to follow Jesus. Fill our hearts with your love, that we may walk in kindness, offer compassion, and shine with your light. May we trust in your promises and find peace in your abiding care. Amen.", "doctrinal": "Whoever claims to live in him must live as Jesus did. 1 John 2:6 NIV", "daily_watchword": "Keep my steps steady according to your promise, and never let iniquity have dominion over me. Psalm 119:133", "verses": ["Psalm 57:1–6", "Leviticus 24:10–25:17", "Mark 8:1–13"]}, "2026-05-03": {"prayer": "Loving Guide, you walk with us in our questions and seeking. Open our eyes to your presence and our hearts to trust your way. May we walk in faith, love, and hope, knowing you are always nearby. In Jesus’ name, we pray. Amen.", "doctrinal": "Nikodemus came to Jesus by night and said to him, “Rabbi, we know that you are a teacher who has come from God, for no one can do these signs that you do unless God is with that person.” John 3:2", "daily_watchword": "Then Gideon said to him, “If now I have found favor with you, then show me a sign that it is you who speak with me.” Judges 6:17", "verses": ["Acts 7:55-60", "Psalm 31:1-5,15-16", "1 Peter 2:2-10", "John 14:1-14"], "weekly_watchword": "Watchword for the week — Jesus said, “I am the way, and the truth, and the life. No one comes to the Father except through me.” John 14:6", "special_remarks": ["Fifth Sunday of Easter"]}, "2026-05-04": {"prayer": "Faithful One, you carry us when we are weary and lighten our burdens with your love. Help us trust in your care and rest in your grace. May we walk in hope, knowing you bear us up each day. Amen.", "doctrinal": "Jesus said, “Come to me, all you who are weary and are carrying heavy burdens, and I will give you rest.” Matthew 11:28", "daily_watchword": "Blessed be the Lord, who daily bears us up; God is our salvation. Psalm 68:19", "verses": ["Psalm 57:7–11", "Leviticus 25:18–55", "Mark 8:14–21"]}, "2026-05-05": {"prayer": "God of light and peace, shine in our hearts and guide our steps. Fill us with your presence, that we may reflect your love and walk in your blessing. May your peace rest upon us and your light lead us forward in faith. Amen.", "doctrinal": "For it is the God who said, “Light will shine out of darkness,” who has shone in our hearts to give the light of the knowledge of the glory of God in the face of Christ. 2 Corinthians 4:6", "daily_watchword": "The LORD lift up his countenance upon you and give you peace. Numbers 6:26", "verses": ["Psalm 58", "Leviticus 26:1–35", "Mark 8:22–38"]}, "2026-05-06": {"prayer": "Loving Shepherd, you lead us with mercy and hear our cries. Even in our sorrow, you guide us beside still waters; in our struggles, you walk beside us. Help us trust your presence and rest in your care, now and always. Amen.", "doctrinal": "In the days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to the one who was able to save him from death, and he was heard because of his reverent submission. Hebrews 5:7", "daily_watchword": "With weeping they shall come, and with consolations I will lead them back; I will let them walk by brooks of water, in a straight path where they shall not stumble, for I have become a father to Israel. Jeremiah 31:9", "verses": ["Psalm 59:1–9", "Leviticus 26:36–27:15", "Mark 9:1–10"]}, "2026-05-07": {"prayer": "Ever-present God, you hear us when we call. Like Jesus, help us seek you in quiet moments and trust in your presence. May our hearts be open in prayer, knowing you are near, guiding us in love. Amen.", "doctrinal": "In the morning, while it was still very dark, he got up and went out to a deserted place, and there he prayed. Mark 1:35", "daily_watchword": "O LORD, in the morning you hear my voice; in the morning I plead my case to you and watch. Psalm 5:3", "verses": ["Psalm 59:10–17", "Leviticus 27:16–Numbers 1:16", "Mark 9:11–29"]}, "2026-05-08": {"prayer": "Faithful God, you never leave us. In moments of doubt, remind us of your presence. May we trust in your authority, knowing we are held in your love and strength. Guide us to walk boldly in your truth each day. Amen.", "doctrinal": "And Jesus came and said to them, “All authority in heaven and on earth has been given to me.” Matthew 28:18", "daily_watchword": "The LORD our God be with us, may he not leave us or abandon us. 1 Kings 8:57", "verses": ["Psalm 60", "Numbers 1:17–54", "Mark 9:30–37"]}, "2026-05-09": {"prayer": "God of comfort, you surround us with love in every trial. As you console us, help us share that same kindness with others. May we be a blessing, bringing hope and peace to those in need. Amen.", "doctrinal": "God, who consoles us in all our affliction, so that we may be able to console those who are in any affliction with the consolation with which we ourselves are consoled by God. 2 Corinthians 1:4", "daily_watchword": "I will save you, and you shall be a blessing. Zechariah 8:13", "verses": ["Psalm 61", "Numbers 2", "Mark 9:38–50"]}, "2026-05-10": {"prayer": "Mighty God, you are our refuge in trials and our strength in uncertainty. Even when the way is hard, we trust in your power to save. Open the doors you have set before us, and help us walk forward in faith and courage. Amen.", "doctrinal": "These are the words of the Holy One, the True One, “I know your works. Look, I have set before you an open door that no one is able to shut. I know that you have but little power, yet you have kept my word and have not denied my name.” Revelation 3:7,8", "daily_watchword": "If our God whom we serve is able to deliver us from the furnace of blazing fire and out of your hand, O king, let him deliver us. But if not, be it known to you, O king, that we will not serve your gods and we will not worship the golden statue that you have set up. Daniel 3:17-18", "verses": ["Acts 17:22-31", "Psalm 66:8-20", "1 Peter 3:13-22", "John 14:15-21"], "weekly_watchword": "Watchword for the week — Make a joyful noise to God, all the earth; sing the glory of his name; give to him glorious praise. Psalm 66:1,2", "special_remarks": ["Sixth Sunday of Easter"]}, "2026-05-11": {"prayer": "Holy Teacher, there is none like you. You are holy, everlasting, and full of glory. You reign forever, and all creation sings your praise. Help us to trust in your power and stand firm in awe of your greatness. In Jesus’ name, we pray. Amen.", "doctrinal": "Holy, holy, holy, the Lord God the Almighty, who was and is and is to come. Revelation 4:8", "daily_watchword": "There is no Holy One like the LORD, no one besides you. 1 Samuel 2:2", "verses": ["Psalm 62", "Numbers 3:1–32", "Mark 10:1–12"]}, "2026-05-12": {"prayer": "Comforter, you hear every prayer: from the smallest whisper to the loudest cry. Remind us that prayer is powerful and brings us closer to you. Help us trust in your presence and find strength in lifting our hearts to you. Amen.", "doctrinal": "The prayer of the righteous is powerful and effective. James 5:16", "daily_watchword": "He will regard the prayer of the destitute and will not despise their prayer. Psalm 102:17", "verses": ["Psalm 63", "Numbers 3:33–4:14", "Mark 10:13–31"]}, "2026-05-13": {"prayer": "God of all life, you hold every moment in your hands. In times of joy and sorrow, help us trust in your care. May we follow Jesus’ example: surrendering our hearts to you with faith and hope. Amen.", "doctrinal": "Then Jesus, crying out with a loud voice, said, “Father, into your hands I commend my spirit.” Having said this, he breathed his last. Luke 23:46", "daily_watchword": "In his hand is the life of every living thing. Job 12:10", "verses": ["Psalm 64", "Numbers 4:15–49", "Mark 10:32–45"]}, "2026-05-14": {"prayer": "Eternal God, keep our hearts focused on you, not on the world. As we trust in your wisdom, help us to be faithful witnesses, sharing the good news of your love and forgiveness. Strengthen us to walk in your ways each day. Amen.", "doctrinal": "And Jesus said to them, “Thus it is written, that the Messiah is to suffer and to rise from the dead on the third day and that repentance and forgiveness of sins is to be proclaimed in his name to all nations, beginning from Jerusalem. You are witnesses of these things.” Luke 24:46-48", "daily_watchword": "Do not let your heart envy sinners, but always continue in the fear of the Lord. Proverbs 23:17", "verses": ["Psalm 65:1–8", "Numbers 5", "Mark 10:46–52"], "special_remarks": ["Ascension Day", "Watchword for Ascension Day — Jesus said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32", "Ascension of the Lord — Acts 1:1-11; Psalm 47", "Ephesians 1:15-23; Luke 24:44-53"]}, "2026-05-15": {"prayer": "Faithful Creator, draw us closer to you each day. Guide our hearts to seek you and commit to your ways. Help us grow in faith, wisdom, and love, so our lives may reflect your goodness and grace. Amen.", "doctrinal": "For this very reason, you must make every effort to support your faith with excellence, and excellence with knowledge, and knowledge with self-control, and self-control with endurance, and endurance with godliness, and godliness with mutual affection, and mutual affection with love. 2 Peter 1:5-7", "daily_watchword": "They shall ask the way to Zion, with faces turned toward it, and they shall come and join themselves to the LORD by an everlasting covenant that will never be forgotten. Jeremiah 50:5", "verses": ["Psalm 65:9–13", "Numbers 6", "Mark 11:1–11"]}, "2026-05-16": {"prayer": "Wise and mighty God, your strength is unmatched, and your wisdom is beyond measure. Keep us humble, that we may receive your grace. Teach us to trust in your power, not our own, and teach us to walk in kindness and humility. Amen.", "doctrinal": "God opposes the proud but gives grace to the humble. 1 Peter 5:5", "daily_watchword": "He is wise in heart and mighty in strength; who has resisted him and succeeded? Job 9:4", "verses": ["Psalm 66:1–7", "Numbers 7:1–35", "Mark 11:12–26"]}, "2026-05-17": {"prayer": "Creator Lord, you restore and renew us, calling us out of darkness into your light. When fear and worry overwhelm us, help us trust in your care. May we live in hope, knowing your love brings healing and new beginnings. Amen.", "doctrinal": "When he had said this, he cried with a loud voice, “Lazarus, come out!” The dead man came out, his hands and feet bound with strips of cloth and his face wrapped in a cloth. John 11:43-44", "daily_watchword": "O LORD, you brought up my soul from Sheol, restored me to life from among those gone down to the Pit. Psalm 30:3", "verses": ["Acts 1:6-14", "Psalm 68:1-10,32-35", "1 Peter 4:12-14,5:6-11", "John 17:1-11"], "weekly_watchword": "Watchword for the week — Cast all your anxiety on him, because he cares for you. 1 Peter 5:7", "special_remarks": ["Ascension Sunday Seventh Sunday of Easter"]}, "2026-05-18": {"prayer": "Lord of truth and glory, all honor belongs to you. Keep us humble, that we may seek your ways above our own. May our words and actions reflect your love and faithfulness, always pointing back to you. In your holy name, we pray. Amen.", "doctrinal": "Those who speak on their own seek their own glory, but the one who seeks the glory of him who sent him is true, and there is nothing unjust in him. John 7:18", "daily_watchword": "Not to us, O LORD, not to us, but to your name give glory, for the sake of your steadfast love and your faithfulness. Psalm 115:1", "verses": ["Psalm 66:8–15", "Numbers 7:36–71", "Mark 11:27–12:12"]}, "2026-05-19": {"prayer": "Loving Creator, you shape our lives with wisdom and care. Help us trust in your hands, even when we don’t understand your ways. Teach us to surrender, knowing that your purpose for us is good. Mold us to reflect your love. Amen.", "doctrinal": "But who indeed are you, a human, to argue with God? Will what is molded say to the one who molds it, “Why have you made me like this?” Romans 9:20", "daily_watchword": "Yet, O LORD, you are our Father; we are the clay, and you are our potter; we are all the work of your hand. Isaiah 64:8", "verses": ["Psalm 66:16–20", "Numbers 7:72–8:4", "Mark 12:13–17"]}, "2026-05-20": {"prayer": "Faithful One, your love never ends. We rejoice in your goodness and proclaim your faithfulness to all. As you worked through the disciples, work through us to share your good news with the world. Let our lives sing your praise. Amen.", "doctrinal": "And they went out and proclaimed the good news everywhere, while the Lord worked with them and confirmed the message by the signs that accompanied it. Mark 16:20", "daily_watchword": "I will sing of your steadfast love, O LORD, forever; with my mouth I will proclaim your faithfulness to all generations. Psalm 89:1", "verses": ["Psalm 67", "Numbers 8:5–9:14", "Mark 12:18–34"]}, "2026-05-21": {"prayer": "Faithful One, your mighty works fill the earth, and your love fills our hearts. Teach us to worship you with joy, lifting our voices in songs of praise. May our gratitude overflow in music and faithfulness each day. Amen.", "doctrinal": "And with gratitude in your hearts sing psalms, hymns, and spiritual songs to God. Colossians 3:16", "daily_watchword": "Praise him for his mighty deeds; praise him according to his surpassing greatness! Psalm 150:2", "verses": ["Psalm 68:1–6", "Numbers 9:15–10:36", "Mark 12:35–44"]}, "2026-05-22": {"prayer": "Loving Creator, you alone are worthy of our praise. You are our strength, our hope, and our joy. Thank you for loving us so deeply. May our lives reflect your love as we worship you with grateful hearts. Amen.", "doctrinal": "For the Father himself loves you. John 16:27", "daily_watchword": "He is your praise; he is your God. Deuteronomy 10:21", "verses": ["Psalm 68:7–18", "Numbers 11", "Mark 13:1–13"]}, "2026-05-23": {"prayer": "Mighty and merciful Lord, your works are beyond our understanding, and your wisdom stretches farther than we can see. Help us trust in your care, even when we do not comprehend your ways. Shape our hearts to reflect your kindness, so that we, too, may share love without limits. Amen.", "doctrinal": "For he makes his sun rise on the evil and on the good and sends rain on the righteous and on the unrighteous. Matthew 5:45", "daily_watchword": "He does great things that we cannot comprehend. Job 37:5", "verses": ["Psalm 68:19–27", "Numbers 12:1–13:16", "Mark 13:14–27"]}, "2026-05-24": {"prayer": "Holy Spirit, fling wide the doors of our hearts, that your spirit may rush in like a mighty wind. Fill us with your power, renew us with your presence, and send us out to share your love. May we welcome your glory and live by your spirit. Amen.", "doctrinal": "And suddenly from heaven there came a sound like the rush of a violent wind, and it filled the entire house where they were sitting. All of them were filled with the Holy Spirit. Acts 2:2,4", "daily_watchword": "Lift up your heads, O gates! And be lifted up, O ancient doors, that the King of glory may come in! Psalm 24:7", "verses": ["Acts 2:1-21", "Psalm 104:24-34,35b", "1 Corinthians 12:3b-13", "John 20:19-23"], "weekly_watchword": "Watchword for the week — Now there are varieties of gifts, but the same Spirit; and there are varieties of services, but the same Lord. 1 Corinthians 12:4,5", "special_remarks": ["Day of Pentecost"]}, "2026-05-25": {"prayer": "God of all nations, your love never ends, and your faithfulness reaches every corner of the world. Open our hearts to your spirit’s movement, that we may share your goodness with all people. Let our voices join in praising your mighty works. Amen.", "doctrinal": "Now there were devout Jews from every people under heaven living in Jerusalem. Amazed and astonished, they asked, “In our own languages we hear them speaking about God’s deeds of power.” Acts 2:5,7,11", "daily_watchword": "For great is his steadfast love toward us, and the faithfulness of the LORD endures forever. Praise the LORD! Psalm 117:2", "verses": ["Psalm 68:28–35", "Numbers 13:17–33", "Mark 13:28–37"]}, "2026-05-26": {"prayer": "Patient God, help us to walk in your ways, turning from evil and seeking what is good. Give us wisdom to stand up for righteousness, and compassion to care for those in need. Teach us to be patient and kind, lifting up the weary and encouraging the fainthearted. Amen.", "doctrinal": "Admonish the idlers, encourage the fainthearted, help the weak, be patient with all of them. 1 Thessalonians 5:14", "daily_watchword": "You who love the LORD, hate evil. Psalm 97:10", "verses": ["Psalm 69:1–12", "Numbers 14", "Mark 14:1–11"]}, "2026-05-27": {"prayer": "God of wonder, there truly is no one like you. You are strong and kind; the one true source of life. Help us honor you in all we do. Let our words and actions show our trust in you each day. Amen.", "doctrinal": "Indeed, even though there may be so-called gods in heaven or on earth—as in fact there are many gods and many lords—yet for us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:5-6", "daily_watchword": "Who is like you, O LORD, among the gods? Who is like you, majestic in holiness, awesome in splendor, doing wonders? Exodus 15:11", "verses": ["Psalm 69:13–21", "Numbers 15:1–31", "Mark 14:12–31"]}, "2026-05-28": {"prayer": "Living God, you are our redeemer, and in you, we find hope. Just as Christ was raised, we trust in your promise of new life. Strengthen our faith, that we may live with joy, knowing death is not the end. Amen.", "doctrinal": "But in fact Christ has been raised from the dead, the first fruits of those who have died. 1 Corinthians 15:20", "daily_watchword": "I know that my redeemer lives. Job 19:25 NIV", "verses": ["Psalm 69:22–29", "Numbers 15:32–16:27", "Mark 14:32–42"]}, "2026-05-29": {"prayer": "Sovereign God, our lives are in your hands. Teach us to trust in your wisdom rather than our own plans. Keep us from relying on what fades and lead us to seek what is lasting—your love and your truth. Amen.", "doctrinal": "The rich man said, “And I will say to my soul, Soul, you have ample goods laid up for many years; relax, eat, drink, be merry.” But God said to him, “You fool! This very night your life is being demanded of you. And the things you have prepared, whose will they be?” Luke 12:19-20", "daily_watchword": "I know, O LORD, that the way of humans is not in their control. Jeremiah 10:23", "verses": ["Psalm 69:30–36", "Numbers 16:28–17:13", "Mark 14:43–52"]}, "2026-05-30": {"prayer": "Gracious Lord, you welcome all who turn to you with open arms. Forgive us when we stray, and remind us of your mercy. Help us seek you with sincere hearts and reflect your kindness in the world. Amen.", "doctrinal": "Then Jesus said, “So he set off and went to his father. But while he was still far off, his father saw him and was filled with compassion; he ran and put his arms around him and kissed him.” Luke 15:20", "daily_watchword": "May the good LORD pardon all who set their hearts to seek God. 2 Chronicles 30:18-19", "verses": ["Psalm 70", "Numbers 18:1–24", "Mark 14:53–65"]}, "2026-05-31": {"prayer": "Wonderful Creator, your wisdom is greater than we can understand, and your love is all around us. Help us trust you, even when we don’t have all the answers. Let us see the beauty of your world and praise you every day. In Jesus’ name, we pray. Amen.", "doctrinal": "O the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways! Romans 11:33", "daily_watchword": "How weighty to me are your thoughts, O God! How vast is the sum of them! Psalm 139:17", "verses": ["Genesis 1:1-2:4a", "Psalm 8", "2 Corinthians 13:11-13", "Matthew 28:16-20"], "weekly_watchword": "Watchword for the week — O LORD, our Sovereign, how majestic is your name in all the earth! Psalm 8:9", "special_remarks": ["Trinity Sunday"]}, "2026-06-01": {"prayer": "Dear Lord, we ask you to show us your way as we start a new month. Thank you for your son who always knew how to show love and compassion to those around him. May we approach this month to be of good service to those around us. Amen.", "doctrinal": "And the Word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth. John 1:14", "daily_watchword": "In God, whose word I praise, in the LORD, whose word I praise. Psalm 56:10", "verses": ["Psalm 71:1–8", "Numbers 18:25–19:22", "Mark 14:66–72"]}, "2026-06-02": {"prayer": "God, we thank you for being our great protector. We appreciate how you keep us under your wing and love us forever. Help us to be better protectors of the people around us. Amen.", "doctrinal": "For whoever would approach God must believe that he exists and that he rewards those who seek him. Hebrews 11:6", "daily_watchword": "Boaz said to Ruth: “May you have a full reward from the LORD, the God of Israel, under whose wings you have come for refuge!” Ruth 2:12", "verses": ["Psalm 71:9–18a", "Numbers 20:1–21:9", "Mark 15:1–20"]}, "2026-06-03": {"prayer": "Dear Lord, please lay your hands on us and help us to be agents of healing for the suffering around us. We look to you for comfort and guidance for our lives, and for the people we love. We thank you for sending your son to show us the way. Amen.", "doctrinal": "And he answered them, “Go and tell John what you have seen and heard: the blind receive their sight; the lame walk; those with a skin disease are cleansed; the deaf hear; the dead are raised; the poor have good news brought to them.” Luke 7:22", "daily_watchword": "The LORD opens the eyes of the blind. Psalm 146:8", "verses": ["Psalm 71:18b–24", "Numbers 21:10–22:6", "Mark 15:21–32"]}, "2026-06-04": {"prayer": "We ask, Lord, that you help us live in Christian love. We pray for all people to see each other as children of God. We want our lives to follow the example of your son, Jesus. Amen.", "doctrinal": "That no one wrong or exploit a brother or sister in this matter, because the Lord is an avenger in all these things. 1 Thessalonians 4:6", "daily_watchword": "Then the LORD your God will make you most prosperous in all the work of your hands. Deuteronomy 30:9 NIV", "verses": ["Psalm 72:1–11", "Numbers 22:7–41", "Mark 15:33–47"]}, "2026-06-05": {"prayer": "Lord, thank you for sending us your son. Jesus is always here to hear our prayers and to help us to be better people. We await the return of Jesus to bring us to God, face to face. Amen.", "doctrinal": "Martha said to Jesus, “Lord, if you had been here, my brother would not have died. But even now I know that God will give you whatever you ask of him.” John 11:21-22", "daily_watchword": "Wait for the LORD; be strong, and let your heart take courage; wait for the LORD! Psalm 27:14", "verses": ["Psalm 72:12–20", "Numbers 23", "Mark 16:1–13"]}, "2026-06-06": {"prayer": "We worship you, Lord, for your appearance here on earth as a servant, not as king. We know that serving others is the best way to go. Help us to remain humble in our lives, as we follow Jesus’ example. Amen.", "doctrinal": "Of this man’s posterity God has brought to Israel a Savior, Jesus, as he promised. Acts 13:23", "daily_watchword": "David prayed, “And now, O LORD God, as for the word that you have spoken concerning your servant and concerning his house, confirm it forever; do as you have promised.” 2 Samuel 7:25", "verses": ["Psalm 73:1–12", "Numbers 24,25", "Mark 16:14–Luke 1:4"]}, "2026-06-07": {"prayer": "We pray, Lord, that you protect the least among us. Help us find ways to aid those around us who need a helping hand. We know that when we help others, we are honoring you. Amen.", "doctrinal": "Jesus said, “In the world you face persecution, but take courage: I have conquered the world!” John 16:33", "daily_watchword": "Though I walk in the midst of trouble, you preserve me. Psalm 138:7", "verses": ["Hosea 5:15-6:6", "Psalm 50:7-15", "Romans 4:13-25", "Matthew 9:9-13,18-26"], "weekly_watchword": "Watchword for the week — God desires steadfast love and not sacrifice, the knowledge of God rather than burnt offerings. Hosea 6:6", "special_remarks": ["Second Sunday after Pentecost"]}, "2026-06-08": {"prayer": "Lord, you know our families are a big part of our lives, as is our work. Help us to keep you in all parts of our lives; we need you there. Amen.", "doctrinal": "Simon answered, “Master, we have worked all night long but have caught nothing. Yet if you say so, I will let down the nets.” Luke 5:5", "daily_watchword": "I have labored in vain; I have spent my strength for nothing and vanity; yet surely my cause is with the LORD and my reward with my God. Isaiah 49:4", "verses": ["Psalm 73:13–20", "Numbers 26:1–25", "Luke 1:5–25"]}, "2026-06-09": {"prayer": "Lord, be with us on all our journeys. Help us to see you in those around us, regardless of how different they are from us. Amen.", "doctrinal": "Paul said, “For last night there stood by me an angel of the God to whom I belong and whom I worship, and he said, ‘Do not be afraid, Paul; you must stand before the emperor, and, indeed, God has granted safety to all those who are sailing with you.’” Acts 27:23-24", "daily_watchword": "Jacob went on his way, and the angels of God met him. Genesis 32:1", "verses": ["Psalm 73:21–28", "Numbers 26:26–56", "Luke 1:26–38"]}, "2026-06-10": {"prayer": "Thank you, Lord, for giving us the bread and water of life though your son, Jesus. Help us to feed those among us who still hunger and thirst. It is better to have more people at the table, for you always provide more than enough. Amen.", "doctrinal": "Jesus said to them, “Whoever believes in me will never be thirsty.” John 6:35", "daily_watchword": "Hear, everyone who thirsts; come to the waters. Isaiah 55:1", "verses": ["Psalm 74:1–9", "Numbers 26:57–27:23", "Luke 1:39–45"]}, "2026-06-11": {"prayer": "Lord, we bask in your protection. We hope to be strong and courageous disciples, for we can only do that work with you beside us. Help us feel your spirit within us. Amen.", "doctrinal": "Paul wrote: Indeed, we felt that we had received the sentence of death so that we would rely not on ourselves but on God, who raises the dead. He who rescued us from so deadly a peril will continue to rescue us. 2 Corinthians 1:9-10", "daily_watchword": "Have I not commanded you? Be strong and courageous. Joshua 1:9 NIV", "verses": ["Psalm 74:10–17", "Numbers 28:1–29:6", "Luke 1:46–56"]}, "2026-06-12": {"prayer": "Loving God, help us to respond to the people in need around us. Be with us as we serve our communities, because your son asked us to do this essential work. Thank you. Amen.", "doctrinal": "And God is able to provide you with every blessing in abundance, so that by always having enough of everything, you may share abundantly in every good work. 2 Corinthians 9:8", "daily_watchword": "For the LORD your God is bringing you into a good land, a land with flowing streams, with springs and underground waters. Deuteronomy 8:7", "verses": ["Psalm 74:18–23", "Numbers 29:7–40", "Luke 1:57–66"]}, "2026-06-13": {"prayer": "Jesus, you call us to continue the work you started here on earth: to find the lost, to heal the sick, to clothe the naked, and to visit the prisoner. Give us the strength to carry on this important and vital work. Amen.", "doctrinal": "Let us run with perseverance the race that is set before us, looking to Jesus, the pioneer and perfecter of faith. Hebrews 12:1-2", "daily_watchword": "Even youths will faint and be weary, and the young will fall exhausted, but those who wait for the LORD shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint. Isaiah 40:30-31", "verses": ["Psalm 75", "Numbers 30:1–31:12", "Luke 1:67–80"]}, "2026-06-14": {"prayer": "We pray, Lord, that you walk with us on our journeys. Thank you for your scripture that shows us the path. May we seek you to guide us on our way. Amen.", "doctrinal": "They said to each other, “Were not our hearts burning within us while he was talking to us on the road, while he was opening the scriptures to us?” Luke 24:32", "daily_watchword": "I will give them a heart to know that I am the LORD. Jeremiah 24:7", "verses": ["Exodus 19:2-8a", "Psalm 100", "Romans 5:1-8", "Matthew 9:35-10:8,(9-23)"], "weekly_watchword": "Watchword for the week — The LORD is good; his steadfast love endures forever, and his faithfulness to all generations. Psalm 100:5", "special_remarks": ["Third Sunday after Pentecost"]}, "2026-06-15": {"prayer": "Lord, your light is forever shining. Help us remember that in our darkest hours, you are always there to lead us, and your light will be our guide. Amen.", "doctrinal": "Jesus spoke to them, saying, “I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.” John 8:12", "daily_watchword": "For darkness shall cover the earth and thick darkness the peoples, but the LORD will arise upon you, and his glory will appear over you. Isaiah 60:2", "verses": ["Psalm 76", "Numbers 31:13–47", "Luke 2:1–20"]}, "2026-06-16": {"prayer": "You are a mighty fortress, Lord. We thank you for your protection over us. We know that you will always be with us when the world challenges us. Thank you. Amen.", "doctrinal": "The one who was born of God protects them, and the evil one does not touch them. 1 John 5:18", "daily_watchword": "Whoever fears the LORD has a secure fortress. Proverbs 14:26 NIV", "verses": ["Psalm 77:1–9", "Numbers 31:48–32:27", "Luke 2:21–32"]}, "2026-06-17": {"prayer": "We are so glad, Lord, that you are strong. You give us the strength we need to work wonders. May we remember to let you work through us and to not do everything on our own. Help us look to you for all we need to serve you and others. Amen.", "doctrinal": "We have our hope set on the living God, who is the Savior of all people, especially of those who believe. 1 Timothy 4:10", "daily_watchword": "I, the LORD, am your Savior and your Redeemer, the Mighty One. Isaiah 60:16", "verses": ["Psalm 77:10–15", "Numbers 32:28–42", "Luke 2:33–40"]}, "2026-06-18": {"prayer": "Lord God, please forgive us our sins. We so often think that we know better than you as to what we should do. May we turn to you rather than rely on ourselves. Amen.", "doctrinal": "Take care, brothers and sisters, that none of you may have an evil, unbelieving heart that turns away from the living God. Hebrews 3:12", "daily_watchword": "But when Pharaoh saw that the rain and the hail and the thunder had ceased, he sinned once more and hardened his heart. Exodus 9:34", "verses": ["Psalm 77:16–20", "Numbers 33", "Luke 2:41–52"]}, "2026-06-19": {"prayer": "Lord, thank you for freeing us and setting us on the right path. We try every day to remember that we are free because of you. Help us continue to choose your way. Amen.", "doctrinal": "For freedom Christ has set us free. Stand firm, therefore, and do not submit again to a yoke of slavery. Galatians 5:1", "daily_watchword": "You have set my feet in a broad place. Psalm 31:8", "verses": ["Psalm 78:1–8", "Numbers 34", "Luke 3:1–20"]}, "2026-06-20": {"prayer": "Lord, we praise you daily. Thank you for your grace and love. We so often fall short in our devotion to you. Help us to continue to praise you, even in our weakness. Amen.", "doctrinal": "He asked for a writing tablet and wrote, “His name is John.” And all of them were amazed. Immediately his mouth was opened and his tongue freed, and he began to speak, praising God. Luke 1:63-64", "daily_watchword": "My lips will shout for joy when I sing praises to you; my soul also, which you have rescued. Psalm 71:23", "verses": ["Psalm 78:9–16", "Numbers 35:1–21", "Luke 3:21–38"]}, "2026-06-21": {"prayer": "Lord, you are so powerful, and we are so weak. We keep you ever before us. Help us to be stronger each day. Thank you for continuing to forgive us when we fail again and again. Amen.", "doctrinal": "Paul wrote: He said to me, “My grace is sufficient for you, for power is made perfect in weakness.” 2 Corinthians 12:9", "daily_watchword": "I called to the LORD out of my distress, and he answered me. Jonah 2:2", "verses": ["Jeremiah 20:7-13", "Psalm 69:7-10,(11-15),16-18", "Romans 6:1b-11", "Matthew 10:24-39"], "weekly_watchword": "Watchword for the week — Jesus said, “Those who find their life will lose it, and those who lose their life for my sake will find it.” Matthew 10:39", "special_remarks": ["Fourth Sunday after Pentecost"]}, "2026-06-22": {"prayer": "Lord, we need to remember that you have led your people out of many dire situations. Help us to learn and remember your gentle and tender leadership is for all your people. Amen.", "doctrinal": "For we have become partners of Christ, if only we hold our first confidence firm to the end. Hebrews 3:14", "daily_watchword": "Thus says the LORD, “I remember the devotion of your youth, your love as a bride, how you followed me in the wilderness, in a land not sown.” Jeremiah 2:2", "verses": ["Psalm 78:17–31", "Numbers 35:22-36:13", "Luke 4:1–13"]}, "2026-06-23": {"prayer": "Lord, we know that you have the ultimate power over life and death. Be with us as we face our own mortality. Help us process the loss of loved ones. Strengthen us so we always feel your love and power around us. Amen.", "doctrinal": "And God raised the Lord and will also raise us by his power. 1 Corinthians 6:14", "daily_watchword": "Our God is a God of salvation, and to God, the Lord, belongs escape from death. Psalm 68:20", "verses": ["Psalm 78:32–39", "Deuteronomy 1", "Luke 4:14–21"]}, "2026-06-24": {"prayer": "Dear Lord, please forgive us of all our sins and oversights. Keep us ever in your light, while we remember that we must also forgive those around us. In Jesus’ name, we pray. Amen.", "doctrinal": "Therefore, bear fruit worthy of repentance. Matthew 3:8", "daily_watchword": "Do not be exceedingly angry, O LORD, and do not remember iniquity forever. Now consider, we are all your people. Isaiah 64:9", "verses": ["Psalm 78:40–55", "Deuteronomy 2", "Luke 4:22–30"]}, "2026-06-25": {"prayer": "Lord, help us to be worthy stewards of your lands and people. We know we need to be fair and just when dealing with others, whether in work or play. Help us to love and respect others as you love and respect us. Amen.", "doctrinal": "Jesus said, “His master said to him, ‘Well done, good and trustworthy slave; you have been trustworthy in a few things; I will put you in charge of many things; enter into the joy of your master.’” Matthew 25:21", "daily_watchword": "But you, take courage! Do not let your hands be weak, for your work shall be rewarded. 2 Chronicles 15:7", "verses": ["Psalm 78:56–64", "Deuteronomy 3", "Luke 4:31–44"]}, "2026-06-26": {"prayer": "Lord, may we keep your shining star ever before us. Help us seek your light and share it with all we come in contact with throughout the year. Amen.", "doctrinal": "After Jesus was born in Bethlehem of Judea, during the time of King Herod, Magi from the east came to Jerusalem and asked, “Where is the one who has been born king of the Jews? We saw his star when it rose and have come to worship him.” Matthew 2:1-2 NIV", "daily_watchword": "But you, O Bethlehem of Ephrathah, who are one of the little clans of Judah, from you shall come forth for me one who is to rule in Israel, whose origin is from of old, from ancient days. Micah 5:2", "verses": ["Psalm 78:65–72", "Deuteronomy 4:1–31", "Luke 5:1–11"]}, "2026-06-27": {"prayer": "Lord, we pray that you guide us everyday. Help us to bring light to those around us who are struggling with darkness. This work can be very troubling. Help us be a guiding hand for others who do not know that you are always there for everyone. Amen.", "doctrinal": "For once you were darkness, but now in the Lord you are light. Walk as children of light. Ephesians 5:8", "daily_watchword": "Do not turn my heart to any evil. Psalm 141:4", "verses": ["Psalm 79:1–8", "Deuteronomy 4:32–5:21", "Luke 5:12–26"]}, "2026-06-28": {"prayer": "Lord, we need your light to guide our feet and keep us always faithful. We want to be living examples of your love and selflessness. Help us to look to you to guide us and ease our way. Amen.", "doctrinal": "Peter said, “I have no silver or gold, but what I have I give you; in the name of Jesus Christ of Nazareth, stand up and walk.” Acts 3:6", "daily_watchword": "You have made me stride freely, and my feet do not slip. 2 Samuel 22:37", "verses": ["Jeremiah 28:5-9", "Psalm 89:1-4,15-18", "Romans 6:12-23", "Matthew 10:40-42"], "weekly_watchword": "Watchword for the week — Happy are the people who know the festal shout, who walk, O LORD, in the light of your countenance. Psalm 89:15", "special_remarks": ["Fifth Sunday after Pentecost"]}, "2026-06-29": {"prayer": "Lord, we must work for justice in all lands. The weak need our help. Guide us to focus on the least of these and follow your teachings. Amen.", "doctrinal": "Do not be mismatched with unbelievers. For what do righteousness and lawlessness have in common? Or what partnership is there between light and darkness? 2 Corinthians 6:14", "daily_watchword": "Hate evil and love good, and establish justice in the gate; it may be that the LORD, the God of hosts, will be gracious. Amos 5:15", "verses": ["Psalm 79:9–13", "Deuteronomy 5:22–6:25", "Luke 5:27–39"]}, "2026-06-30": {"prayer": "Lord, remain beside us throughout our lives. We are not able to be faithful without your help. May we be the best we can be as an example of your everlasting love. Amen.", "doctrinal": "Therefore be imitators of God, as beloved children, and walk in love, as Christ loved us and gave himself up for us, a fragrant offering and sacrifice to God. Ephesians 5:1-2", "daily_watchword": "Return, O faithless children, says the LORD, for I am your husband; I will take you, and I will bring you to Zion. Jeremiah 3:14", "verses": ["Psalm 80:1–7", "Deuteronomy 7", "Luke 6:1–11"]}, "2026-07-01": {"prayer": "Creator of all knowledge, holder of our fears, through the trials of life, help us to always remember that you are forever with us. In the name of Jesus, we pray. Amen.", "doctrinal": "Examine yourselves to see whether you are living in the faith. Test yourselves. Do you not realize that Jesus Christ is in you? 2 Corinthians 13:5", "daily_watchword": "The fear of the LORD is the beginning of knowledge. Proverbs 1:7", "verses": ["Psalm 80:8–11", "Deuteronomy 8:1–9:6", "Luke 6:12–26"]}, "2026-07-02": {"prayer": "Dearest Savior, we welcome you to walk the vineyards of our souls, and as you walk, remove from us those things that do not bring you glory. In their place, plant your life-giving eternal seeds. In your holy name, we pray. Amen.", "doctrinal": "She will bear a son, and you are to name him Jesus, for he will save his people from their sins. Matthew 1:21", "daily_watchword": "Lord God, do not destroy your people, your very own possession, whom you redeemed in your greatness. Deuteronomy 9:26", "verses": ["Psalm 80:12–19", "Deuteronomy 9:7–10:22", "Luke 6:27–38"]}, "2026-07-03": {"prayer": "Healing Lord, through your power and grace, strengthen us each day to make a joyful noise unto you with our voices and our hearts. We praise your name today and always. Amen.", "doctrinal": "Then looking up to heaven, [Jesus] sighed and said to him, “Ephphatha,” that is, “Be opened.” And his ears were opened, his tongue was released, and he spoke plainly. Mark 7:34-35", "daily_watchword": "For he spoke, and it came to be; he commanded, and it stood firm. Psalm 33:9", "verses": ["Psalm 81:1–5", "Deuteronomy 11", "Luke 6:39–49"]}, "2026-07-04": {"prayer": "Heavenly Sender, oftentimes you call us to walk through unfamiliar lands or explore the uncomfortable places of our soul. In those moments, let the peace of your word and the light of your love serve as an ever-present reminder that you walk with us. In your holy name, we pray. Amen.", "doctrinal": "So we are ambassadors for Christ, since God is making his appeal through us; we entreat you on behalf of Christ: be reconciled to God. 2 Corinthians 5:20", "daily_watchword": "Then I heard the voice of the Lord saying, “Whom shall I send, and who will go for us?” And I said, “Here am I; send me!” Isaiah 6:8", "verses": ["Psalm 81:6–10", "Deuteronomy 12", "Luke 7:1–17"]}, "2026-07-05": {"prayer": "Precious Creator, as a mother’s love shapes our lives, we welcome your love to shape our faith. We seek a genuine faith, not created in a moment, but formed by a lifetime of moments travelled with our Lord and Savior. In Jesus’ name, we pray. Amen.", "doctrinal": "I am reminded of your sincere faith, a faith that lived first in your grandmother Lois and your mother Eunice and now, I am sure, lives in you. 2 Timothy 1:5", "daily_watchword": "And since my mother bore me you have been my God. Psalm 22:10", "verses": ["Zechariah 9:9-12", "Psalm 145:8-14", "Romans 7:15-25a", "Matthew 11:16-19,25-30"], "weekly_watchword": "Watchword for the week — The LORD is gracious and merciful, slow to anger and abounding in steadfast love. Psalm 145:8", "special_remarks": ["Sixth Sunday after Pentecost"]}, "2026-07-06": {"prayer": "Lord, we strive each day to be your humble servants. Servanthood can be difficult, and many times it feels impossible to us. In those moments, increase our faith, even to the point of giving our lives to you. Amen.", "doctrinal": "Whoever serves me must follow me, and where I am, there will my servant be also. John 12:26", "daily_watchword": "You must therefore be careful to do as the LORD your God has commanded you; you shall not turn to the right or to the left. Deuteronomy 5:32", "verses": ["Psalm 81:11–16", "Deuteronomy 13:1–14:21", "Luke 7:18–30"], "special_remarks": ["John Hus Festival† — Isaiah 49:1-7; Psalm 135:1-13", "1 Corinthians 1:18-24; Mark 8:34-38"]}, "2026-07-07": {"prayer": "God of the morning, as we wake to the dawn of a new day, lift us from the depths of darkness to the lofty heights of light and peace. In the name of Jesus, we pray. Amen.", "doctrinal": "Peter said to him, “Aeneas, Jesus Christ heals you; get up and make your bed!” And immediately he got up. Acts 9:34", "daily_watchword": "You brought up my life from the pit, O LORD my God. Jonah 2:6", "verses": ["Psalm 82:1–4", "Deuteronomy 14:22–15:18", "Luke 7:31–38"]}, "2026-07-08": {"prayer": "Loving God, as we breathe in your words of loving- kindness, we pray that our speech and actions will give birth to peace, hope, and love. Amen.", "doctrinal": "Jesus said, “I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another.” John 13:34", "daily_watchword": "Must I not take care to say what the LORD puts into my mouth? Numbers 23:12", "verses": ["Psalm 82:5–8", "Deuteronomy 15:19–17:7", "Luke 7:39–50"]}, "2026-07-09": {"prayer": "Pillar of cloud, many times you seem so far from us. In those moments, remind us that you are as close to us as the prayer on our lips. We pray this, in your holy name. Amen.", "doctrinal": "To them God chose to make known how great among the gentiles are the riches of the glory of this mystery, which is Christ in you, the hope of glory. Colossians 1:27", "daily_watchword": "There is a God in heaven who reveals mysteries. Daniel 2:28", "verses": ["Psalm 83:1–8", "Deuteronomy 17:8–18:22", "Luke 8:1–15"]}, "2026-07-10": {"prayer": "O God, may the work of our hands, the words of our mouths, indeed, every breath we take, bring glory and praise to you. In Jesus’ name, we pray. Amen.", "doctrinal": "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17", "daily_watchword": "Whatever your hand finds to do, do with your might. Ecclesiastes 9:10", "verses": ["Psalm 83:9–12", "Deuteronomy 19:1–20:9", "Luke 8:16–25"]}, "2026-07-11": {"prayer": "Prince of peace, perhaps in the stillness of the morning dew, or the gentle wind in the trees, and always through your presence, may we find that precious inner tranquility. Hear the whisper of our soul. Amen.", "doctrinal": "And those in the boat worshiped him, saying, “Truly you are the Son of God.” Matthew 14:33", "daily_watchword": "Be still, and know that I am God! Psalm 46:10", "verses": ["Psalm 83:13–18", "Deuteronomy 20:10–21:23", "Luke 8:26–39"]}, "2026-07-12": {"prayer": "Great Protector, your children will be called upon to undertake difficult journeys, some physical and some spiritual. In those moments of challenge, we look to you to be our safe haven from all that would harm us. Amen.", "doctrinal": "When Herod died, an angel of the Lord suddenly appeared in a dream to Joseph in Egypt and said, “Get up, take the child and his mother, and go to the land of Israel, for those who were seeking the child’s life are dead.” Matthew 2:19-20", "daily_watchword": "For you have been a refuge to the poor, a refuge to the needy in their distress, a shelter from the rainstorm and a shade from the heat, when the blast of the ruthless was like a winter rainstorm. Isaiah 25:4", "verses": ["Isaiah 55:10-13", "Psalm 65:(1-8),9-13", "Romans 8:1-11", "Matthew 13:1-9,18-23"], "weekly_watchword": "Watchword for the week — There is therefore now no condemnation for those who are in Christ Jesus. Romans 8:1", "special_remarks": ["Seventh Sunday after Pentecost"]}, "2026-07-13": {"prayer": "Heavenly Judge, we are guilty of judging our neighbors by those things of a temporal nature. We pray for your wisdom to see those around us as you would see them, with dignity, justice, and mercy. In Jesus’ name, we pray. Amen.", "doctrinal": "Jesus said, “I judge, and my judgment is just because I seek to do not my own will but the will of him who sent me.” John 5:30", "daily_watchword": "For he is coming to judge the earth. He will judge the world with righteousness and the peoples with equity. Psalm 98:9", "verses": ["Psalm 84:1–7", "Deuteronomy 22", "Luke 8:40–56"]}, "2026-07-14": {"prayer": "Eternal Power, you could choose to rule over us with an unimaginable might and fear. However, you have chosen to guide us through your unending mercy and compassion. For this, we give you thanks. We pray this in the spirit of your love. Amen.", "doctrinal": "And I heard a loud voice from the throne saying, “See, the home of God is among mortals. He will dwell with them; they will be his peoples, and God himself will be with them and be their God.” Revelation 21:3", "daily_watchword": "See, the Lord God comes with might, and his arm rules for him. Isaiah 40:10", "verses": ["Psalm 84:8–12", "Deuteronomy 23:1–24:13", "Luke 9:1–11"]}, "2026-07-15": {"prayer": "Almighty God, at times the power of your voice can seem overwhelming, even intimidating. Yet, through the love of your son walking with us, we are reassured of your comfort and protection. Thank you for your love. Amen.", "doctrinal": "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16", "daily_watchword": "My heart recoils within me; my compassion grows warm and tender. I will not execute my fierce anger; for I am God and no mortal, the Holy One in your midst. Hosea 11:8,9", "verses": ["Psalm 85:1–7", "Deuteronomy 24:14–25:19", "Luke 9:12–27"]}, "2026-07-16": {"prayer": "Amazing Savior, through your selfless example of sacrifice, even death on the cross, you have taught us what perfect love looks like. As we live out each day in the light of your love, teach us to shine this light on the people we meet along the way. Amen.", "doctrinal": "Jesus said to his mother, “Woman, here is your son.” Then he said to the disciple, “Here is your mother.” And from that hour the disciple took her into his own home. John 19:26-27", "daily_watchword": "God is our refuge and strength, a very present help in trouble. Therefore we will not fear. Psalm 46:1-2", "verses": ["Psalm 85:8–13", "Deuteronomy 26:1–27:13", "Luke 9:28–36"]}, "2026-07-17": {"prayer": "Wonderful Savior, you have promised to never leave nor forsake us. Your love for us has caused you to humble yourself from your heavenly throne to the dust of the earth. You also promise to raise us from the dust of the earth to the foot of your heavenly throne. May we remain ready for this miraculous transformation. In your holy name, we pray. Amen.", "doctrinal": "Jesus said, “I will not leave you orphaned; I am coming to you.” John 14:18", "daily_watchword": "Look down from heaven and see, from your holy and glorious habitation. Where are your zeal and your might? Isaiah 63:15", "verses": ["Psalm 86:1–10", "Deuteronomy 27:14–28:24", "Luke 9:37–50"]}, "2026-07-18": {"prayer": "Almighty Creator, you have formed each of us as a unique person, made perfect because we are created in your image. May we always see you in the other as we embrace their limitless potential. In Jesus’ name, we pray. Amen.", "doctrinal": "Honor one another above yourselves. Romans 12:10 NIV", "daily_watchword": "He created them male and female and blessed them. And he named them “Mankind” when they were created. Genesis 5:2 NIV", "verses": ["Psalm 86:11–17", "Deuteronomy 28:25–57", "Luke 9:51–62"]}, "2026-07-19": {"prayer": "Great Potter, you find us as broken vessels in need of repair. Although broken, you still see in us the perfection of your craftsmanship. Because of you, we are made whole again! May our gratitude be evident for all to see. In Jesus’ name, we pray. Amen.", "doctrinal": "For our sake God made the one who knew no sin to be sin, so that in him we might become the righteousness of God. 2 Corinthians 5:21", "daily_watchword": "O LORD, do not rebuke me in your anger or discipline me in your wrath. Psalm 6:1", "verses": ["Isaiah 44:6-8", "Psalm 86:11-17", "Romans 8:12-25", "Matthew 13:24-30,36-43"], "weekly_watchword": "Watchword for the week — Thus says the LORD, the King of Israel, and his Redeemer, the LORD of hosts: I am the first and I am the last; besides me there is no god. Isaiah 44:6", "special_remarks": ["Eighth Sunday after Pentecost"]}, "2026-07-20": {"prayer": "Eternal Covenant, as we pray, we breathe in your promises of forgiveness, salvation, and an eternity spent with you. As we breathe out, we confess your name with worshipful adoration. Thank you for the stillness you provide us with each breath. Amen.", "doctrinal": "Jesus answered, “You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.” John 18:37", "daily_watchword": "The promises of the LORD are promises that are pure, silver refined in a furnace on the ground, purified seven times. Psalm 12:6", "verses": ["Psalm 87", "Deuteronomy 28:58–29:21", "Luke 10:1–16"]}, "2026-07-21": {"prayer": "Patient God, forgive us for requiring that you give us signs and miracles as evience before we embrace belief. This communion with you, through the prayers of our hearts, is the purest, most loving miracle of all. We pray all of this in your name. Amen.", "doctrinal": "Now as he was approaching the path down from the Mount of Olives, the whole multitude of the disciples began to praise God joyfully with a loud voice for all the deeds of power that they had seen. Luke 19:37", "daily_watchword": "Rejoice with Jerusalem, and be glad for her, all you who love her; rejoice with her in joy, all you who mourn over her. Isaiah 66:10", "verses": ["Psalm 88:1–5", "Deuteronomy 29:22–31:8", "Luke 10:17–24"]}, "2026-07-22": {"prayer": "Great Physician, from the earliest of times, you have knelt by us, healed us, and given us hope for better days ahead. Now in humble adoration, we kneel before you, as the healing balm of salvation flows through our hearts. May we always come before you for our healing. Amen.", "doctrinal": "The crowd was amazed when they saw the mute speaking, the maimed whole, the lame walking, and the blind seeing. And they praised the God of Israel. Matthew 15:31", "daily_watchword": "[God] said, “All the people among whom you live shall see the work of the LORD.” Exodus 34:10", "verses": ["Psalm 88:6–12", "Deuteronomy 31:9–32:9", "Luke 10:25–42"]}, "2026-07-23": {"prayer": "Compassionate Comforter, when our brothers and sisters cry out to you for help, we know that it will be our hands that will minister to them. We pray that you give us the wisdom to provide for their physical and spiritual needs. Amen.", "doctrinal": "And a man lame from birth was being carried in. People would lay him daily at the gate of the temple called the Beautiful Gate so that he could ask for alms from those entering the temple. Acts 3:2", "daily_watchword": "I am shut in so that I cannot escape; my eye grows dim through sorrow. Every day I call on you, O LORD. Psalm 88:8-9", "verses": ["Psalm 88:13–18", "Deuteronomy 32:10–43", "Luke 11:1–13"]}, "2026-07-24": {"prayer": "Dear God, in this moment, quiet our minds as we bask in the wonder of your endless blessings. The most beautiful blessing is the knowledge that we will walk with Christ for eternity. We pray this in the glory of your name. Amen.", "doctrinal": "We know that the one who raised Jesus will also raise us with Jesus and will present us with you in his presence. 2 Corinthians 4:14", "daily_watchword": "He does great things beyond understanding and marvelous things without number. Job 9:10", "verses": ["Psalm 89:1–8", "Deuteronomy 32:44–33:17", "Luke 11:14–28"]}, "2026-07-25": {"prayer": "Great Equalizer, you seek out those most alienated from society: the forgotten, the despised. You make your face shine upon their very existence with justice and mercy. May you teach us to always do the same. Amen.", "doctrinal": "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation. 2 Corinthians 1:3", "daily_watchword": "Father of orphans and protector of widows is God in his holy habitation. God gives the desolate a home to live in; he leads out the prisoners to prosperity. Psalm 68:5-6", "verses": ["Psalm 89:9–18", "Deuteronomy 33:18–34:12", "Luke 11:29–36"]}, "2026-07-26": {"prayer": "Gentle Dove of peace, we live in a world shaken to its core by wars and acts of violence. Set our hearts upon your ways as we extend an olive branch to all those we meet. We pray this in your restorative name. Amen.", "doctrinal": "Blessed are the peacemakers, for they will be called children of God. Matthew 5:9", "daily_watchword": "As they were leaving he said to them, “Do not quarrel along the way.” Genesis 45:24", "verses": ["1 Kings 3:5-12", "Psalm 119:129-136", "Romans 8:26-39", "Matthew 13:31-33,44-52"], "weekly_watchword": "Watchword for the week — God, turn to me and be gracious to me, as is your custom toward those who love your name. Psalm 119:132", "special_remarks": ["Ninth Sunday after Pentecost"]}, "2026-07-27": {"prayer": "Ever-watchful Savior, whenever we find ourselves unjustly accused in life, whether by other people or life’s circumstances, we find hope in the blessed assurance that you will never let us fall. Thank you for your presence in our lives. Amen.", "doctrinal": "While he was sitting on the judgment seat, his wife sent word to him, “Have nothing to do with that innocent man, for today I have suffered a great deal because of a dream about him.” Matthew 27:19", "daily_watchword": "The eyes of the LORD are on the righteous, and his ears are open to their cry. Psalm 34:15", "verses": ["Psalm 89:19–29", "Joshua 1,2", "Luke 11:37–54"]}, "2026-07-28": {"prayer": "Blessed Trinity, may all of our songs to you be joyful and full of praise. Whether our song be the sound of our beating heart or our prayers prayed through tears of joy, we look lovingly to you as we lift them up in your presence. Amen.", "doctrinal": "Sing and make music from your heart to the Lord. Ephesians 5:19 NIV", "daily_watchword": "In God we have boasted continually, and we will give thanks to your name forever. Psalm 44:8", "verses": ["Psalm 89:30–37", "Joshua 3,4", "Luke 12:1–12"]}, "2026-07-29": {"prayer": "O God, many times in life our tears of sorrow become so familiar to us that they feel like an old friend. In those darkest moments, we ask you to enter our hearts with your love and comfort. May we be open to your movement within us. Amen.", "doctrinal": "Paul wrote: It has become known throughout the whole imperial guard and to everyone else that my imprisonment is for Christ, and most of the brothers and sisters, having been made confident in the Lord by my imprisonment, dare to speak the word with greater boldness and without fear. Philippians 1:13-14", "daily_watchword": "My tears have been my food day and night, while people say to me continually, “Where is your God?” Psalm 42:3", "verses": ["Psalm 89:38–45", "Joshua 5,6", "Luke 12:13–21"]}, "2026-07-30": {"prayer": "God of strength, the race you have set before us is not judged by miles or medals, but instead, through the measure of souls touched by the life- giving promise of your salvation. May we trust in your grace and mercy. In your holy name, we pray. Amen.", "doctrinal": "These are the words of the holy One, the true One: “Because you have kept my word of endurance, I will keep you from the hour of trial.” Revelation 3:7,10", "daily_watchword": "The people who are loyal to their God shall stand firm and take action. Daniel 11:32", "verses": ["Psalm 89:46–52", "Joshua 7", "Luke 12:22–34"]}, "2026-07-31": {"prayer": "Great I Am, as we walk through life’s trials, hear our prayer. When all seems lost, hear our prayer. When hope springs eternal, hear our prayer. When we can do nothing else but praise your name, hear our prayer. Amen.", "doctrinal": "Pray that you may not come into the time of trial. Luke 22:40", "daily_watchword": "I will now refine and test them. Jeremiah 9:7", "verses": ["Psalm 90", "Joshua 8:1–29", "Luke 12:35–48"]}, "2026-08-01": {"prayer": "Abundant Leader, help us not just to obey, but to listen and act with your lessons in our heart. May all we do be rooted in you and your abundance. Amen.", "doctrinal": "Live by the Spirit, to prevent you from doing what you want. Galatians 5:16,17", "daily_watchword": "You shall not set your desire on your neighbor’s house or anything that belongs to your neighbor. Deuteronomy 5:21 NIV", "verses": ["Psalm 91:1–8", "Joshua 8:30–9:27", "Luke 12:49–59"]}, "2026-08-02": {"prayer": "Lord, as foreigners in a strange land, remind us to be mindful of the familiar temptations to serve the gods of false strength, security, and familiarity. Instead, help us follow your generous and compassionate leading. Amen.", "doctrinal": "Now, however, that you have come to know God, or rather to be known by God, how can you turn back again to the weak and beggarly elemental principles? How can you want to be enslaved to them again? Galatians 4:9", "daily_watchword": "Although these nations that you are about to dispossess do give heed to soothsayers and diviners, as for you, the LORD your God does not permit you to do so. Deuteronomy 18:14", "verses": ["Isaiah 55:1-5", "Psalm 145:8-9,14-21", "Romans 9:1-5", "Matthew 14:13-21"], "weekly_watchword": "Watchword for the week — The LORD is good to all, and his compassion is over all that he has made. Psalm 145:9", "special_remarks": ["Tenth Sunday after Pentecost"]}, "2026-08-03": {"prayer": "Lord, you are God over all of us, before all of us, and after all of us. You give life and grace to all your children. Help us to see them as you do, so that our finite separations dissolve into your infinite acceptance. We pray this in your name. Amen.", "doctrinal": "And they praised God, saying, “Then God has given even to the gentiles the repentance that leads to life.” Acts 11:18", "daily_watchword": "Know that the LORD is God. Psalm 100:3", "verses": ["Psalm 91:9–16", "Joshua 10:1–27", "Luke 13:1–17"]}, "2026-08-04": {"prayer": "God, there is no superhero stronger or braver than you. Help us look for you in times of need, for you are never far away. Amen.", "doctrinal": "On him we have set our hope that he will rescue us again. 2 Corinthians 1:10", "daily_watchword": "The LORD said, “You have seen what I did to the Egyptians and how I bore you on eagles’ wings and brought you to myself.” Exodus 19:4", "verses": ["Psalm 92:1–8", "Joshua 10:28–11:23", "Luke 13:18–30"]}, "2026-08-05": {"prayer": "God, in the darkness of struggle, in the helplessness of grief, and in the confusion of anger, guide us to your heart and healing. May our faith in you be a security blanket against the coldness of the world. Amen.", "doctrinal": "In all this you greatly rejoice, though now for a little while you may have had to suffer grief in all kinds of trials. These have come so that the proven genuineness of your faith—of greater worth than gold. 1 Peter 1:6-7 NIV", "daily_watchword": "Gideon answered him, “But sir, if the LORD is with us, why then has all this happened to us?” Judges 6:13", "verses": ["Psalm 92:9–15", "Joshua 12:1–13:7", "Luke 13:31–14:6"]}, "2026-08-06": {"prayer": "Creator, thank you for the abundance and beauty of this world. Thank you for the joy of community and faith. Help us celebrate this goodness all day. Amen.", "doctrinal": "The Jailer and his entire household rejoiced that he had become a believer in God. Acts 16:34", "daily_watchword": "Those who live at earth’s farthest bounds are awed by your signs. Psalm 65:8", "verses": ["Psalm 93", "Joshua 13:8–14:5", "Luke 14:7–24"]}, "2026-08-07": {"prayer": "Jesus, you once said, “Blessed are the peacemakers.” Help us see what we can do to make peace in our lives, in our communities, and across divisions. Heal us from our own judgements and make us whole. Amen.", "doctrinal": "So he came and proclaimed peace to you who were far off and peace to those who were near. Ephesians 2:17", "daily_watchword": "Sing aloud, O daughter Zion, shout, O Israel! Rejoice and exult with all your heart, O daughter Jerusalem! The LORD has taken away the judgments against you. Zephaniah 3:14-15", "verses": ["Psalm 94:1–11", "Joshua 14:6–15:19", "Luke 14:25–35"]}, "2026-08-08": {"prayer": "Savior, we trust in your work of redemption. Teach us to wait for you and listen for your guidance. Open our ears, hearts, and eyes to see where and how you are asking us to be your loving presence. Amen.", "doctrinal": "Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you. Matthew 7:7", "daily_watchword": "You are the God of my salvation; for you I wait all day long. Psalm 25:5", "verses": ["Psalm 94:12–23", "Joshua 15:20–63", "Luke 15:1–10"]}, "2026-08-09": {"prayer": "Wise Gardener, thank you for continually sowing good and new seeds in this world. Thank you for never giving up on us, your seedlings. May we follow your example of sowing good and new things to make your world, your harvest, more abundant. We pray this in your name. Amen.", "doctrinal": "The one who sows the good seed is the Son of Man; the field is the world. Matthew 13:37-38", "daily_watchword": "See, the former things have come to pass, and new things I now declare; before they spring forth, I tell you of them. Isaiah 42:9", "verses": ["1 Kings 19:9-18", "Psalm 85:8-13", "Romans 10:5-15", "Matthew 14:22-33"], "weekly_watchword": "Watchword for the week — Jesus spoke to the disciples and said, “Take heart, it is I; do not be afraid.” Matthew 14:27", "special_remarks": ["Eleventh Sunday after Pentecost"]}, "2026-08-10": {"prayer": "Lord, your kingdom is not our kingdom. Keep us from misguided idol-following; teach us instead to work toward your kingdom, and to make this world very good for all who call it home. Amen.", "doctrinal": "When the Son of Man comes in his glory and all the angels with him, then he will sit on the throne of his glory. All the nations will be gathered before him. Matthew 25:31-32", "daily_watchword": "The LORD has established his throne in the heavens, and his kingdom rules over all. Psalm 103:19", "verses": ["Psalm 95", "Joshua 16,17", "Luke 15:11–32"]}, "2026-08-11": {"prayer": "God, you are our safe confidant with whom we share our most secret anxieties and hopes. You have seen us at our most vulnerable and know our greatest capacity. Alleviate our concerns and nurture us as we grow as children of God. Amen.", "doctrinal": "Simon Peter answered him, “Lord, to whom can we go? You have the words of eternal life. We have come to believe and know that you are the Holy One of God.” John 6:68-69", "daily_watchword": "Teach me the way I should go, for to you I lift up my soul. Psalm 143:8", "verses": ["Psalm 96:1–9", "Joshua 18:1–19:9", "Luke 16:1–15"]}, "2026-08-12": {"prayer": "Beloved and gentle Parent, you are indulgent and endlessly compassionate. May we learn to hold each other as a good parent holds their infant: with strength, tenderness, and unimaginable love. Amen.", "doctrinal": "And because you are children, God has sent the Spirit of his Son into our hearts, crying, “Abba! Father!” Galatians 4:6", "daily_watchword": "As a father has compassion for his children, so the LORD has compassion for those who fear him. Psalm 103:13", "verses": ["Psalm 96:10–13", "Joshua 19:10–39", "Luke 16:16–31"]}, "2026-08-13": {"prayer": "† On this date in 1727 in Berthelsdorf, Saxony (now Germany), a group of quarreling Christians experienced their unity in Christ through the power of the Holy Spirit. This new Pentecost marked the revival of the Unity of the Brethren, begun in 1457, and the beginning of the Renewed Moravian Church.", "doctrinal": "Great Healer, on this day, when we remember the reconciliation of those quarreling refugees in Herrnhut all those years ago, we ask that you make us whole today. We ask forgiveness for harming each other. Help us to relearn that to love someone means loving them exactly as they are. Amen.", "daily_watchword": "For in him every one of God’s promises is a “Yes.” For this reason it is through him that we say the “Amen,” to the glory of God. 2 Corinthians 1:20", "verses": ["Joshua 19:40–21:8", "Luke 17:1–10", "He is mindful of his covenant forever, of the word that he commanded for a thousand generations. Psalm 105:8"], "special_remarks": ["August Thirteenth Festival† — Joshua 24:16-24; Psalm 133", "1 John 4:1-13; John 17:1-2,6-19", "Thursday, August 13 — Psalm 97:1–6"]}, "2026-08-14": {"prayer": "Protector, you have sheltered your people in the past. Preserve us this day, we pray, from spiritual blindness and earthly trials by reminding us of your unending abundance and penetrating light. Amen.", "doctrinal": "He answered, “The man called Jesus made mud, spread it on my eyes, and said to me, ‘Go to Siloam and wash.’ Then I went and washed and received my sight.” John 9:11", "daily_watchword": "You have granted me life and steadfast love, and your care has preserved my spirit. Job 10:12", "verses": ["Psalm 97:7–12", "Joshua 21:9–45", "Luke 17:11–19"]}, "2026-08-15": {"prayer": "Surprising God, open our hearts to the unexpected ones who kneel before you today, modeling your ways in the world right now. May we delight in your surprises and shout our gratitude for your work in our world. Amen.", "doctrinal": "He prostrated himself at Jesus’ feet and thanked him. And he was a Samaritan. Luke 17:16", "daily_watchword": "O come, let us worship and bow down; let us kneel before the LORD, our Maker! Psalm 95:6", "verses": ["Psalm 98", "Joshua 22", "Luke 17:20–25"]}, "2026-08-16": {"prayer": "Merciful God, in moments of anger and angst, help us to remember your love and saving grace. Remind us that your steadfast, unwavering love lasts forever, so that we may demonstrate mercy today, instead of wrath. In Jesus’ name, we pray. Amen.", "doctrinal": "For God has destined us not for wrath but for obtaining salvation through our Lord Jesus Christ. 1 Thessalonians 5:9", "daily_watchword": "For in my wrath I struck you down, but in my favor I have had mercy on you. Isaiah 60:10", "verses": ["Isaiah 56:1,6-8", "Psalm 67", "Romans 11:1-2a,29-32", "Matthew 15:(10-20),21-28"], "weekly_watchword": "Watchword for the week — Let the peoples praise you, O God; let all the peoples praise you. Psalm 67:5", "special_remarks": ["Twelfth Sunday after Pentecost"]}, "2026-08-17": {"prayer": "Lord, we come to you with all our questions, our brokenness, and our disappointments in the world. Sometimes, these are the only things that we can bring to you. Inspire us to transform injustice to goodness and peace. We pray this in your name. Amen.", "doctrinal": "Jesus said to them, “Give to Caesar the things that are Caesar’s and to God the things that are God’s.” Mark 12:17", "daily_watchword": "For the LORD loves justice. Psalm 37:28", "verses": ["Psalm 99", "Joshua 23:1–24:13", "Luke 17:26–37"]}, "2026-08-18": {"prayer": "Lord, there are moments that require stillness and moments that require busyness. May we discern those to which you call us to as we face uncertain times. Author of creativity, thank you for the variety of gifts and means of service by which we follow you. Amen.", "doctrinal": "She had a sister named Mary, who sat at Jesus’s feet and listened to what he was saying. Luke 10:39", "daily_watchword": "The Lord God has opened my ear, and I was not rebellious; I did not turn backward. Isaiah 50:5", "verses": ["Psalm 100", "Joshua 24:14–Judges 1:16", "Luke 18:1–17"]}, "2026-08-19": {"prayer": "God of risen life, may we see your presence among us, seeking awareness of you in those around us. Let us be found ready for a joyful gathering with you at any moment as we look forward to reconnecting with loved ones who are at rest with you now. Amen.", "doctrinal": "Therefore you also must be ready, for the Son of Man is coming at an hour you do not expect. Matthew 24:44", "daily_watchword": "For the day of the LORD is coming, it is near. Joel 2:1", "verses": ["Psalm 101", "Judges 1:17–2:23", "Luke 18:18–30"]}, "2026-08-20": {"prayer": "Creator, how wondrous it is that you, who made all that is, care enough about us to call us your children and choose to dwell among us! Thank you for claiming us and making each of us in your image. Amen.", "doctrinal": "But to all who received him, who believed in his name, he gave power to become children of God. John 1:12", "daily_watchword": "My dwelling place shall be over them, and I will be their God, and they shall be my people. Ezekiel 37:27", "verses": ["Psalm 102:1–11", "Judges 3", "Luke 18:31–43"]}, "2026-08-21": {"prayer": "Lord, thank you for joy and laughter in our lives! Please increase the joy we share, and open our hearts to share the joy that comes from receiving and sharing your love. Amen.", "doctrinal": "Rejoice with an indescribable and glorious joy, for you are receiving the outcome of your faith, the salvation of your souls. 1 Peter 1:8-9", "daily_watchword": "So the ransomed of the LORD shall return and come to Zion with rejoicing; everlasting joy shall be upon their heads; they shall obtain joy and gladness, and sorrow and sighing shall flee away. Isaiah 51:11", "verses": ["Psalm 102:12–22", "Judges 4", "Luke 19:1–10"]}, "2026-08-22": {"prayer": "God, who spoke creation into being, remind us that our words fall with great weight, impacting the world and affecting your children in varied ways. Help us use our words to praise you and heal your creation. Amen.", "doctrinal": "From the same mouth comes a blessing and a curse. My brothers and sisters, this ought not to be so. James 3:10", "daily_watchword": "My tongue will sing of your promise, for all your commandments are right. Psalm 119:172", "verses": ["Psalm 102:23–28", "Judges 5", "Luke 19:11–27"]}, "2026-08-23": {"prayer": "God, our most reliable provider, many of your children are experiencing hunger and thirst because of the greed of others. As a community of your followers, may we follow your example so that all of your children live in abundance instead of a manufactured wilderness. We pray this in your holy name. Amen.", "doctrinal": "For truly I tell you, whoever gives you a cup of water to drink because you bear the name of Christ will by no means lose the reward. Mark 9:41", "daily_watchword": "They did not thirst when he led them through the deserts; he made water flow for them from the rock. Isaiah 48:21", "verses": ["Isaiah 51:1-6", "Psalm 138", "Romans 12:1-8", "Matthew 16:13-20"], "weekly_watchword": "Watchword for the week — Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2", "special_remarks": ["Thirteenth Sunday after Pentecost"]}, "2026-08-24": {"prayer": "God of new things, remove the blinders of familiarity from our eyes so that we may see the wonderous works you are doing. May our joy in new things and new life have no end. Amen.", "doctrinal": "When they heard of the resurrection of the dead, some scoffed, but others said, “We will hear you again about this.” Acts 17:32", "daily_watchword": "From this time forward I tell you new things, hidden things that you have not known. Isaiah 48:6", "verses": ["Psalm 103:1–5", "Judges 6", "Luke 19:28–44"]}, "2026-08-25": {"prayer": "Lord, you are our constant and most generous friend. We weep and you hear us. We call to you and you hear us. Sometimes, simply sharing our burdens with you can bring comfort. May we find joy in your listening ear and in being your little lambs. Amen.", "doctrinal": "Until now you have not asked for anything in my name. Ask and you will receive, so that your joy may be complete. John 16:24", "daily_watchword": "I cry to God Most High, to God who fulfills his purpose for me. Psalm 57:2", "verses": ["Psalm 103:6–18", "Judges 7", "Luke 19:45–20:8"]}, "2026-08-26": {"prayer": "Lord, this world is a scary place. It can be dangerous business going out our doors. May our faith that your care and support will never leave us, help keep our feet under us as we follow where you lead. Amen.", "doctrinal": "I am not asking you to take them out of the world, but I ask you to protect them from the evil one. John 17:15", "daily_watchword": "“Because he loves me,” says the LORD, “I will rescue him.” Psalm 91:14 NIV", "verses": ["Psalm 103:19–22", "Judges 8", "Luke 20:9–19"]}, "2026-08-27": {"prayer": "God of abundance, thank you for claiming us as your own and for providing all we need. Grant us your generous and accepting spirit so that all our needs may be met in you, and none of your children go without. Amen.", "doctrinal": "And my God will fully satisfy every need of yours according to his riches in glory in Christ Jesus. Philippians 4:19", "daily_watchword": "My people shall be satisfied with my bounty, says the LORD. Jeremiah 31:14", "verses": ["Psalm 104:1–9", "Judges 9:1–33", "Luke 20:20–26"]}, "2026-08-28": {"prayer": "Restorer of all things, you make us better than new. When we are broken, help us lean upon your wholeness and be made well by your hands. May we look for the marks of your handiwork in the lives of others around us. Amen.", "doctrinal": "Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And the woman was made well from that moment. Matthew 9:22", "daily_watchword": "Plead my cause and redeem me; give me life according to your promise. Psalm 119:154", "verses": ["Psalm 104:10–18", "Judges 9:34–10:18", "Luke 20:27–40"]}, "2026-08-29": {"prayer": "Our world is full of uncertainties, but because you care and truly concern yourself with our wellbeing, God, our lives are made more resilient. Whatever our circumstances may be, guide us to find a connection with you so that we might endure hardships and appreciate your abundance. Amen.", "doctrinal": "I know what it is to have little, and I know what it is to have plenty. In any and all circumstances I have learned the secret of being well-fed and of going hungry, of having plenty and of being in need. I can do all things through him who strengthens me. Philippians 4:12-13", "daily_watchword": "As for me, I am poor and needy, but the Lord takes thought for me. Psalm 40:17", "verses": ["Psalm 104:19–23", "Judges 11:1–27", "Luke 20:41–21:4"]}, "2026-08-30": {"prayer": "Divine Chef, you nourish our spirits, minds, and bodies with your words and creation. Sometimes we forget to look around and notice the goodness you have set before us. May we fully join the meal, sharing it with all your people. Amen.", "doctrinal": "Therefore I urge you to take some food, for it will help you survive, for none of you will lose a hair from your heads. Acts 27:34", "daily_watchword": "The angel of the LORD came a second time, touched him, and said, “Get up and eat, or the journey will be too much for you.” 1 Kings 19:7", "verses": ["Jeremiah 15:15-21", "Psalm 26:1-8", "Romans 12:9-21", "Matthew 16:21-28"], "weekly_watchword": "Watchword for the week — Jesus said, “If any want to become my followers, let them deny themselves and take up their cross and follow me.” Matthew 16:24", "special_remarks": ["Fourteenth Sunday after Pentecost"]}, "2026-08-31": {"prayer": "Like an endless tide, Lord, you give and receive and give again. May we give, not out of indebtedness, but out of appreciation and admiration of your ways. May our gifts be shared with others as joyously as you bestow abundance on us. Amen.", "doctrinal": "For God loves a cheerful giver. 2 Corinthians 9:7", "daily_watchword": "Of all that you give me I will surely give one-tenth to you. Genesis 28:22", "verses": ["Psalm 104:24–30", "Judges 11:28–12:15", "Luke 21:5–28"]}, "2026-09-01": {"prayer": "Creator God, you formed us in the womb and built all things by your mighty hand. You stretched out the heavens and laid the earth’s foundation. As the true builder of all things, guide us to trust your design—build our lives upon your rock, that we may praise you now and forever. Amen.", "doctrinal": "For every house is built by someone, but the builder of all things is God. Hebrews 3:4", "daily_watchword": "Thus says the LORD, your Redeemer, who formed you in the womb: I am the LORD, who made all things, who alone stretched out the heavens, who by myself spread out the earth. Isaiah 44:24", "verses": ["Psalm 104:31–35", "Judges 13", "Luke 21:29–38"]}, "2026-09-02": {"prayer": "Loving God, you cherish and protect your people as the apple of your eye. You lift up the lowly and confound the mighty. Keep us in your care, strengthen our hearts in humility, and guide us in your steadfast love. Amen.", "doctrinal": "God chose what is low and despised in the world, things that are not, to abolish things that are. 1 Corinthians 1:28", "daily_watchword": "For thus said the LORD, “Truly, one who touches you touches the apple of my eye.” Zechariah 2:8", "verses": ["Psalm 105:1–7", "Judges 14,15", "Luke 22:1–13"]}, "2026-09-03": {"prayer": "Mighty Savior, who triumphs over death, you are our retreat and our stability. Through Christ, you have conquered darkness and given us eternal victory. Help our hearts to remain steadfast in faith, trusting in your unfailing love. We praise you forever. Amen.", "doctrinal": "Where, O death, is your victory? Where, O death, is your sting? But thanks be to God, who gives us the victory through our Lord Jesus Christ. 1 Corinthians 15:55,57", "daily_watchword": "But my eyes are fixed on you, Sovereign LORD; in you I take refuge—do not give me over to death. Psalm 141:8 NIV", "verses": ["Psalm 105:8–15", "Judges 16,17", "Luke 22:14–23"]}, "2026-09-04": {"prayer": "Creator God, from dawn to dusk, your name is worthy of all praise. You formed the heavens, the earth, and the waters deep. May our worship rise like the sun, declaring your glory in all creation, now and forever. Amen.", "doctrinal": "Worship him, who made heaven and earth, the sea and the springs of water. Revelation 14:7", "daily_watchword": "From the rising of the sun to its setting, the name of the LORD is to be praised. Psalm 113:3", "verses": ["Psalm 105:16–22", "Judges 18", "Luke 22:24–38"]}, "2026-09-05": {"prayer": "Lord, strengthen our hearts to remain firm in trials. Let our trust in you be deep and unshakable, not fleeting like shallow roots. Protect those who wait on you, and let deceit not prevail. Keep us faithful and grounded in you. Amen.", "doctrinal": "The ones on the rock are those who, when they hear the word, receive it with joy. But these have no root; they believe only for a while and in a time of testing fall away. Luke 8:13", "daily_watchword": "Do not let those who wait for you be put to shame; let them be ashamed who are wantonly treacherous. Psalm 25:3", "verses": ["Psalm 105:23–36", "Judges 19", "Luke 22:39–51"]}, "2026-09-06": {"prayer": "Omnipotent Savior, at times we need help to stand firm in the face of opposition. May the peace of your spirit, which you freely give to each of us, guide our faith, so we are not swayed by anxiety or reprimand. Grant us courage to remain steadfast always. Amen.", "doctrinal": "God did not give us a spirit of cowardice but rather a spirit of power and of love and of self- discipline. 2 Timothy 1:7", "daily_watchword": "Do not fear the reproach of others, and do not be dismayed when they revile you. Isaiah 51:7", "verses": ["Ezekiel 33:7-11", "Psalm 119:33-40", "Romans 13:8-14", "Matthew 18:15-20"], "weekly_watchword": "Watchword for the week — Give me understanding, O LORD, that I may keep your law and observe it with my whole heart. Psalm 119:34", "special_remarks": ["Fifteenth Sunday after Pentecost"]}, "2026-09-07": {"prayer": "Almighty Healer, you lift us up when we are weary, restoring life with your gentle touch. Speak your word of renewal over us today. Strengthen our steps, awaken our hearts, and fill us with praise. We bless your name, O God. Amen.", "doctrinal": "Taking her by the hand, he said to her, “Talitha koum,” which means, “Little girl, get up!” And immediately the girl stood up and began to walk about. Mark 5:41-42", "daily_watchword": "I will extol you, O LORD, for you have drawn me up. Psalm 30:1", "verses": ["Psalm 105:37–45", "Judges 20:1–31", "Luke 22:52–62"]}, "2026-09-08": {"prayer": "Faithful God, your steadfast love surrounds us, and your grace sustains us each day. We trust in your care and rejoice in your mercy. Bless your saints with your abiding presence, now and forever. In Jesus’ name, we give praise. Amen.", "doctrinal": "The grace of the Lord Jesus be with all the saints. Revelation 22:21", "daily_watchword": "Steadfast love surrounds those who trust in the LORD. Psalm 32:10", "verses": ["Psalm 106:1–5", "Judges 20:32–21:25", "Luke 22:63–71"]}, "2026-09-09": {"prayer": "Redeeming God, you turn curses into blessings and bring life from death. Through Christ’s sacrifice, we are freed and restored. Fill our hearts with joy and gratitude for your boundless love. May we live in the light of your redemption. Amen.", "doctrinal": "Christ redeemed us from the curse of the law by becoming a curse for us—for it is written, “Cursed is everyone who hangs on a tree.” Galatians 3:13", "daily_watchword": "Yet our God turned the curse into a blessing. Nehemiah 13:2", "verses": ["Psalm 106:6–12", "Ruth 1", "Luke 23:1–12"]}, "2026-09-10": {"prayer": "Lord, grant us patience and self-control, that we may reflect your peace in all we do. Strengthen our hearts to endure in faith, keeping your commandments with steadfast love. May we serve you humbly, holding fast to Jesus, our guide and strength. Amen.", "doctrinal": "Here is a call for the endurance of the saints, those who keep the commandments of God and hold fast to the faith of Jesus. Revelation 14:12", "daily_watchword": "One who is slow to anger is better than the mighty, and one whose temper is controlled than one who captures a city. Proverbs 16:32", "verses": ["Psalm 106:13–23", "Ruth 2,3", "Luke 23:13–31"]}, "2026-09-11": {"prayer": "Joyful God, we lift our voices in praise, rejoicing always in your goodness. Like David, may we worship you with all our might, singing and dancing in your presence. Fill our hearts with unshakable joy as we celebrate your endless love. Amen.", "doctrinal": "Rejoice always. 1 Thessalonians 5:16", "daily_watchword": "David and all Israel were dancing before God with all their might, with songs and lyres and harps and tambourines and cymbals and trumpets. 1 Chronicles 13:8", "verses": ["Psalm 106:24–31", "Ruth 4", "Luke 23:32–43"]}, "2026-09-12": {"prayer": "Lord, we thank you for the wonders we have seen and the ways you’ve revealed yourself to us. Help us to always remember your faithfulness and proclaim the truth of your resurrection, sharing the joy of seeing the Lord with all we meet. Amen.", "doctrinal": "Mary Magdalene went and announced to the disciples, “I have seen the Lord,” and she told them that he had said these things to her. John 20:18", "daily_watchword": "But take care and watch yourselves closely, so as neither to forget the things that your eyes have seen. Deuteronomy 4:9", "verses": ["Psalm 106:32–39", "1 Samuel 1:1–2:11", "Luke 23:44–56"]}, "2026-09-13": {"prayer": "Mighty God, our refuge in times of trouble, strengthen us to serve those in need with humble hearts. Let our faith be lived through love, caring for the oppressed and vulnerable, and by reflecting your mercy and justice in all we do. Amen.", "doctrinal": "Religion that is pure and undefiled before God the Father is this: to care for orphans and widows in their distress. James 1:27", "daily_watchword": "The LORD is a stronghold for the oppressed, a stronghold in times of trouble. Psalm 9:9", "verses": ["Genesis 50:15-21", "Psalm 103:(1-7),8-13", "Romans 14:1-12", "Matthew 18:21-35"], "weekly_watchword": "Watchword for the week — Bless the LORD, O my soul, and do not forget all his benefits. Psalm 103:2", "special_remarks": ["Sixteenth Sunday after Pentecost"]}, "2026-09-14": {"prayer": "Covenant-keeping God, your promises endure for all generations. You call us from near and far, shaping us as your people. Strengthen us to live out your mission with faith and love, sharing your grace and truth in all we do. Amen.", "doctrinal": "Peter said to the Israelites, “For the promise is for you, for your children, and for all who are far away, everyone whom the Lord our God calls to him.” Acts 2:39", "daily_watchword": "The days are surely coming, says the LORD, when I will make a new covenant with the house of Israel and the house of Judah. Jeremiah 31:31", "verses": ["Psalm 106:40–48", "1 Samuel 2:12–36", "Luke 24:1–12"]}, "2026-09-15": {"prayer": "Lord, in times of trial, help us to trust in your unwavering strength. May your Holy Spirit speak through us, guiding our words and hearts. Let us rest in your peace, knowing you are our refuge and our steadfast foundation. Amen.", "doctrinal": "When they bring you to trial and hand you over, do not worry beforehand about what you are to say, but say whatever is given you at that time, for it is not you who speak but the Holy Spirit. Mark 13:11", "daily_watchword": "The LORD will fight for you, and you have only to keep still. Exodus 14:14", "verses": ["Psalm 107:1–9", "1 Samuel 3,4", "Luke 24:13–27"]}, "2026-09-16": {"prayer": "† During a synodal conference in London, Jesus Christ was recognized as chief elder of the Brethren’s Church. The day is observed as a covenanting day for servants of the church.", "doctrinal": "Gracious God, we thank you for the beauty of creation, a reflection of your steadfast love. As we place our hope in you, lead us through the gate of Christ to salvation, trusting in your mercy and eternal care. Amen.", "daily_watchword": "I am the gate. Whoever enters by me will be saved. John 10:9", "verses": ["1 Samuel 5:1–7:1", "Luke 24:28–35", "Let your steadfast love, O LORD, be upon us, even as we hope in you. Psalm 33:22"], "special_remarks": ["Minister’s Covenant Day†", "Wednesday, September 16 — Psalm 107:10–16"]}, "2026-09-17": {"prayer": "Merciful God, in our darkest moments, we cry out to you. Hear our prayers as you heard those of your faithful people. Deliver us from captivity, strengthen our faith, and teach us to trust in your steadfast love. May our thanks be lifted in your name, always. Amen.", "doctrinal": "While Peter was kept in prison, the church prayed fervently to God for him. Acts 12:5", "daily_watchword": "Bring me out of prison, so that I may give thanks to your name. Psalm 142:7", "verses": ["Psalm 107:17–22", "1 Samuel 7:2–8:22", "Luke 24:36–53"]}, "2026-09-18": {"prayer": "Lord, help us listen closely to your words and remember them in times of trial. Like Peter, when we fail, may we turn to you with repentance. Guide us through our wilderness, and let your grace restore us with hope. Amen.", "doctrinal": "Then Peter remembered what Jesus had said: “Before the cock crows, you will deny me three times.” And he went out and wept bitterly. Matthew 26:75", "daily_watchword": "Thus shall you say to one another, among yourselves, “What has the LORD answered?” or “What has the LORD spoken?” Jeremiah 23:35", "verses": ["Psalm 107:23–32", "1 Samuel 9", "John 1:1–13"]}, "2026-09-19": {"prayer": "Merciful God, your love knows no bounds, and your grace is ever near. When we falter, Christ intercedes for us, bringing forgiveness and peace. Help us trust in your endless mercy and live in the light of your redeeming love. Amen.", "doctrinal": "But if anyone does sin, we have an advocate with the Father, Jesus Christ the righteous. 1 John 2:1", "daily_watchword": "For I will not continually accuse, nor will I always be angry. Isaiah 57:16", "verses": ["Psalm 107:33–43", "1 Samuel 10", "John 1:14–28"]}, "2026-09-20": {"prayer": "Mighty God, you are our salvation and our strength. We rejoice in your love and proclaim, “Great is the Lord!” Rescue us from all harm and lead us to your heavenly kingdom. To you be glory forever and ever. Amen.", "doctrinal": "The Lord will rescue me from every evil attack and save me for his heavenly kingdom. To him be the glory forever and ever. Amen. 2 Timothy 4:18", "daily_watchword": "May those who love your salvation say continually, “Great is the LORD!” Psalm 40:16", "verses": ["Jonah 3:10-4:11", "Psalm 145:1-8", "Philippians 1:21-30", "Matthew 20:1-16"], "weekly_watchword": "Watchword for the week — For to me, living is Christ and dying is gain. Philippians 1:21", "special_remarks": ["Seventeenth Sunday after Pentecost"]}, "2026-09-21": {"prayer": "Gracious Lord, we come with hearts full of gratitude, for you have heard our prayers and shown us your great mercy. May we rejoice together, proclaiming your goodness, and give thanks for your unfailing love. To you be all glory. Amen.", "doctrinal": "Her neighbors and relatives heard that the Lord had shown his great mercy to her, and they rejoiced with her. Luke 1:58", "daily_watchword": "The LORD has granted me the petition that I made to him. 1 Samuel 1:27", "verses": ["Psalm 108:1–5", "1 Samuel 11,12", "John 1:29–42"]}, "2026-09-22": {"prayer": "Generous God, we offer our gifts to you with joyful hearts, knowing that all we have is yours. Help us give freely and willingly, trusting that our offerings will further your kingdom and bring glory to your name. Amen.", "doctrinal": "He sold a field that belonged to him, then brought the money and laid it at the apostles’ feet. Acts 4:37", "daily_watchword": "These had given willingly, for with single mind they had offered freely to the LORD. 1 Chronicles 29:9", "verses": ["Psalm 108:6–13", "1 Samuel 13", "John 1:43–51"]}, "2026-09-23": {"prayer": "Gracious God, we lift our hearts in gratitude, remembering your countless blessings. Teach us to give thanks in all things, rejoicing in your goodness. May our lives reflect your love and grace, bringing glory to your name forever. Amen.", "doctrinal": "Give thanks to God the Father at all times and for everything in the name of our Lord Jesus Christ. Ephesians 5:20", "daily_watchword": "Bless the LORD, O my soul, and do not forget all his benefits. Psalm 103:2", "verses": ["Psalm 109:1–7", "1 Samuel 14:1–40", "John 2:1–11"]}, "2026-09-24": {"prayer": "Lord of restoration and salvation, renew us by your Spirit and rebuild what is broken. Gather all nations in praise before your throne, that every voice may proclaim your glory. May we stand in unity, rejoicing in your eternal grace. Amen.", "doctrinal": "There was a great multitude that no one could count, from every nation, from all tribes and peoples and languages. They cried out in a loud voice, saying, “Salvation belongs to our God who is seated on the throne and to the Lamb!” Revelation 7:9,10", "daily_watchword": "Then the nations that are left all around you shall know that I, the LORD, have rebuilt the ruined places and replanted that which was desolate. Ezekiel 36:36", "verses": ["Psalm 109:8–20", "1 Samuel 14:41–15:23", "John 2:12–25"]}, "2026-09-25": {"prayer": "Gracious Lord, our hearts rejoice in you! You are our God, our source of true happiness. Your generosity knows no bounds—it pours blessings upon all who call on you. May we always praise you with joyful hearts and grateful souls. Amen.", "doctrinal": "The same Lord is Lord of all and is generous to all who call on him. Romans 10:12", "daily_watchword": "Happy are the people whose God is the LORD. Psalm 144:15", "verses": ["Psalm 109:21–31", "1 Samuel 15:24–16:13", "John 3:1–15"]}, "2026-09-26": {"prayer": "Lord of all, your reign stretches to the ends of the earth, and your kingdom is our refuge. May your truth be proclaimed to every nation, and may all people recognize your power and love. Be our guide, now and forever. Amen.", "doctrinal": "And this good news of the kingdom will be proclaimed throughout the world, as a testimony to all the nations. Matthew 24:14", "daily_watchword": "His dominion shall be from sea to sea and from the river to the ends of the earth. Zechariah 9:10", "verses": ["Psalm 110", "1 Samuel 16:14–17:31", "John 3:16–26"]}, "2026-09-27": {"prayer": "Faithful God, you never cast us away but hold us close for your name’s sake. You have made your love known through Christ—let it dwell in us always. Fill our hearts with your light, that we may shine with your grace. Amen.", "doctrinal": "Jesus prayed, “I made your name known to them, and I will make it known, so that the love with which you have loved me may be in them and I in them.” John 17:26", "daily_watchword": "For the LORD will not cast away his people, for his great name’s sake. 1 Samuel 12:22", "verses": ["Ezekiel 18:1-4,25-32", "Psalm 25:1-9", "Philippians 2:1-13", "Matthew 21:23-32"], "weekly_watchword": "Watchword for the week — Let the same mind be in you that was in Christ Jesus. Philippians 2:5", "special_remarks": ["Eighteenth Sunday after Pentecost"]}, "2026-09-28": {"prayer": "Gracious Lord, you have called us and claimed us as your own, binding us to you in steadfast love and mercy. May we walk in righteousness, ever faithful to your will, rejoicing in the grace that chose us first. Amen.", "doctrinal": "You did not choose me, but I chose you. John 15:16", "daily_watchword": "And I will take you for my wife forever; I will take you for my wife in righteousness and in justice, in steadfast love and in mercy. Hosea 2:19", "verses": ["Psalm 111", "1 Samuel 17:32–58", "John 3:27–36"]}, "2026-09-29": {"prayer": "Almighty God, we bless your name forever! All wisdom, power, and glory belong to you. We rejoice in your majesty and give you thanks, for you reign in righteousness. May our hearts forever praise you, now and for all eternity. Amen.", "doctrinal": "Amen! Blessing and glory and wisdom and thanksgiving and honor and power and might be to our God forever and ever! Revelation 7:12", "daily_watchword": "Blessed be the name of God from age to age, for wisdom and power are his. Daniel 2:20", "verses": ["Psalm 112", "1 Samuel 18:1–19:7", "John 4:1–26"]}, "2026-09-30": {"prayer": "O God, you reveal yourself to all who seek you. Open our hearts to your presence, that we may recognize your voice and proclaim your truth. Fill us with your spirit, that we may follow the anointed one with faith and joy. Amen.", "doctrinal": "The woman said to him, “I know that Messiah is coming” (who is called Christ). “When he comes, he will proclaim all things to us.” Jesus said to her, “I am he, the one who is speaking to you.” John 4:25-26", "daily_watchword": "If you seek him, he will be found by you. 2 Chronicles 15:2", "verses": ["Psalm 113", "1 Samuel 19:8–20:17", "John 4:27–38"]}, "2026-10-01": {"prayer": "Saving God, we thank you for rescuing us. You save us from the troubles and trials that surround us each and every day. You even save us from ourselves and from our sins. May we continue to find in you peace and rest for our souls. Amen.", "doctrinal": "The Lord knows how to rescue the godly from trial. 2 Peter 2:9", "daily_watchword": "You who have made me see many troubles and calamities will revive me again. Psalm 71:20", "verses": ["Psalm 114", "1 Samuel 20:18–21:9", "John 4:39–42"]}, "2026-10-02": {"prayer": "Speak to us, Lord. Help us to hear, understand, and live your word. Allow us to build our lives on our strong foundation in Jesus Christ, today and every day. Amen.", "doctrinal": "Everyone, then, who hears these words of mine and acts on them will be like a wise man who built his house on rock. Matthew 7:24", "daily_watchword": "Speak, LORD, for your servant is listening. 1 Samuel 3:9", "verses": ["Psalm 115:1–8", "1 Samuel 21:10–22:23", "John 4:43–54"]}, "2026-10-03": {"prayer": "Creator God, you made us and gave us the ability to love. You formed us and gave us the power to speak. Let the love in our hearts and the words of our mouths bring honor and glory to you. Through Jesus Christ, our Lord. Amen.", "doctrinal": "It is not what goes into the mouth that defiles a person, but it is what comes out of the mouth that defiles. Matthew 15:11", "daily_watchword": "These people draw near with their mouths and honor me with their lips, while their hearts are far from me. Isaiah 29:13", "verses": ["Psalm 115:9–18", "1 Samuel 23", "John 5:1–15"]}, "2026-10-04": {"prayer": "We give glory to you, our God who saves us from our sins! Let all that we say and do be done for your glory as we show our thankfulness to you for all of the great things you do for us. May we unite with our fellow Christians from all over the world around your communion table. Amen.", "doctrinal": "So, whether you eat or drink or whatever you do, do everything for the glory of God. 1 Corinthians 10:31", "daily_watchword": "Stand up and bless the LORD your God from everlasting to everlasting. Blessed be your glorious name, which is exalted above all blessing and praise. Nehemiah 9:5", "verses": ["Isaiah 5:1-7", "Psalm 80:7-15", "Philippians 3:4b-14", "Matthew 21:33-46"], "weekly_watchword": "Watchword for the week — The stone that the builders rejected has become the chief cornerstone. This is the LORD’s doing; it is marvelous in our eyes. Psalm 118:22,23", "special_remarks": ["Nineteenth Sunday after Pentecost"]}, "2026-10-05": {"prayer": "O Lord, our Savior true, give us the courage to ask you for what we need. Give us the faith we need to always place our trust in you. Let your will be done for us. In the name of Jesus, we pray. Amen.", "doctrinal": "She said, “Yes, Lord, yet even the dogs eat the crumbs that fall from their masters’ table.” Then Jesus answered her, “Woman, great is your faith! Let it be done for you as you wish.” Matthew 15:27-28", "daily_watchword": "Let me take it upon myself to speak to my lord, I who am but dust and ashes. Genesis 18:27", "verses": ["Psalm 116:1–7", "1 Samuel 24:1–25:17", "John 5:16–30"]}, "2026-10-06": {"prayer": "O God, our Savior, we find life in you and from you and through you. Because you live, we live. Help us to share your life and salvation in all that we say and do. Amen.", "doctrinal": "Jesus said, “I live, you also will live.” John 14:19", "daily_watchword": "Do not let me be put to shame, for I take refuge in you. Psalm 25:20", "verses": ["Psalm 116:8–14", "1 Samuel 25:18–44", "John 5:31–47"]}, "2026-10-07": {"prayer": "God of justice, as we face the evils of the world that threaten us, give us the strength to overwhelm that evil with the good that comes from you and your love. Let us seek your kingdom every day. In Jesus’ name, we pray. Amen.", "doctrinal": "See that none of you repays evil for evil, but always seek to do good to one another and to all. 1 Thessalonians 5:15", "daily_watchword": "Seek good and not evil, that you may live. Amos 5:14", "verses": ["Psalm 116:15–19", "1 Samuel 26,27", "John 6:1–15"]}, "2026-10-08": {"prayer": "Lord, give us the patience that we need: patience to wait for you, patience to trust in you, and patience for our souls to be still and know that you are God. Amen.", "doctrinal": "The farmer waits for the precious crop from the earth, being patient with it until it receives the early and the late rains. James 5:7", "daily_watchword": "For there is still a vision for the appointed time. If it seems to tarry, wait for it. Habakkuk 2:3", "verses": ["Psalm 117", "1 Samuel 28,29", "John 6:16–24"]}, "2026-10-09": {"prayer": "Gracious Savior, through your life, suffering, death, and resurrection, we are forgiven. Thank you for interceding on our behalf and for removing our sin. In your precious name, we pray. Amen.", "doctrinal": "It is Christ who died, or rather, who was raised, who is also at the right hand of God, who also intercedes for us. Romans 8:34", "daily_watchword": "It is the Lord God who helps me; who will declare me guilty? Isaiah 50:9", "verses": ["Psalm 118:1–9", "1 Samuel 30,31", "John 6:25–42"]}, "2026-10-10": {"prayer": "Lord of the winds and the seas, help us to know you for who you are. Use the power of your love and grace to quiet the storms that surround us and threaten to sink us. May we find peace and calm in you. Amen.", "doctrinal": "They said to one another, “Who then is this, that even the wind and the sea obey him?” Mark 4:41", "daily_watchword": "Is the LORD’s arm too short? Numbers 11:23 NIV", "verses": ["Psalm 118:10–14", "2 Samuel 1", "John 6:43–51"]}, "2026-10-11": {"prayer": "Lord and God, help us to have faith in you. Even though we can’t see you, allow our unbelief to be vanquished by your glory and might. We pray in the name of our crucified and risen Savior, Jesus Christ. Amen.", "doctrinal": "Thomas answered [Jesus], “My Lord and my God!” John 20:28", "daily_watchword": "Gideon said to them, “I will not rule over you, and my son will not rule over you; the LORD will rule over you.” Judges 8:23", "verses": ["Isaiah 25:1-9", "Psalm 23", "Philippians 4:1-9", "Matthew 22:1-14"], "weekly_watchword": "Watchword for the week — O LORD, you are my God; I will exalt you, I will praise your name; for you have done wonderful things. Isaiah 25:1", "special_remarks": ["Twentieth Sunday after Pentecost"]}, "2026-10-12": {"prayer": "Everlasting God, as we remember all that you have done for us, we see how you have blessed us from generation to generation. May our faith in your mercy be stronger than our fears, so that we may serve you boldly. Amen.", "doctrinal": "Mary said, “Indeed, his mercy is for those who fear him from generation to generation.” Luke 1:50", "daily_watchword": "I remember the days of old; I think about all your deeds; I meditate on the works of your hands. Psalm 143:5", "verses": ["Psalm 118:15–21", "2 Samuel 2", "John 6:52–59"]}, "2026-10-13": {"prayer": "Lord, you call us to follow you. As we answer your call, help us to leave behind everything that gets in the way of fully and faithfully following you. In Jesus’ name, we pray. Amen.", "doctrinal": "After this he went out and saw a tax collector named Levi sitting at the tax-collection station, and he said to him, “Follow me.” And he got up, left everything, and followed him. Luke 5:27-28", "daily_watchword": "Therefore we also will serve the LORD, for he is our God. Joshua 24:18", "verses": ["Psalm 118:22–29", "2 Samuel 3:1–34", "John 6:60–71"]}, "2026-10-14": {"prayer": "Christ Jesus, you invite us to your table—no matter how broken and damaged we feel we are. Give us the courage to invite all, no matter how broken and damaged we may think they are, to join us at your great feast, secure in the knowledge that we will be blessed by your presence among us. In the name of our welcoming savior, we pray. Amen.", "doctrinal": "Jesus said, “But when you give a banquet, invite the poor, the crippled, the lame, and the blind. And you will be blessed because they cannot repay you.” Luke 14:13-14", "daily_watchword": "Light dawns for the righteous and joy for the upright in heart. Psalm 97:11", "verses": ["Psalm 119:1–8", "2 Samuel 3:35–5:16", "John 7:1–13"]}, "2026-10-15": {"prayer": "Lord, we thank you for entering our world and our lives. Let us continue to hear your knock on our door so that we may open it to allow you in. May we join you, gracious Savior, at the table you set before us, to quench our thirsty souls and fill our lives with good gifts. Amen.", "doctrinal": "Listen! I am standing at the door, knocking; if you hear my voice and open the door, I will come in and eat with you, and you with me. Revelation 3:20", "daily_watchword": "The LORD is good to those who wait for him, to the soul that seeks him. Lamentations 3:25", "verses": ["Psalm 119:9–16", "2 Samuel 5:17–6:23", "John 7:14–24"]}, "2026-10-16": {"prayer": "God of salvation, you are the place where love and faithfulness meet. In you and your love, righteousness and peace kiss each other. Fill our hearts with your love and faithfulness. Fill our lives with your righteousness and peace. Through Jesus Christ, our Lord. Amen.", "doctrinal": "The fruit of the light is found in all that is good and right and true. Ephesians 5:9", "daily_watchword": "Surely his salvation is at hand for those who fear him. Steadfast love and faithfulness will meet; righteousness and peace will kiss each other. Psalm 85:9,10", "verses": ["Psalm 119:17–24", "2 Samuel 7", "John 7:25–44"]}, "2026-10-17": {"prayer": "Lord God, we are bearing heavy burdens. Give us the strength we need to help one another carry the weight, so that we may fulfill Christ’s law as we seek to give you all praise and glory. Amen.", "doctrinal": "Bear one another’s burdens, and in this way you will fulfill the law of Christ. Galatians 6:2", "daily_watchword": "Do what is just and right. Rescue from the hand of the oppressor the one who has been robbed. Do no wrong or violence to the foreigner, the fatherless or the widow, and do not shed innocent blood in this place. Jeremiah 22:3 NIV", "verses": ["Psalm 119:25–32", "2 Samuel 8,9", "John 7:45–52"]}, "2026-10-18": {"prayer": "Lord God of hosts, make our churches and homes be houses of prayer. As we offer you our prayers and praises, may we prosper in faith, hope, and love. In Jesus’ name, we pray. Amen.", "doctrinal": "He [Jesus] was teaching and said, “Is it not written, ‘My house shall be called a house of prayer for all the nations?’” Mark 11:17", "daily_watchword": "In this place I will give prosperity, says the LORD of hosts. Haggai 2:9", "verses": ["Isaiah 45:1-7", "Psalm 96:1-9,(10-13)", "1 Thessalonians 1:1-10", "Matthew 22:15-22"], "weekly_watchword": "Watchword for the week — Sing to the LORD, bless his name; tell of his salvation from day to day. Psalm 96:2", "special_remarks": ["Twenty-first Sunday after Pentecost"]}, "2026-10-19": {"prayer": "Almighty King, give us the messages of your love and mercy that you want us to share with the world. Empower us always to be persistent in taking your message to the very ends of the earth. In the blessed name of Jesus, we pray. Amen.", "doctrinal": "Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage with the utmost patience in teaching. 2 Timothy 4:2", "daily_watchword": "For the lips of a priest should guard knowledge, and people should seek instruction from his mouth, for he is the messenger of the LORD of hosts. Malachi 2:7", "verses": ["Psalm 119:33–40", "2 Samuel 10,11", "John 8:1–11"]}, "2026-10-20": {"prayer": "God, we know you and you call us to proclaim your message to every people, tongue, and nation. Give us the words we need to speak your love throughout all the world, so that there will be no more offerings given to an unknown god. Amen.", "doctrinal": "Paul said, “For as I went through the city and looked carefully at the objects of your worship, I found among them an altar with the inscription, ‘To an unknown god.’ What therefore you worship as unknown, this I proclaim to you.” Acts 17:23", "daily_watchword": "They have made for themselves gods of gold. But now, if you will only forgive their sin. Exodus 32:31-32", "verses": ["Psalm 119:41–48", "2 Samuel 12", "John 8:12–30"]}, "2026-10-21": {"prayer": "Jesus, you are our daily bread. Allow us to feast and live on your word and your truth each and every day of our lives, until you call us into the heavenly place above. We pray in our savior’s name. Amen.", "doctrinal": "Give us today our daily bread. Matthew 6:11", "daily_watchword": "The LORD will guide you continually and satisfy your needs in parched places. Isaiah 58:11", "verses": ["Psalm 119:49–56", "2 Samuel 13:1–33", "John 8:31–41"]}, "2026-10-22": {"prayer": "Good Shepherd, you made us and we are yours. You know us and you call us by name. Help us to know you so that we may assist you in bringing your lost sheep home. Amen.", "doctrinal": "I am the good shepherd. I know my own, and my own know me. John 10:14", "daily_watchword": "It is he who made us, and we are his; we are his people and the sheep of his pasture. Psalm 100:3", "verses": ["Psalm 119:57–64", "2 Samuel 13:34–14:33", "John 8:42–59"]}, "2026-10-23": {"prayer": "Morning Star of our faith and life, you came and fulfilled the words of the prophets. As you now reign in highest heaven, continue to deal with us wisely and execute justice and righteousness in our land. In Jesus’ name, we pray. Amen.", "doctrinal": "Simon Peter answered, “You are the Messiah, the Son of the living God.” Matthew 16:16", "daily_watchword": "The days are surely coming, says the LORD, when I will raise up for David a righteous Branch, and he shall reign as king and deal wisely and shall execute justice and righteousness in the land. Jeremiah 23:5", "verses": ["Psalm 119:65–72", "2 Samuel 15:1–29", "John 9:1–12"]}, "2026-10-24": {"prayer": "God of unity, give us courage to look at our fellow citizens, not as foreigners or strangers, but as our brothers and sisters, so that we can unite in your household. Let all of the earth see your salvation in us and through us. We pray as one. Amen.", "doctrinal": "Consequently, you are no longer foreigners and strangers, but fellow citizens with God’s people and also members of his household. Ephesians 2:19 NIV", "daily_watchword": "The LORD has bared his holy arm before the eyes of all the nations, and all the ends of the earth shall see the salvation of our God. Isaiah 52:10", "verses": ["Psalm 119:73–80", "2 Samuel 15:30–16:23", "John 9:13–34"]}, "2026-10-25": {"prayer": "Gracious God, you show us your love in the life, sufferings, death, and resurrection of your son. Thank you for rescuing us from the power of darkness and bringing us safely to the light of your kingdom. In the name of Jesus, we pray. Amen.", "doctrinal": "He has rescued us from the power of darkness and transferred us into the kingdom of his beloved son. Colossians 1:13", "daily_watchword": "Because your steadfast love is better than life. Psalm 63:3", "verses": ["Leviticus 19:1-2,15-18", "Psalm 1", "1 Thessalonians 2:1-8", "Matthew 22:34-46"], "weekly_watchword": "Watchword for the week — You shall be holy, for I the LORD your God am holy. Leviticus 19:2", "special_remarks": ["Twenty-second Sunday after Pentecost"]}, "2026-10-26": {"prayer": "Kind God and loving Savior, lead us to repent our sins. We know that we fall short of your glory. We know that we too often fail to live as who we truly are, your beloved children. Forgive us, we pray. Amen.", "doctrinal": "Do you not realize that God’s kindness is meant to lead you to repentance? Romans 2:4", "daily_watchword": "But of you I will not make an end. I will chastise you in just measure, and I will by no means leave you unpunished. Jeremiah 30:11", "verses": ["Psalm 119:81–88", "2 Samuel 17", "John 9:35–41"]}, "2026-10-27": {"prayer": "Savior, let us follow your example to show no partiality. Keep us bound together with cords that cannot be broken. Bind us together with all our brothers and sisters in Christ in the great fellowship of your love. Amen.", "doctrinal": "Then Peter began to speak to them: “I truly understand that God shows no partiality, but in every people anyone who fears him and practices righteousness is acceptable to him.” Acts 10:34-35", "daily_watchword": "Rise up, O God, judge the earth, for all the nations belong to you! Psalm 82:8", "verses": ["Psalm 119:89–96", "2 Samuel 18:1–30", "John 10:1–10"]}, "2026-10-28": {"prayer": "Living Savior, you are with us today, and you can set us free from our ailments. Place your hands of mercy upon us and heal us so that we may stand up straight and praise you. Amen.", "doctrinal": "When Jesus saw her, he called her over and said, “Woman, you are set free from your ailment.” When he laid his hands on her, immediately she stood up straight and began praising God. Luke 13:12-13", "daily_watchword": "Bless the LORD, who redeems your life from the Pit, who crowns you with steadfast love and mercy. Psalm 103:2,4", "verses": ["Psalm 119:97–104", "2 Samuel 18:31–19:30", "John 10:11–21"]}, "2026-10-29": {"prayer": "Lord Jesus, you call us just as you called Simon and Andrew to follow you. Fill us with the courage that they showed and allow us to leave behind everything that is holding us back from following you. This world is full of people who need to know you. Help us to find them and bring them to you. Amen.", "doctrinal": "And Jesus said to Simon and Andrew, “Follow me, and I will make you fishers of people.” Mark 1:17", "daily_watchword": "Samuel said to Saul, “Stop here yourself for a while, that I may make known to you the word of God.” 1 Samuel 9:27", "verses": ["Psalm 119:105–112", "2 Samuel 19:31–20:26", "John 10:22–33"]}, "2026-10-30": {"prayer": "Prince of peace, may this and every generation magnify you by sharing your love, your grace, and your mercy to the ends of the earth. As we have received the gift of salvation through you, may we never ignore our call to share you with others. Amen.", "doctrinal": "And Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior, for he has looked with favor on the lowly state of his servant.” Luke 1:46-48", "daily_watchword": "He raises up the poor from the dust. 1 Samuel 2:8", "verses": ["Psalm 119:113–120", "2 Samuel 21", "John 10:34–42"]}, "2026-10-31": {"prayer": "We praise you, Lord! We praise you! For our pardon, we praise you. For our redemption, we praise you. For the gift of your grace in Jesus Christ, we praise you! Amen.", "doctrinal": "They are now justified by his grace as a gift, through the redemption that is in Christ Jesus. Romans 3:24", "daily_watchword": "Treasures gained by wickedness do not profit, but righteousness delivers from death. Proverbs 10:2", "verses": ["Psalm 119:121–128", "2 Samuel 22:1–25", "John 11:1–16"]}, "2026-11-01": {"prayer": "Great and gracious One, on this day, we remember your saints from all corners of the globe. Help us live lives that honor their deeds, sacrifices, and love for you as your witnesses in the world. In your name, we pray. Amen.", "doctrinal": "You will be my witnesses in Jerusalem, in all Judea and Samaria, and to the ends of the earth. Acts 1:8", "daily_watchword": "For now he shall be great to the ends of the earth. Micah 5:4", "verses": ["Micah 3:5-12", "Psalm 43", "1 Thessalonians 2:9-13", "Matthew 23:1-12"], "weekly_watchword": "Watchword for the week — O send out your light and your truth; let them lead me. Psalm 43:3", "special_remarks": ["All Saints Day", "Twenty-third Sunday after Pentecost", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10", "All Saints Day — Revelation 7:9-17; Psalm 34:1-10,22", "1 John 3:1-3; Matthew 5:1-12"]}, "2026-11-02": {"prayer": "Merciful Judge, you know our faults and foibles, yet love us without fail. Lead us in ways that help us live lives of goodness and service, so that when we face that final judgement day, we will be deemed worthy to join you in heaven. Amen.", "doctrinal": "Because he has fixed a day on which he will have the world judged in righteousness by a man whom he has appointed, and of this he has given assurance to all by raising him from the dead. Acts 17:31", "daily_watchword": "The LORD judges the peoples. Psalm 7:8", "verses": ["Psalm 119:129–136", "2 Samuel 22:26–23:17", "John 11:17–30"]}, "2026-11-03": {"prayer": "Everlasting Creator, thank you for the glorious world that you brought into being. Each day, help us recognize the beauty around us, and teach us to care for all that comes from you. In your loving name, we pray. Amen.", "doctrinal": "For from him and through him and to him are all things. To him be the glory forever. Amen. Romans 11:36", "daily_watchword": "Have you not known? Have you not heard? The LORD is the everlasting God, the Creator of the ends of the earth. He does not faint or grow weary; his understanding is unsearchable. Isaiah 40:28", "verses": ["Psalm 119:137–144", "2 Samuel 23:18–24:25", "John 11:31–44"]}, "2026-11-04": {"prayer": "Loving Comforter, thank you for being the source of joy in this troubled world. Although our lives know pain and discomfort, we live in the hope of seeing you again, when the hurts of today will be erased by the joy of eternity with you. In your name, we pray. Amen.", "doctrinal": "So you have pain now, but I will see you again, and your hearts will rejoice, and no one will take your joy from you. John 16:22", "daily_watchword": "The LORD will again comfort Zion. Zechariah 1:17", "verses": ["Psalm 119:145–152", "1 Kings 1:1–27", "John 11:45–57"]}, "2026-11-05": {"prayer": "Guarding Shepherd, your flock knows the strength and love you provide. Your steadfast presence brings us sustenance and hope, even when we go astray. Feed and protect us, so we may do the same to help the hungry around us. Amen.", "doctrinal": "No one will snatch them out of my hand. John 10:28", "daily_watchword": "And he shall stand and feed his flock in the strength of the LORD. Micah 5:4", "verses": ["Psalm 119:153–160", "1 Kings 1:28–53", "John 12:1–11"]}, "2026-11-06": {"prayer": "Generous Provider, we hunger for more than food for our bellies. We long to be filled with your love, to taste your forgiveness, and to share in your bounty, while heeding your call to feed your sheep. Feed us, we pray. Amen.", "doctrinal": "For I was hungry and you gave me food. Matthew 25:35", "daily_watchword": "Share your bread with the hungry. Isaiah 58:7", "verses": ["Psalm 119:161–168", "1 Kings 2:1–38", "John 12:12–19"]}, "2026-11-07": {"prayer": "Lord, wind and fire and earthquake can bring devastation and loss. But your words and actions, when likened to wind and flame and tremor, help us understand the greatness of your power and know of your creating strength. Amen.", "doctrinal": "And suddenly there was a great earthquake, for an angel of the Lord, descending from heaven, came and rolled back the stone and sat on it. Matthew 28:2", "daily_watchword": "You make the winds your messengers, fire and flame your ministers. Psalm 104:4", "verses": ["Psalm 119:169–176", "1 Kings 2:39–3:28", "John 12:20–36"]}, "2026-11-08": {"prayer": "Unifying Spirit, we live in a world filled with strife, separation, and discontent. We long for peace and tranquility. Help us to join your followers from many faiths and traditions to work for the unity and peace we long for through you. Amen.", "doctrinal": "Make every effort to maintain the unity of the Spirit in the bond of peace. Ephesians 4:3", "daily_watchword": "Then Abram said to Lot, “Let there be no strife between you and me and between your herders and my herders, for we are kindred.” Genesis 13:8", "verses": ["Amos 5:18-24", "Psalm 70", "1 Thessalonians 4:13-18", "Matthew 25:1-13"], "weekly_watchword": "Watchword for the week — Keep awake therefore, for you know neither the day nor the hour. Matthew 25:13", "special_remarks": ["Twenty-fourth Sunday after Pentecost"]}, "2026-11-09": {"prayer": "Forgiving God, you know the depths of our hearts and souls. We are imperfect beings; you see our sins, secret to ourselves and hidden from others, yet your light shines through to brighten the path to you. May we always choose the light. Amen.", "doctrinal": "Whenever our hearts condemn us, for God is greater than our hearts, and he knows everything. 1 John 3:20", "daily_watchword": "You have set our iniquities before you, our secret sins in the light of your countenance. Psalm 90:8", "verses": ["Psalm 120", "1 Kings 4:1–28", "John 12:37–50"]}, "2026-11-10": {"prayer": "Protecting Spirit, some days find us concerned with the weights of the world—disasters, politics, war, and suffering. Yet with our faith in you, we can face those weights with courage and strength, knowing that your spirit is there to guide us, protect us and fill us with joy. Amen.", "doctrinal": "And the disciples were filled with joy and with the Holy Spirit. Acts 13:52", "daily_watchword": "Be strong, and let your heart take courage, all you who wait for the LORD. Psalm 31:24", "verses": ["Psalm 121", "1 Kings 4:29–5:18", "John 13:1–17"]}, "2026-11-11": {"prayer": "Listening God, our hearts are ever searching and hopeful. We come to you each day with our prayers and supplications as your word invites us to ask, seek, knock, and look to you. Hear us, guide us, teach us, and open the door to your power and love. Amen.", "doctrinal": "For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Matthew 7:8", "daily_watchword": "But as for me, I will look to the LORD; I will wait for the God of my salvation; my God will hear me. Micah 7:7", "verses": ["Psalm 122", "1 Kings 6", "John 13:18–30"]}, "2026-11-12": {"prayer": "Heavenly Host, thank you for the gift of your word each day. Teach us the ways of forgiveness, care, reconciliation, and hope. Prepare our hearts for worship and invite our brothers and sisters into your house so that we may praise your goodness and love together. With hope, we pray. Amen.", "doctrinal": "First be reconciled to your brother or sister, and then come and offer your gift. Matthew 5:24", "daily_watchword": "Guard your steps when you go to the house of God; to draw near to listen is better. Ecclesiastes 5:1", "verses": ["Psalm 123", "1 Kings 7:1–33", "John 13:31–38"]}, "2026-11-13": {"prayer": "† On this day, in 1741, it was announced in all Moravian congregations that Jesus Christ had been chosen Chief Elder of the Moravian Church. The Moravian Church has had no single human chief executive since then, and now observes this as a festival day.", "doctrinal": "Chief Elder, on this day nearly three centuries ago, our forebears saw the wisdom of naming you as the head of our church. We look to your leadership to guide us as we share your good news throughout the world. We pray that we can remain worthy to be your disciples forever. Amen.", "daily_watchword": "He [Jesus] said to them, “Why were you searching for me? Did you not know that I must be in my Father’s house?” Luke 2:49", "verses": ["1 Kings 7:34–8:16", "John 14:1–14", "Your eyes may be open night and day toward this house, the place of which you said, “My name shall be there.” 1 Kings 8:29"], "special_remarks": ["Chief Elder Festival", "Chief Elder Festival† — Ezekiel 34:11-16,23-24; Psalm 8", "Hebrews 4:14-16, John 10:1-10", "Friday, November 13 — Psalm 124"]}, "2026-11-14": {"prayer": "Living God, many generations of believers have brought us to this day. Thank you for sending us your son and for filling our ancestors with your love and hope, so that they could teach us your ways and bring us to you. In your name, we pray. Amen.", "doctrinal": "And we bring you the good news that what God promised to our ancestors he has fulfilled for us, their children, by raising Jesus. Acts 13:32-33", "daily_watchword": "The LORD our God be with us, as he was with our ancestors. 1 Kings 8:57", "verses": ["Psalm 125", "1 Kings 8:17–53", "John 14:15–24"]}, "2026-11-15": {"prayer": "Heavenly Light, we know there is darkness and evil in this world. We see sadness, hopelessness, anger, deceit, and pain all around us. Yet, our faith in you can erase our fear and despair. We are forever grateful for the hope, love, and outstretched arms you offer. We praise you for your protective spirit. Amen.", "doctrinal": "The gates of Hades will not prevail against it. Matthew 16:18", "daily_watchword": "They shall live in safety, and no one shall make them afraid. Ezekiel 34:28", "verses": ["Zephaniah 1:7,12-18", "Psalm 90:1-8,(9-11),12", "1 Thessalonians 5:1-11", "Matthew 25:14-30"], "weekly_watchword": "Watchword for the week — So teach us, O LORD, to count our days that we may gain a wise heart. Psalm 90:12", "special_remarks": ["Twenty-fifth Sunday after Pentecost"]}, "2026-11-16": {"prayer": "Glorious King, you reign supreme above all. We hear your voice in the cry of a newborn, the laughter of a child, the song of youth, and the stories of elders. Help us, your followers, to share that voice and the love it brings throughout the world. Amen.", "doctrinal": "Then he said, “The God of our ancestors has chosen you to know his will, to see the righteous one, and to hear his own voice, for you will be his witness to all the world of what you have seen and heard.” Acts 22:14-15", "daily_watchword": "Who would not fear you, O King of the nations? For that is your due. Jeremiah 10:7", "verses": ["Psalm 126", "1 Kings 8:54–9:19", "John 14:25–15:8"]}, "2026-11-17": {"prayer": "Lamb of God, you take away the sins of the world. Happy are we who are called to your table. You help us bear our burdens, you forgive our sins, you make us whole. May we prove worthy of your sacrifice that offers us all the chance for salvation. In your holy name, we pray. Amen.", "doctrinal": "The next day he saw Jesus coming toward him and declared, “Here is the Lamb of God who takes away the sin of the world!” John 1:29", "daily_watchword": "He bore the sin of many and made intercession for the transgressors. Isaiah 53:12", "verses": ["Psalm 127", "1 Kings 9:20–10:29", "John 15:9–17"]}, "2026-11-18": {"prayer": "Forgiving God, we are sinners. In ways large and small, we stray from your path. Yet, with contrition and confession, we bare our souls and seek your forgiveness. Be our strength as we seek to live righteous, helpful, fruitful, and holy lives. Amen.", "doctrinal": "Therefore, I tell you, her many sins have been forgiven; hence she has shown great love. But the one to whom little is forgiven loves little. Luke 7:47", "daily_watchword": "I love you, O LORD, my strength. Psalm 18:1", "verses": ["Psalm 128", "1 Kings 11:1–25", "John 15:18–16:4"]}, "2026-11-19": {"prayer": "Merciful Parent, cleanse us and bring us close. In faith, we see your power to lift us. In love, we see the great gift of your son. In hope, we long to be yours. We are your people; bless us and welcome us into your family. Amen.", "doctrinal": "But God, who is rich in mercy, out of the great love with which he loved us even when we were dead through our trespasses, made us alive together with Christ. Ephesians 2:4-5", "daily_watchword": "I will save them from all the apostasies into which they have fallen and will cleanse them. Then they shall be my people. Ezekiel 37:23", "verses": ["Psalm 129", "1 Kings 11:26–12:24", "John 16:5–16"]}, "2026-11-20": {"prayer": "Heavenly Teacher, thank you for your words that give us the strength of faith. Send us into the world to speak your truth, to share your hope and lift up those who need your love. Through you, we can strengthen all the world. Amen.", "doctrinal": "Jesus said to Simon Peter, “I have prayed for you that your own faith may not fail, and you, when once you have turned back, strengthen your brothers.” Luke 22:32", "daily_watchword": "Now go, and I will be with your mouth and teach you what you are to speak. Exodus 4:12", "verses": ["Psalm 130", "1 Kings 12:25–13:22", "John 16:17–33"]}, "2026-11-21": {"prayer": "Inspiring God, you bring life and vibrancy to your people. Through your word, we learn your ways, your instruction and your hopes for us. May we hear your voice every day, take comfort in its loving power, and use it to guide our work in this world. Amen.", "doctrinal": "Indeed, the word of God is living and active and sharper than any two-edged sword, piercing until it divides soul from spirit, joints from marrow; it is able to judge the thoughts and intentions of the heart. Hebrews 4:12", "daily_watchword": "It shall not return to me empty, but it shall accomplish that which I purpose and succeed in the thing for which I sent it. Isaiah 55:11", "verses": ["Psalm 131", "1 Kings 13:23–14:20", "John 17:1–19"]}, "2026-11-22": {"prayer": "Lamb of God, today we celebrate your lordship over all. As we prepare for the season of Advent, fill our hearts with the spirit of life, and nurture our faith with love. Help us take your word into the world to bear fruit for your kin(g)dom. Amen.", "doctrinal": "But as for that in the good soil, these are the ones who, when they hear the word, hold it fast in an honest and good heart and bear fruit with endurance. Luke 8:15", "daily_watchword": "For as the rain and the snow come down from heaven and do not return there until they have watered the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater, so shall my word be that goes out from my mouth. Isaiah 55:10-11", "verses": ["Ezekiel 34:11-16,20-24", "Psalm 95:1-7a", "Ephesians 1:15-23", "Matthew 25:31-46"], "weekly_watchword": "Watchword for the week — God says, “I will seek the lost, and I will bring back the strayed, and I will bind up the injured, and I will strengthen the weak.” Ezekiel 34:16", "special_remarks": ["Reign of Christ Sunday"]}, "2026-11-23": {"prayer": "Creator God, the beauty of this world inspires us to follow the one who made it all. Give us the strength and will to protect our planet and all that you created. Give us voices to praise you, the source of creation’s abundance. Amen.", "doctrinal": "Then I heard every creature in heaven and on earth and under the earth and in the sea and all that is in them, singing, “To the one seated on the throne and to the Lamb be blessing and honor and glory and might forever and ever!” Revelation 5:13", "daily_watchword": "And Ezra said, “You are the LORD, you alone; you have made heaven, the heaven of heavens, with all their host, the earth and all that is on it, the seas and all that is in them.” Nehemiah 9:6", "verses": ["Psalm 132", "1 Kings 14:21–15:8", "John 17:20–26"]}, "2026-11-24": {"prayer": "Forgiving God, we know our world is filled with evil, anger, and strife. Pointing fingers, raised voices, uncaring deeds, and thoughtless hate surround us. Yet, by following your call to turn away from anger, may we bless our persecutors and work for peace. Help us work for a world filled with faith, love, and hope. Amen.", "doctrinal": "Bless those who persecute you; bless and do not curse them. Romans 12:14", "daily_watchword": "You shall not follow a majority in wrongdoing. Exodus 23:2", "verses": ["Psalm 133", "1 Kings 15:9–16:14", "John 18:1–11"]}, "2026-11-25": {"prayer": "Loving God, you teach us that love is your greatest commandment. Too often we overlook the power of love that can heal our broken world. Help us to always keep love in our hearts and share its awesome power with friend, stranger, and enemy alike. In your name, we pray. Amen.", "doctrinal": "This is my commandment, that you love one another as I have loved you. John 15:12", "daily_watchword": "I shall walk at liberty, for I have sought your precepts. Psalm 119:45", "verses": ["Psalm 134", "1 Kings 16:15–17:24", "John 18:12–24"]}, "2026-11-26": {"prayer": "Patient Sustainer, too often our pride can close our eyes and cover our ears to signs of your love. Help us to set that pride aside, opening us to recognize your still, strong voice and guidance. We will humbly walk with you, giving you thanks and praising your name. Amen.", "doctrinal": "Continue to walk in him, abounding in thanksgiving. Colossians 2:6-7", "daily_watchword": "In those days Hezekiah became sick and was at the point of death. He prayed to the LORD, and he answered him and gave him a sign. But Hezekiah did not respond according to the benefit done to him, for his heart was proud. 2 Chronicles 32:24-25", "verses": ["Psalm 135:1–12", "1 Kings 18", "John 18:25–40"]}, "2026-11-27": {"prayer": "Brightest Lamp, your light is the beacon by which we see the beauty of our lives. Thank you for always shining your light on us, expelling the darkness and giving us hope. May we carry your brightness in our hearts and share it with the world. Amen.", "doctrinal": "In him was life, and the life was the light of all people. John 1:4", "daily_watchword": "Indeed, you are my lamp, O LORD; the LORD lightens my darkness. 2 Samuel 22:29", "verses": ["Psalm 135:13–21", "1 Kings 19", "John 19:1–11"]}, "2026-11-28": {"prayer": "Loving God, we know all glory and honor is yours. Help us as we strive to be your messengers of peace, your deliverers of good news and your preachers of salvation. We sing of your glory in the highest heaven, and hope for the peace that your glory brings. In your name, we pray. Amen.", "doctrinal": "Glory to God in the highest heaven, and on earth peace among those whom he favors! Luke 2:14", "daily_watchword": "How beautiful upon the mountains are the feet of the messenger who announces peace, who brings good news, who announces salvation, who says to Zion, “Your God reigns.” Isaiah 52:7", "verses": ["Psalm 136", "1 Kings 20:1–21", "John 19:12–24"]}, "2026-11-29": {"prayer": "Redeeming God, we feel your guiding hand strengthening us as we journey through this bright season of Advent. Show us the way to encourage all to prepare for your coming, and give us the tools to build up your kingdom here on earth. In your name, we pray. Amen.", "doctrinal": "Therefore encourage one another and build up each other, as indeed you are doing. 1 Thessalonians 5:11", "daily_watchword": "Saul’s son Jonathan set out and came to David at Horesh; there he strengthened his hand through the LORD. 1 Samuel 23:16", "verses": ["Isaiah 64:1-9", "Psalm 80:1-7,17-19", "1 Corinthians 1:3-9", "Mark 13:24-37"], "weekly_watchword": "Watchword for the week — Then they will see “the Son of Man coming in clouds” with great power and glory. Mark 13:26", "special_remarks": ["First Sunday of Advent"]}, "2026-11-30": {"prayer": "Forgiving God, how often we let the ways of the world blind us to your constant presence and love. We allow ourselves to wander in darkness, when all we need to do is allow your bright morning star to rise in our hearts. We turn to you this day with open eyes, open hearts, and open arms. Amen.", "doctrinal": "So we have the prophetic message more fully confirmed. You will do well to be attentive to this as to a lamp shining in a dark place, until the day dawns and the morning star rises in your hearts. 2 Peter 1:19", "daily_watchword": "Even the stork in the heavens knows its times, and the turtledove, swallow, and crane observe the time of their coming, but my people do not know the ordinance of the LORD. Jeremiah 8:7", "verses": ["Psalm 137", "1 Kings 20:22–21:16", "John 19:25–37"]}, "2026-12-01": {"prayer": "Father, Abba, we appreciate your steadfast commitment to our well-being. As we move through the world, may we not be swayed by its temptations. Instead, may we return to you. We are thankful for your unconditional love. We love you; we praise you; we glorify you, Lord. Amen.", "doctrinal": "Just so, I tell you, there is joy in the presence of the angels of God over one sinner who repents. Luke 15:10", "daily_watchword": "Return, O faithless children, I will heal your faithlessness. “Here we come to you, for you are the LORD our God.” Jeremiah 3:22", "verses": ["Psalm 138:1–5", "1 Kings 21:17–22:28", "John 19:38–20:9"]}, "2026-12-02": {"prayer": "Dear heavenly God, we appreciate your invitation to salvation. Please help us to stay focused on you and your will, and may we never lose the site of your guidance. May your soft voice always resonate within us. We are thankful for all your blessings and the gift of salvation you offer us. Amen.", "doctrinal": "Therefore we must pay greater attention to what we have heard, so that we do not drift away. Hebrews 2:1", "daily_watchword": "Incline your ear, and come to me; listen, so that you may live. Isaiah 55:3", "verses": ["Psalm 138:6–8", "1 Kings 22:29–53", "John 20:10–23"]}, "2026-12-03": {"prayer": "King of kings, we come before you to give you thanks for your thankfulness. You are our lord; we trust in you. You are always present with us, in every step we take. May we always trust your directions. Thank you. Amen.", "doctrinal": "Abraham was fully convinced that God was able to do what he had promised. Romans 4:21", "daily_watchword": "I formed you, you are my servant; O Israel, do not forget me. Isaiah 44:21", "verses": ["Psalm 139:1–6", "2 Kings 1:1–2:18", "John 20:24–31"]}, "2026-12-04": {"prayer": "Heavenly Father, we come to you with hope and faith, seeking your intervention in our lives. When struggling with mental or physical darkness, we humbly request that you deliver us into your radiant light of love. Thank you, infinite Power, for your compassion. In Jesus’ name, we pray. Amen.", "doctrinal": "Because of the tender mercy of our God, the dawn from on high will break upon us, to shine upon those who sit in darkness and in the shadow of death, to guide our feet into the way of peace. Luke 1:78-79", "daily_watchword": "Some sat in darkness and in gloom, prisoners in misery and in irons. Then they cried to the LORD in their trouble, and he saved them from their distress; let them thank the LORD for his steadfast love, for his wonderful works to humankind. Psalm 107:10,13,15", "verses": ["Psalm 139:7–12", "2 Kings 2:19–3:27", "John 21:1–14"]}, "2026-12-05": {"prayer": "Eternal God, we praise your holy name. We are grateful that you are consistent, that you never change who you are. We are grateful beyond measure for your sacrifices. Amen.", "doctrinal": "Jesus Christ is the same yesterday and today and forever. Hebrews 13:8", "daily_watchword": "I am the first, and I am the last; besides me there is no god. Isaiah 44:6", "verses": ["Psalm 139:13–16", "2 Kings 4:1–37", "John 21:15–25"]}, "2026-12-06": {"prayer": "Eternal Three-in-One, we celebrate your sacred presence. Guide us on life’s journey until you return. We pray for peace to prevail over darkness, and for love to transform our world. We pray in the name of the Father, Son, and Holy Spirit. Amen.", "doctrinal": "Give thanks to the Father, who has enabled you to share in the inheritance of the saints in the light. Colossians 1:12", "daily_watchword": "Those who bring thanksgiving as their sacrifice honor me; to those who go the right way, I will show the salvation of God. Psalm 50:23", "verses": ["Isaiah 40:1-11", "Psalm 85:1-2,8-13", "2 Peter 3:8-15a, Mark 1:1-8"], "weekly_watchword": "Watchword for the week — He will feed his flock like a shepherd; he will gather the lambs in his arms, and carry them in his bosom. Isaiah 40:11", "special_remarks": ["Second Sunday of Advent"]}, "2026-12-07": {"prayer": "Omnipotent Creator of everything, infinitely wise and powerful, we eagerly anticipate the day when we will be fully revealed as your children, united with you forever. Amen.", "doctrinal": "The creation itself will be set free from its enslavement to decay and will obtain the freedom of the glory of the children of God. Romans 8:21", "daily_watchword": "In his hand are the depths of the earth; the heights of the mountains are his also. Psalm 95:4", "verses": ["Psalm 139:17–24", "2 Kings 4:38–5:14", "Acts 1:1–14"]}, "2026-12-08": {"prayer": "Dear God, we come before you with hearts filled with profound joy and deep gratitude. May our lives serve as a testament to our unwavering devotion. May we present ourselves as a living sacrifice, worthy of your presence, as we humbly worship you. Amen.", "doctrinal": "Present your bodies as a living sacrifice, holy and acceptable to God, which is your reasonable act of worship. Romans 12:1", "daily_watchword": "Sing to the LORD; bless his name; tell of his salvation from day to day. Psalm 96:2", "verses": ["Psalm 140:1–5", "2 Kings 5:15–6:23", "Acts 1:15–26"]}, "2026-12-09": {"prayer": "Lord God, may we flourish in you, and always be willing to fulfill your divine purpose. Your peace and prosperity direct our lives; may we always acknowledge your omnipotence and our dependence on you. Make our lives abundantly fruitful, for without you, we are nothing. Amen.", "doctrinal": "Abide in me as I abide in you. Just as the branch cannot bear fruit by itself unless it abides in the vine, neither can you unless you abide in me. John 15:4", "daily_watchword": "They are like trees planted by streams of water, which yield their fruit in its season, and their leaves do not wither. Psalm 1:3", "verses": ["Psalm 140:6–13", "2 Kings 6:24–7:20", "Acts 2:1–13"]}, "2026-12-10": {"prayer": "Dear Lord, may our hearts overflow with joy and gratitude as we celebrate your infinite love and transformative power. We rejoice in the triumphs of answered prayers and honor your majesty. In Jesus’ name, we pray. Amen.", "doctrinal": "Surely from now on all generations will call me blessed, for the Mighty One has done great things for me, and holy is his name. Luke 1:48-49", "daily_watchword": "Come and hear, all you who fear God, and I will tell what he has done for me. Psalm 66:16", "verses": ["Psalm 141:1–4", "2 Kings 8", "Acts 2:14–28"]}, "2026-12-11": {"prayer": "Lord God, we humbly come before you seeking guidance and wisdom. Please be with us, for you know our deepest desires. Teach us to lead a righteous life, so when the time comes to stand before your throne, we will be deemed worthy. In Jesus’ name, we pray. Amen.", "doctrinal": "And before him no creature is hidden, but all are naked and laid bare to the eyes of the one to whom we must render an account. Hebrews 4:13", "daily_watchword": "Even before a word is on my tongue, O LORD, you know it completely. Psalm 139:4", "verses": ["Psalm 141:5–10", "2 Kings 9", "Acts 2:29–47"]}, "2026-12-12": {"prayer": "Almighty God, we ask that you be with us always. We seek your divine protection to empower us with courage and strength. May your presence be our guiding light to help us rise above life’s challenges. Amen.", "doctrinal": "They are Israelites, and to them belong the adoption, the glory, the covenants, the giving of the law, the worship, and the promises. Romans 9:4", "daily_watchword": "Spare your people, O LORD, and do not make your heritage a mockery. Joel 2:17", "verses": ["Psalm 142", "2 Kings 10", "Acts 3:1–10"]}, "2026-12-13": {"prayer": "Lord our God, when we are faced with worldly temptations, empower us to discern the difference between temporary pleasures and eternal life. May our hearts stay focused on the promise of eternity, and may we remain faithful to your will. In Jesus’ name, we pray. Amen.", "doctrinal": "And the world and its desire are passing away, but those who do the will of God abide forever. 1 John 2:17", "daily_watchword": "She took of its fruit and ate, and she also gave some to her husband, who was with her, and he ate. Genesis 3:6", "verses": ["Isaiah 61:1-4,8-11", "Psalm 126", "1 Thessalonians 5:16-24", "John 1:6-8,19-28"], "weekly_watchword": "Watchword for the week — May the God of peace sanctify you entirely; and may your spirit and soul and body be kept sound and blameless at the coming of our Lord Jesus Christ. 1 Thessalonians 5:23", "special_remarks": ["Third Sunday of Advent"]}, "2026-12-14": {"prayer": "Creator God, please protect us from the influence of deceit. Grant us the strength to remain faithful to you. Guide us along the right path; shield us from false teachings that seek to lead us astray. Direct our steps and enable us to stay focused on you, our lord, without wavering. In Jesus’ name, we pray. Amen.", "doctrinal": "And [Jesus] said, “Beware that you are not led astray, for many will come in my name and say, ‘I am he!’ and ‘The time is near!’ Do not go after them.” Luke 21:8", "daily_watchword": "Alas for the senseless prophets who follow their own spirit and have seen nothing! Ezekiel 13:3", "verses": ["Psalm 143:1–6", "2 Kings 11", "Acts 3:11–26"]}, "2026-12-15": {"prayer": "Heavenly Father, we come before you. Forgive our sins, purify our hearts, and lead us towards goodness. Help us to forgive one another and become better people. Through Jesus Christ, we pray. Amen.", "doctrinal": "And forgive us our sins, for we ourselves forgive everyone indebted to us. Luke 11:4", "daily_watchword": "O Jerusalem, wash your heart clean of wickedness so that you may be saved. How long shall your evil schemes lodge within you? Jeremiah 4:14", "verses": ["Psalm 143:7–12", "2 Kings 12,13", "Acts 4:1–12"]}, "2026-12-16": {"prayer": "Eternal Father, inspire us to live in harmony, united by love, compassion, and understanding. May your presence encourage us to uplift others. Fill our hearts with joy, and guide us to a better tomorrow. In Jesus’ name, we pray. Amen.", "doctrinal": "Finally, brothers and sisters, farewell. Be restored; listen to my appeal; agree with one another; live in peace. 2 Corinthians 13:11", "daily_watchword": "You shall not hate in your heart anyone of your kin; you shall reprove your neighbor, or you will incur guilt yourself. Leviticus 19:17", "verses": ["Psalm 144:1–4", "2 Kings 14", "Acts 4:13–22"]}, "2026-12-17": {"prayer": "Dear God, may your words fill us with the hope and the courage that comes from your guidance. Teach us to live with joy, gratitude, and strength. May the wisdom you’ve given us be a guiding light on our path. Thank you, Lord. Amen.", "doctrinal": "For whatever was written in former days was written for our instruction, so that by steadfastness and by the encouragement of the scriptures we might have hope. Romans 15:4", "daily_watchword": "Though I write for him the multitude of my instructions, they are regarded as a strange thing. Hosea 8:12", "verses": ["Psalm 144:5–8", "2 Kings 15", "Acts 4:23–37"]}, "2026-12-18": {"prayer": "Lord, hear our cry! When we come to you, we come as we are trusting your love will transform us. Take us in our brokenness, heal our hearts, and make us complete. Thank you, Lord! In Jesus’ name, we pray. Amen.", "doctrinal": "Great crowds came to him, bringing with them the lame, the blind, the maimed, the mute, and many others. They put them at his feet, and he cured them. Matthew 15:30", "daily_watchword": "Out of the depths I cry to you, O LORD. Lord, hear my voice! Psalm 130:1-2", "verses": ["Psalm 144:9–15", "2 Kings 16:1–17:6", "Acts 5:1–11"]}, "2026-12-19": {"prayer": "Supreme God, with reverence and hope, we stand before you, acknowledging your great love and power that motivates us daily. We trust that with your wisdom, we can achieve all things. Thank you, Lord. Amen.", "doctrinal": "For nothing will be impossible with God. Luke 1:37", "daily_watchword": "There is none like you, O LORD; you are great, and your name is great in might. Jeremiah 10:6", "verses": ["Psalm 145:1–7", "2 Kings 17:7–41", "Acts 5:12–16"]}, "2026-12-20": {"prayer": "Most High, may your boundless love surround us always and your watchful care keep us safe. May we walk in the beauty of your newness, filled with joy, peace, and hope. We honor your holy name, Lord. Amen.", "doctrinal": "The nations will walk by its light, and the kings of the earth will bring their glory into it. Revelation 21:24", "daily_watchword": "There is a river whose streams make glad the city of God, the holy habitation of the Most High. God is in the midst of the city; it shall not be moved. Psalm 46:4-5", "verses": ["2 Samuel 7:1-11,16", "Luke 1:47-55", "Romans 16:25-27", "Luke 1:26-38"], "weekly_watchword": "Watchword for the week — The Mighty One has done great things for me, and holy is his name. Luke 1:49", "special_remarks": ["Fourth Sunday of Advent"]}, "2026-12-21": {"prayer": "Redeeming Lord and God, may your presence uplift us to overcome life’s struggles. May we emerge stronger, our hearts and souls renewed, and when our time on this earth comes to a close, be with us, Lord. Amen.", "doctrinal": "While they were stoning Stephen, he prayed, “Lord Jesus, receive my spirit.” Acts 7:59", "daily_watchword": "You have taken up my cause, O Lord; you have redeemed my life. Lamentations 3:58", "verses": ["Psalm 145:8–16", "2 Kings 18", "Acts 5:17–40"]}, "2026-12-22": {"prayer": "Lord, we offer our heartfelt thanks for sending us your son, Jesus, our Lord. We are thankful for the blessings you have bestowed upon our children and families. With grateful hearts, we pray. Amen.", "doctrinal": "Elizabeth exclaimed with a loud cry, “Blessed are you among women, and blessed is the fruit of your womb.” Luke 1:42", "daily_watchword": "May the LORD give you increase, both you and your children. Psalm 115:14", "verses": ["Psalm 145:17–21", "2 Kings 19:1–28", "Acts 5:41–6:7"]}, "2026-12-23": {"prayer": "Creator of all people, may we always remember that we are equally loved by you. Help us to always love each other, and respect one another. Remind us that we are created in your own image. Thank you, God. Amen.", "doctrinal": "Nevertheless, in the Lord woman is not independent of man or man independent of woman. For just as woman came from man, so man comes through woman, but all things come from God. 1 Corinthians 11:11-12", "daily_watchword": "So God created humans in his image, in the image of God he created them; male and female he created them. Genesis 1:27", "verses": ["Psalm 146", "2 Kings 19:29–20:21", "Acts 6:8–7:3"]}, "2026-12-24": {"prayer": "Divine One, we honor your profound presence on this glorious night. Your majesty and power fill our hearts with hope and awe. We are grateful for the precious gift of your beloved son, who brings light to this world. May all glory and honor be yours, on this silent night and throughout every day of our lives. In Jesus’ name, we pray. Amen.", "doctrinal": "And we have seen and do testify that the Father has sent his Son as the Savior of the world. 1 John 4:14", "daily_watchword": "O LORD, you are our God; let no mortal prevail against you. 2 Chronicles 14:11", "verses": ["Psalm 147:1–6", "2 Kings 21:1–22:10", "Acts 7:4–16"]}, "2026-12-25": {"prayer": "Father, on this special day, we come before you to express our deepest gratitude for the gift of your word, a love letter of immense significance to humanity. Your deep love for us is demonstrated through the provision of your word of instruction for living our lives. We our grateful for our Lord Jesus, who brings light to our world. Amen.", "doctrinal": "When the angels had left them and gone into heaven, the shepherds said to one another, “Let us go now to Bethlehem and see this thing that has taken place, which the Lord has made known to us.” Luke 2:15", "daily_watchword": "Your word is a lamp to my feet and a light to my path. Psalm 119:105", "verses": ["Psalm 147:7–14", "2 Kings 22:11–23:20", "Acts 7:17–29"], "special_remarks": ["Nativity of the Lord (Christmas Day)", "Watchword for Christmas Day — Jesus is the reflection of God’s glory and the exact imprint of God’s very being, and he sustains all things by his powerful word. Hebrews 1:3", "Nativity of the Lord (Christmas Day) — Isaiah 52:7-10; Psalm 98", "Hebrews 1:1-4,(5-12); John 1:1-14"]}, "2026-12-26": {"prayer": "Faithful God, we wait in anticipation of the realization of your word in our lives. Assured that your promise was fulfilled through Jesus, we are deeply grateful to you for sending your son, Jesus, to adopt us as your children. Thank you, Lord. Amen.", "doctrinal": "But when the fullness of time had come, God sent his Son, born of a woman, born under the law, in order to redeem those who were under the law, so that we might receive adoption as children. Galatians 4:4-5", "daily_watchword": "[The LORD said to Jeremiah,] “I am watching over my word to perform it.” Jeremiah 1:12", "verses": ["Psalm 147:15–20", "2 Kings 23:21–24:20", "Acts 7:30–43"]}, "2026-12-27": {"prayer": "Merciful God, we humbly come before you today seeking forgiveness for the times we falter and sin against you. Lord, be our guiding light in times of failure. Thank you for redeeming us through Jesus’ sacrifices, and for the gift of forgiveness, which we humbly accept, knowing that we do not deserve it. In Jesus’ name, we pray. Amen.", "doctrinal": "In him we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace. Ephesians 1:7", "daily_watchword": "Happy are those whose transgression is forgiven, whose sin is covered. Psalm 32:1", "verses": ["Isaiah 61:10-62:3", "Psalm 148", "Galatians 4:4-7", "Luke 2:22-40"], "weekly_watchword": "Watchword for the week — But when the fullness of time had come, God sent his Son, born of a woman, born under the law, in order to redeem those who were under the law, so that we might receive adoption as children. Galatians 4:4,5", "special_remarks": ["First Sunday after Christmas Day"]}, "2026-12-28": {"prayer": "Loving God, we express our deepest gratitude for the abundance in our lives. We humbly ask that you bless and multiply our efforts in sharing your love. May our actions be filled with love, and may we always strive for the unity and peace you desire for us. May your peace be with all people. Amen.", "doctrinal": "Peace be to the brothers and sisters and love with faith, from God the Father and the Lord Jesus Christ. Ephesians 6:23", "daily_watchword": "Boaz said to the reapers, “The LORD be with you.” They answered, “The LORD bless you.” Ruth 2:4", "verses": ["Psalm 148:1–6", "2 Kings 25", "Acts 7:44–60"]}, "2026-12-29": {"prayer": "Dear Lord, we ask that you empower us to let go of pride. We recognize our shortcomings and sincerely repent. May your guidance enable us to heed your call, shed the weight of guilt and regret, and walk in obedience to your will. In Jesus’ name, we pray. Amen.", "doctrinal": "He said to him the third time, “Simon son of John, do you love me?” Peter felt hurt because he said to him the third time, “Do you love me?” And he said to him, “Lord, you know everything; you know that I love you.” John 21:17", "daily_watchword": "O God, you know my folly; the wrongs I have done are not hidden from you. Psalm 69:5", "verses": ["Psalm 148:7–14", "1 Chronicles 1:1–37", "Acts 8:1–8"]}, "2026-12-30": {"prayer": "Shining Light, teach us to live truthfully; guide us to recognize the destructive power of accusation. May we resolve not to judge our brothers and sisters; may our minds be preoccupied with good thoughts— positive and uplifting ideas—not destructive ones. May our hearts overflow with love for each other, and may we remain focused on you. Amen.", "doctrinal": "Finally, brothers and sisters, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is pleasing, whatever is commendable, if there is any excellence and if there is anything worthy of praise, think about these things. Philippians 4:8", "daily_watchword": "Keep far from a false charge. Exodus 23:7", "verses": ["Psalm 149", "1 Chronicles 1:38–2:17", "Acts 8:9–25"]}, "2026-12-31": {"prayer": "Holy God, we come before you with humility and in obedience. May we always be mindful of our duty to obey your divine will. Lord, guide us with your light. Teach us to obey your commandments, and heed your warnings so we may genially carry out your will as true members of your sacred family. We are grateful for your love and acceptance as we enter this new year. Hold onto us, Lord, and never let us go. Amen.", "doctrinal": "For whoever does the will of my Father in heaven is my brother and sister and mother. Matthew 12:50", "daily_watchword": "Therefore keep the commandments of the LORD your God by walking in his ways and by fearing him. Deuteronomy 8:6", "verses": ["Psalm 150", "1 Chronicles 2:18–55", "Acts 8:26–40"]}}